{
	"cards": {
		"g487aed6370_0_25": {
			"index": 19,
			"id": "g487aed6370_0_25",
			"title": "The Cynefin model of problem spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The <a href=\"https://en.wikipedia.org/wiki/Cynefin_framework\">Cynefin model</a> divides problems into four types, each with different properties.</p>\n<ul>\n\t<li><strong>Simple</strong> - Trivial problem spaces that require no special effort.</li>\n\t<li><strong>Complicated</strong> - Knowably hard. Intricate and challenging, but concrete and black and white. Efficiency will require a focus on the right process and structure.</li>\n\t<li><strong>Complex</strong> - <em>Unknowably</em> hard. Goals, methods, and even possible next actions are unclear, meaning <a card=\"g487aed6370_0_61\">fundamentally different approaches are required</a>.</li>\n\t<li><strong>Chaotic</strong> - So unknowably hard as to be inscrutable--impossible to control or predict. <a card=\"g487aed6370_0_30\">Beware diagnosing problems as chaotic</a> because it’s effectively giving up.</li>\n</ul>\n<p>Distinguishing between <a card=\"g487aed6370_0_45\">complex and complicated</a> is the most important in practice.</p>\n<p><em><span class='small'>Note on terminology: in the past I called what Cynefin calls “complex” “ambiguous”, and what it calls “complicated”, “complex”.  I’ve shifted to use Cynfefin’s terminology consistently.</span></em></p>",
			"slugs": "the-cynefin-model",
			"links": [
				"g487aed6370_0_61",
				"g487aed6370_0_30",
				"g487aed6370_0_45"
			],
			"inbound_links": [
				"g487aed6370_0_45",
				"g487aed6370_0_30"
			]
		},
		"g487aed6370_0_45": {
			"index": 20,
			"id": "g487aed6370_0_45",
			"title": "Complex vs Complicated",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In large organizations, two of the most common quadrants in the <a card=\"g487aed6370_0_25\">Cynefin mode</a>l are complex vs complicated. Complexity is, unit for unit, a couple of orders of magnitude more expensive to deal with than complication. Complex spaces require <a card=\"g487aed6370_0_61\">fundamentally different approaches</a> because they <a card=\"g4a9e93532f_0_10\">cannot be easily reduced to smaller problems</a>.</p>\n<p>Complicated problem spaces are hard, but knowably so. They require efficiency, careful structuring of the problem, and solid coordination to execute well. Think of them like a labyrinth--lots of branches and booby traps, but fundamentally mappable.</p>\n<p>Complex problem spaces are unknowably hard; the next steps, constraints, and even end goals often aren’t clear. New approaches are required. Think of complexity like a dense fog. Complexity is commonly referred to as ambiguity.</p>\n<p><a card=\"g487aed6370_0_50\">Insights are the way to reduce a complex problem to a merely complicated one.</a></p>\n<p></p>",
			"slugs": "complex-complicated",
			"links": [
				"g487aed6370_0_25",
				"g487aed6370_0_61",
				"g4a9e93532f_0_10",
				"g487aed6370_0_50"
			],
			"inbound_links": [
				"g487aed6370_0_25",
				"g487aed6370_0_40",
				"g4a9e93532f_0_10"
			]
		},
		"g487aed6370_0_40": {
			"index": 21,
			"id": "g487aed6370_0_40",
			"title": "Everything is complex",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Distinguishing a <a card=\"g487aed6370_0_45\">complex versus complicated</a> problem space is a key skill. Assume every problem space is complex until proven otherwise, especially because <a card=\"g487aed6370_0_96\">problems that involve humans are inherently complex</a>.</p>\n<p>Almost every problem space is actually inter-connected into one universe-sized problem space. When tackling a problem we decide where the bounds of the problem we have to consider are, in order to make it easier to tackle. In <a card=\"g487aed6370_0_10\">systems theory</a>, for example, this is where we decide to model the inputs/outputs in the system.</p>\n<p>As you understand a problem space, it reduces from complex to complicated as you learn what factors are extraneous to the problem at hand. But note that even a seemingly complicated problem space can <strong>become complex as conditions change, or as your goal becomes more nuanced</strong>, requiring a new approach.</p>",
			"slugs": "everything-is-complex",
			"links": [
				"g487aed6370_0_45",
				"g487aed6370_0_96",
				"g487aed6370_0_10"
			],
			"inbound_links": [
				"g487aed6370_0_111",
				"g487aed6370_0_55",
				"g487aed6370_0_291",
				"g487aed6370_0_121",
				"g487aed6370_0_96",
				"g48a31f22cb_0_55"
			]
		},
		"g487aed6370_0_106": {
			"index": 22,
			"id": "g487aed6370_0_106",
			"title": "Complex problem spaces require critical thinking",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Complex spaces require you to <a card=\"g487aed6370_0_111\">apply different lenses</a> to the problem to uncover insights. But there’s no one-size-fits-all approach.</p>\n<p>Fundamentally you must apply critical thinking and introspection via <a card=\"g487aed6370_0_35\">collaborative debate</a>.</p>\n<p>If it were possible to have a worksheet or other framework <a card=\"g487aed6370_0_121\">deliver insights without critical thinking</a>, then your problem space would be complicated, not complex.</p>",
			"slugs": "critical-thinking",
			"links": [
				"g487aed6370_0_111",
				"g487aed6370_0_35",
				"g487aed6370_0_121"
			],
			"inbound_links": [
				"g487aed6370_0_50",
				"g487aed6370_0_121"
			]
		},
		"g487aed6370_0_61": {
			"index": 23,
			"id": "g487aed6370_0_61",
			"title": "Embracing complexity means letting go of details",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_55\">Humans are biased away from complex problem spaces.</a> But correctly diagnosing a problem space as complex is only the first step.</p>\n<p>In complex problem spaces, you <strong>have to let go of the </strong><strong><a card=\"g487aed6370_0_76\">details that don’t matter</a></strong>, because they’re <a card=\"g487aed6370_0_71\">a dangerous illusion</a>. Doing this is hard, unnatural, and a little scary. But it’s the only way to see broader truths.</p>\n<p>You have to l<strong>et go of ever having solutions that are </strong><strong><em>both</em></strong><strong> detailed and clear.</strong> You can have one but not the other (and generally only the latter). When you let go, you can become <strong>cosmically calm</strong>, and high-level truths will become evident.</p>\n<p>Certain types of solutions are fundamentally impossible in complexity, although people who are uncomfortable with complexity will continue to demand them. </p>",
			"slugs": "embracing-complexity-details",
			"links": [
				"g487aed6370_0_55",
				"g487aed6370_0_76",
				"g487aed6370_0_71"
			],
			"inbound_links": [
				"g487aed6370_0_25",
				"g487aed6370_0_45"
			]
		},
		"g487aed6370_0_50": {
			"index": 24,
			"id": "g487aed6370_0_50",
			"title": "Insights distill complexity to mere complication",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>An <strong>insight is a clarifying observation that distills some amount of intractable complexity to the more tractable complication</strong>.</p>\n<p>Insights are naturally viral--they have a satisfying “aha!” moment and people often want to share them. They feel discovered rather than created. If the idea is not spreading, then it’s likely not a true insight.</p>\n<p><a card=\"g487aed6370_0_111\">Lenses are tools that can be used to mine insights</a>. There are no one-size-fits-all approaches; generating insights fundamentally requires <a card=\"g487aed6370_0_106\">critical thinking</a> and <a card=\"g487aed6370_0_141\">curiosity</a>.</p>\n<p><em>See also </em><em><a href=\"https://medium.com/@komorama/insights-distill-ambiguity-to-complexity-28951000ef72\">the original essay</a></em><em></em></p>",
			"slugs": "insights-distill-complexity",
			"links": [
				"g487aed6370_0_111",
				"g487aed6370_0_106",
				"g487aed6370_0_141"
			],
			"inbound_links": [
				"g487aed6370_0_45",
				"g487aed6370_0_111",
				"g487aed6370_0_35",
				"g48845643ff_0_403",
				"g48a31f22cb_0_40"
			]
		},
		"g487aed6370_0_111": {
			"index": 25,
			"id": "g487aed6370_0_111",
			"title": "Lenses mine insights from information",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_50\">Insights reduce complexity to mere complication</a>. Information is a collection of both underlying data, as well as other insights. <strong>Lenses are the tools that are used to mine insights from information, </strong>and can often be applied best in <a card=\"g487aed6370_0_35\">collaborative debate</a>.</p>\n<p>How useful a lens is is entirely contextual. A lens might be extremely productive at the beginning, but get less useful as all applicable insights in this space are mined, meaning that other lenses become relatively more productive.</p>\n<p><strong>Think of these tools as lenses, not frameworks</strong>, to emphasize that the lens should <a card=\"g487aed6370_0_121\">guide thinking, not replace it</a>.</p>\n<p>There is no one true lens; a complex space requires applying a <a card=\"g487aed6370_0_116\">diversity of lenses</a>. The over-application of any single lens leads to it replacing thinking, and is dangerous because <a card=\"g487aed6370_0_40\">all problem spaces are complex</a>.</p>",
			"slugs": "lenses-mine-insights",
			"links": [
				"g487aed6370_0_50",
				"g487aed6370_0_35",
				"g487aed6370_0_121",
				"g487aed6370_0_116",
				"g487aed6370_0_40"
			],
			"inbound_links": [
				"g487aed6370_0_106",
				"g487aed6370_0_50",
				"g487aed6370_0_35",
				"g487aed6370_0_116",
				"g487aed6370_0_10"
			]
		},
		"g487aed6370_0_141": {
			"index": 26,
			"id": "g487aed6370_0_141",
			"title": "Curiosity is a fundamental requirement in complex spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Curiosity means willingness to entertain new ideas, even ones that seem initially silly or unrelated. This can take the form of new <a card=\"g487aed6370_0_116\">lenses</a> or new information.</p>\n<p>Someone who is curious, when <a card=\"g4871092f30_0_1581\">presented with something surprising</a>, will dig in and seek to earnestly understand and learn from it. Sometimes called “open-mindedness”</p>\n<p>Curiosity means being comfortable with ambiguity and not being <a card=\"g487aed6370_0_286\">overly tempted to artificially reduce interesting phenomena to misleading details too early</a>.</p>\n<p>If you <a card=\"g4871092f30_0_1581\">find yourself surprised</a> by any information at all, then that’s a sign that there’s something you’ve been missing that could possibly be a salient constraint and you should dig in.</p>",
			"slugs": "curiosity",
			"links": [
				"g487aed6370_0_116",
				"g4871092f30_0_1581",
				"g487aed6370_0_286"
			],
			"inbound_links": [
				"g487aed6370_0_50",
				"g487aed6370_0_35",
				"g487aed6370_0_121",
				"g487aed6370_0_131",
				"g48845643ff_0_509"
			]
		},
		"g487aed6370_0_55": {
			"index": 27,
			"id": "g487aed6370_0_55",
			"title": "Humans are biased away from complex problem spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Complicated problem-spaces are familiar, sharp, and comfortingly concrete. Complex problem spaces are foreign, fuzzy, and disturbingly abstract.</p>\n<p>In addition, complex problem spaces take much longer to analyze and understand, and in day-to-day operations there are often many fires to fight.</p>\n<p>People have a natural bias towards the “easier” framing, so it’s critical to always <a card=\"g487aed6370_0_40\">assume that a problem space is complex</a> until proven otherwise, especially because <a card=\"g487aed6370_0_40\">more problem spaces are complex</a> than people realize.</p>\n<p></p>\n<p></p>",
			"slugs": "humans-dislike-complex",
			"links": [
				"g487aed6370_0_40"
			],
			"inbound_links": [
				"g487aed6370_0_61",
				"g487aed6370_0_71",
				"g48845643ff_1_5",
				"g4a41d8c468_1_47",
				"g4a9e93532f_0_15"
			]
		},
		"g487aed6370_0_66": {
			"index": 28,
			"id": "g487aed6370_0_66",
			"title": "Nothing is black and white in complex problem spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In <em>simple</em> or <em>complicated</em> problem spaces, many things are black and white (either trivially, or intricately, respectfully). But in complex problem spaces, <strong>everything is a shade of gray</strong>.</p>\n<p>Resist trying to make facts black and white, because you will lose the nuance necessary to come to the correct solutions, and those reductions can give the <a card=\"g487aed6370_0_71\">illusion of clarity</a>.</p>\n<p>Instead of thinking in terms of binary true or false outcomes, think in terms of <strong>probability distributions</strong>, and <strong>Expected Value (EV)</strong> on top of those distributions.</p>\n<p>This is especially true as you try to predict forward in time, as <a card=\"g48845643ff_0_121\">things get exponentially less clear over time</a>.</p>",
			"slugs": "black-and-white",
			"links": [
				"g487aed6370_0_71",
				"g48845643ff_0_121"
			],
			"inbound_links": [
				"g487aed6370_0_71",
				"g48845643ff_0_121",
				"g487aed6370_0_256",
				"g487aed6370_0_251",
				"g487aed6370_0_91",
				"g487aed6370_0_131"
			]
		},
		"g487aed6370_0_71": {
			"index": 29,
			"id": "g487aed6370_0_71",
			"title": "In complex spaces, detail is a dangerous illusion",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>We’re <a card=\"g487aed6370_0_55\">biased</a> towards things that are black-and-white and concrete. But <a card=\"g487aed6370_0_66\">in complex spaces, everything is gray</a>. Pretending otherwise is a comforting but dangerous lie.</p>\n<p>In complex spaces, <strong>details are noise</strong>: insignificant and distracting, just like too many significant digits would be. Only by letting go of them can you see the abstract but clarifying large-scale patterns that help you make powerful predictions.</p>\n<p>In complex spaces, detail is:</p>\n<ul>\n\t<li><strong><span class='small'>Expensive to generate</span></strong><span class='small'> For the same reasons as </span><span class='small'><a href=\"https://www.owenstephens.co.uk/blog/2014/09/28/NFA_DFA.html\">exponential blow-up in converting from an NFA to DFA</a></span><span class='small'></span></li>\n\t<li><strong><span class='small'>Almost certainly wrong</span></strong><span class='small'> Because it relies on assigning arbitrary values to unknown details</span></li>\n\t<li><strong><span class='small'>Distracting</span></strong><span class='small'> Because of the extraordinary opportunity cost, given its high expense</span></li>\n\t<li><strong><span class='small'>Dangerous</span></strong><span class='small'> Because the illusion of clarity it provides will prevent you from changing course as you learn more, especially given the sunk cost on it, requiring lots of energy to break free of</span></li>\n</ul>\n<p></p>\n<p></p>",
			"slugs": "detail-illusion",
			"links": [
				"g487aed6370_0_55",
				"g487aed6370_0_66"
			],
			"inbound_links": [
				"g487aed6370_0_61",
				"g487aed6370_0_66",
				"g487aed6370_0_76",
				"g487aed6370_0_156",
				"g4871092f30_0_1551"
			]
		},
		"g48845643ff_0_121": {
			"index": 30,
			"id": "g48845643ff_0_121",
			"title": "Things get exponentially harder to predict over time",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>If you have an inter-related problem space, then the state of the system at time n relies on the state of the system at time (n - 1), and so on back to the current time. </p>\n<p>This has a mathematically compounding effect, making the future, even one in a relatively simple system, get <strong>exponentially less clear over time</strong>.</p>\n<p>Complex problem spaces often <em><a card=\"g487aed6370_0_66\">start </a></em><a card=\"g487aed6370_0_66\">with more gray</a> and have a more strongly inter-related dynamic, which means that in these systems precise detail in the future is often fundamentally unknowable.</p>\n<p>However, if you understand the large-scale patterns and forces in your system, you can still make probabilistic predictions of large-scale outcomes that are still true. It would be a <a card=\"g487aed6370_0_30\">mistake to categorize any problem that requires forecasting as chaotic</a>. </p>\n<p></p>",
			"slugs": "time-exponential",
			"links": [
				"g487aed6370_0_66",
				"g487aed6370_0_30"
			],
			"inbound_links": [
				"g487aed6370_0_66",
				"g48a31f22cb_0_50",
				"g4a6111ef7e_0_5"
			]
		},
		"g487aed6370_0_30": {
			"index": 31,
			"id": "g487aed6370_0_30",
			"title": "Beware diagnosing problem spaces as chaotic",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>It’s tempting to diagnose a problem space as <a card=\"g487aed6370_0_25\">chaotic</a>. But that’s a cheat; it asserts that it’s impossible to ever get clarity on the problem space and you can stop trying.</p>\n<p>Diagnosing the hidden complexities in a problem space takes time, careful study, <a card=\"g487aed6370_0_35\">collaborative debate</a>, and applying different lenses.</p>\n<p>But often high-level patterns can be deduced in what seemed like a chaotic problem space, and from there you can deduce smaller and smaller insights. Tools like <a card=\"g487aed6370_0_10\">systems theory</a> are especially valuable for this.</p>\n<p>In an unknowable problem space, default to assuming it’s complex, to help stay motivated to understand it.</p>",
			"slugs": "beware-chaotic",
			"links": [
				"g487aed6370_0_25",
				"g487aed6370_0_35",
				"g487aed6370_0_10"
			],
			"inbound_links": [
				"g487aed6370_0_25",
				"g48845643ff_0_121"
			]
		},
		"g487aed6370_0_76": {
			"index": 32,
			"id": "g487aed6370_0_76",
			"title": "Focus on direction, not solution, in complex problem spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complex problem spaces, <a card=\"g487aed6370_0_71\">detail is a dangerous illusion</a>.</p>\n<p>Instead of focusing on a detailed solution that is expensive, distracting, and almost certainly wrong, <strong>focus on direction</strong>. </p>\n<p>Once you know your <a card=\"g487aed6370_0_81\">north star</a>, ask yourself, for a given question before us, <strong>would the direction of my next action change depending on what the answer turns out to be</strong>? If the answer is no (or would be a miniscule directional change), don’t worry about answering it because it doesn’t matter. In fact, <a card=\"g487aed6370_0_86\">keeping the question open can be useful</a>.</p>\n<p>Often the exact detail is unknowable, but all that matters is <strong>order of magnitude</strong> of various outcomes, which is much easier to estimate (probabilistically, at least) using <a card=\"g487aed6370_0_116\">various abstract lenses</a>.</p>",
			"slugs": "direction-not-solution",
			"links": [
				"g487aed6370_0_71",
				"g487aed6370_0_81",
				"g487aed6370_0_86",
				"g487aed6370_0_116"
			],
			"inbound_links": [
				"g487aed6370_0_61",
				"g487aed6370_0_81",
				"g487aed6370_0_86",
				"g487aed6370_0_156"
			]
		},
		"g487aed6370_0_35": {
			"index": 33,
			"id": "g487aed6370_0_35",
			"title": "Collaborative debate is the best tool in complex spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Adversarial debate is more familiar, but it presumes that the answer is one of two options. That only applies in complicated problem spaces, not complex.</p>\n<p>The fundamental difference with collaborative debate is a <strong>positive-sum </strong>perspective. All participants must be <a card=\"g487aed6370_0_141\">curious</a>, keep an open mind, and seek to understand. The debate should be <a card=\"g487aed6370_0_171\">intellectually but not emotionally intense</a>.</p>\n<p>No single person has the right skill sets, experiences, and perspectives to fully understand a complex problem space. Diversity of perspective (both underlying data and <a card=\"g487aed6370_0_111\">lenses</a>) is the raw material for comprehensive <a card=\"g487aed6370_0_50\">insight</a>.</p>\n<p><strong>The conditions for collaborative debate are not natural occurring and must be </strong><strong><a card=\"g487aed6370_0_166\">actively created</a></strong><em>. See also the essay </em><em><a href=\"https://medium.com/@komorama/debate-should-be-collaborative-not-combative-185ff37f1d34\">Debate should be collaborative, not combative</a></em><em>.</em></p>",
			"slugs": "collaborative-debate",
			"links": [
				"g487aed6370_0_141",
				"g487aed6370_0_171",
				"g487aed6370_0_111",
				"g487aed6370_0_50",
				"g487aed6370_0_166"
			],
			"inbound_links": [
				"g487aed6370_0_106",
				"g487aed6370_0_111",
				"g487aed6370_0_30",
				"g487aed6370_0_5",
				"g487aed6370_0_171",
				"g487aed6370_0_181",
				"g487aed6370_0_136",
				"g48845643ff_1_50",
				"g487aed6370_0_196"
			]
		},
		"g487aed6370_0_161": {
			"index": 34,
			"id": "g487aed6370_0_161",
			"title": "Ideas are only good if they don’t violate constraints",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>This includes constraints that aren’t obvious, or that you <em>wish</em> didn’t apply in your problem space, or that your leadership told you (erroneously) to ignore.</p>\n<p>This can also be stated as good ideas must be <strong><a card=\"g487aed6370_0_241\">plausible without miracles </a></strong>in all salient ways, even ways that aren’t obvious.</p>\n<p><a card=\"g48845643ff_0_66\">Constraints take many forms</a>, like whether the ideas will be easy to socialize, will fit within office politics, etc. <strong>Human constraints are real, powerful, and omnipresent</strong>, and any idea that doesn’t <a card=\"g48845643ff_1_5\">fit within them will fail</a>.</p>",
			"slugs": "good-ideas-constraints",
			"links": [
				"g487aed6370_0_241",
				"g48845643ff_0_66",
				"g48845643ff_1_5"
			],
			"inbound_links": [
				"g487aed6370_0_256",
				"g48a31f22cb_0_50",
				"g487aed6370_0_261",
				"g487aed6370_0_81",
				"g487aed6370_0_286",
				"g48845643ff_0_453",
				"g487aed6370_0_241",
				"g48845643ff_0_66",
				"g4a6111ef7e_0_45",
				"g4a9e93532f_0_10"
			]
		},
		"g487aed6370_0_0": {
			"index": 35,
			"id": "g487aed6370_0_0",
			"title": "The adjacent possible",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The <a href=\"http://www.practicallyefficient.com/2010/09/28/the-adjacent-possible.html\">adjacent possible</a> is the collection of actions and outcomes that neighbor the current situation for a team or problem space. It’s the set of outcomes that could be achieved with no <a card=\"g487aed6370_0_241\">discontinuity</a>.</p>\n<p>Moving between adjacent possible states is often called “<a card=\"g48845643ff_0_484\">incrementalism</a>”, but in complex spaces where <a card=\"g48845643ff_0_155\">many possible configurations would not work</a>, it is the only approach to making progress--so long as you’re guided by a <a card=\"g487aed6370_0_81\">north-star</a> for direction.</p>\n<p>Solutions in the adjacent possible often <a card=\"g487aed6370_0_261\">have the wind at their back</a>, because they harness and fit within existing momentums and power structures within the system. The adjacent possibilities to a system in equilibrium are often themselves configurations in a state of equilibrium. Often you can <a card=\"g48845643ff_0_132\">harness energy of other agents</a> to search the space of the adjacent possible for you and prioritize ideas.</p>\n<p></p>",
			"slugs": "adjacent-possible",
			"links": [
				"g487aed6370_0_241",
				"g48845643ff_0_484",
				"g48845643ff_0_155",
				"g487aed6370_0_81",
				"g487aed6370_0_261",
				"g48845643ff_0_132"
			],
			"inbound_links": [
				"g487aed6370_0_20",
				"g487aed6370_0_241",
				"g487aed6370_0_301",
				"g4a3ed6c576_0_34",
				"g48845643ff_0_443",
				"g4871092f30_0_1541",
				"g4a3ed6c576_0_44"
			]
		},
		"g487aed6370_0_256": {
			"index": 36,
			"id": "g487aed6370_0_256",
			"title": "Simultaneously think about short and long-term",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>If you think only about what works in the short-term, it’ll be a <strong><a href=\"https://en.wikipedia.org/wiki/Random_walk\">random walk</a></strong> through the solution space, and in the long-term you won’t have kicked off any <a card=\"g487aed6370_0_20\">compounding value</a>.</p>\n<p>If you think only about what works in the long-term, it will be an exercise of <strong>navel-gazing</strong>, and you’ll design solutions that aren’t <a card=\"g487aed6370_0_161\">plausible in practice</a> because they violate constraints that aren’t yet obvious (because <a card=\"g487aed6370_0_66\">the future gets exponentially more fuzzy</a>).</p>\n<p>The correct approach in any complex environment is to craft a <a card=\"g487aed6370_0_81\">north-star</a> and then day-to-day <a card=\"g487aed6370_0_261\">focus on solutions that have the wind at your back</a> but that the highest <a card=\"g48845643ff_0_398\">velocity</a> towards the north star. This allows you to focus on learning more while still adding value that is likely to compound. This approach is always the best in complexity.</p>\n<p><em>See also </em><em><a card=\"g487aed6370_0_251\">everything is a balance</a></em><em></em></p>",
			"slugs": "short-and-long-term",
			"links": [
				"g487aed6370_0_20",
				"g487aed6370_0_161",
				"g487aed6370_0_66",
				"g487aed6370_0_81",
				"g487aed6370_0_261",
				"g48845643ff_0_398",
				"g487aed6370_0_251"
			],
			"inbound_links": [
				"g487aed6370_0_81",
				"g48845643ff_1_5"
			]
		},
		"g48a31f22cb_0_50": {
			"index": 37,
			"id": "g48a31f22cb_0_50",
			"title": "Minimize time to adding initial value",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complex spaces, <a card=\"g48845643ff_0_121\">things get exponentially fuzzier farther into the future</a>. It’s often easy to miss key constraints, <a card=\"g48845643ff_0_453\">designing a solution that no one actually wants</a>.</p>\n<p>You should have a long-term <a card=\"g487aed6370_0_81\">north-star</a> that you’re working towards, and take as <a card=\"g48845643ff_0_234\">long-term a perspective as your runway allows.</a> But a thriving solution is a system in equilibrium, and <a card=\"g48845643ff_0_155\">those are impossible to create in a lab</a>.</p>\n<p>\u000bTear down your solution to the <strong>smallest thing that plausibly adds non-zero value in 6 months or less</strong>, while having a path to iteratively be built towards your north star.</p>\n<p>You can use then harness the energy of real-world demand<a card=\"g48845643ff_0_132\"> to help you prioritize</a> steps within your adjacent possible. Plus, there’s a good chance that the thing you designed will <a card=\"g487aed6370_0_161\">violate some hidden constraint</a>. See also <a card=\"g48845643ff_0_453\">the myth of infrastructure</a>.</p>\n<p></p>",
			"slugs": "minimize-time-to-value",
			"links": [
				"g48845643ff_0_121",
				"g48845643ff_0_453",
				"g487aed6370_0_81",
				"g48845643ff_0_234",
				"g48845643ff_0_155",
				"g48845643ff_0_132",
				"g487aed6370_0_161"
			],
			"inbound_links": [
				"g48845643ff_0_234",
				"g48845643ff_0_453",
				"g4a3ed6c576_0_34",
				"g4a6111ef7e_0_5"
			]
		},
		"g487aed6370_0_261": {
			"index": 38,
			"id": "g487aed6370_0_261",
			"title": "Focus on solutions where the wind is at your back",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>That is, the dynamics of the problem space are already driving the outcome generally in a good direction, and all that’s necessary is <a card=\"g487aed6370_0_236\">nudges</a> to tweak direction. There are a near infinite number of things that you could do in a complex space, and fighting a hurricane force headwind will almost certainly fail.</p>\n<p>Identifying a direction with the wind at your back is often one of the primary hidden constraints. Note that winds are often hard to detect, even when extremely powerful. The wind feels at your back when your ideas don’t <a card=\"g487aed6370_0_161\">violate any constraints</a>.</p>\n<p>The correct approach often manifests as <strong>solving a problem for which there is clear and concrete short-term demand, that still lines up with the direction you’re trying to do</strong>.</p>\n<p><em>See also the original essay </em><em><a href=\"https://medium.com/@komorama/the-energy-of-human-scale-systems-bc5411684563\">The Energy of Human-Scale Systems</a></em><em>.</em></p>",
			"slugs": "wind-at-your-back",
			"links": [
				"g487aed6370_0_236",
				"g487aed6370_0_161"
			],
			"inbound_links": [
				"g487aed6370_0_0",
				"g487aed6370_0_256",
				"g487aed6370_0_81",
				"g487aed6370_0_271",
				"g4a3ed6c576_0_34",
				"g48845643ff_0_66"
			]
		},
		"g487aed6370_0_81": {
			"index": 39,
			"id": "g487aed6370_0_81",
			"title": "Use north stars in complex spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complex spaces, you <a card=\"g487aed6370_0_76\">focus on direction, not solutions</a>, because so many of the constraints are not yet known. North stars are the ideal that you sight off of to give you the direction you should be headed.</p>\n<p>North stars must be sufficiently far in the the future (at least 3 years), otherwise the arbitrary constraints of today will dominate the analysis. The right level of detail is roughly two pages of content, with no team names or pictures. North stars may shift as you learn more, with your day-to-day execution curving in the new direction.</p>\n<p><strong>North stars must be both comprehensively plausible and desirable</strong>. Plausible means that they <a card=\"g487aed6370_0_161\">don’t violate </a><em><a card=\"g487aed6370_0_161\">any</a></em><a card=\"g487aed6370_0_161\"> constraints</a> (even ones that aren’t yet known to the team).</p>\n<p>North stars, combined with executing in directions with the <a card=\"g487aed6370_0_261\">wind at your back</a>, are the <a card=\"g487aed6370_0_256\">correct way to navigate complex spaces</a>.</p>\n<p></p>",
			"slugs": "north-stars",
			"links": [
				"g487aed6370_0_76",
				"g487aed6370_0_161",
				"g487aed6370_0_261",
				"g487aed6370_0_256"
			],
			"inbound_links": [
				"g487aed6370_0_76",
				"g487aed6370_0_0",
				"g487aed6370_0_256",
				"g48a31f22cb_0_50",
				"g48845643ff_1_5",
				"g487aed6370_0_156",
				"g487aed6370_0_231",
				"g487aed6370_0_20",
				"g487aed6370_0_191",
				"g4a3ed6c576_0_34",
				"g48845643ff_0_459"
			]
		},
		"g487aed6370_0_291": {
			"index": 40,
			"id": "g487aed6370_0_291",
			"title": "Navigating complex spaces takes time",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Complicated problems require a very small amount of time in the <a card=\"g487aed6370_0_5\">discovery phase, and spend most of the time on the performance phase</a>. Complex problems require a much higher proportion of time in the discovery phase, sussing out the underlying constraints.</p>\n<p>In practice, <strong>complex problems takes 10x or more time than complicated problems</strong>.</p>\n<p>Almost all problems are <a card=\"g487aed6370_0_40\">actually complex</a>. If you plan your work assuming the problem space is merely complicated, you’ll undershoot the actual time requirements by an order of magnitude. This mismatch will lead to a constant friction as people are stretched way too thin, and <a card=\"g48845643ff_0_464\">finger-pointing and frustration ensue</a>.</p>\n<p></p>",
			"slugs": "complexity-takes-times",
			"links": [
				"g487aed6370_0_5",
				"g487aed6370_0_40",
				"g48845643ff_0_464"
			]
		},
		"g48845643ff_0_469": {
			"index": 41,
			"id": "g48845643ff_0_469",
			"title": "Make space for long-term thinking",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>People crave detail and like to focus on execution and “getting things done.” But long-term thinking is important in complexity. You must <strong>actively create space for it</strong>.</p>\n<p>Carve out time to discuss the long-term, insulating it from the chaos of the day-to-day with a block of time scheduled far in advance. Some people naturally like long-term thinking more. Don’t force those who don’t like it to attend if they don’t want (but make sure they’re invited).</p>\n<p>Offsites (when budget allows) help get people outside of their normal routines, making it easier to think long-term.</p>\n<p>If you can’t convince your team to take the time, force <em>yourself</em> to. Schedule a fake OOO day that you devote entirely to long-term reflection.</p>",
			"slugs": "make-space-long-term",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_296"
			]
		},
		"g487aed6370_0_286": {
			"index": 42,
			"id": "g487aed6370_0_286",
			"title": "In complex spaces, don’t cling to ideas that won’t work",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Often complex problems have many interrelated loops and constraints. It can be tempting to <a card=\"g48845643ff_1_10\">factor out sub-aspects of the problem to make it more tractable</a>. This is a good idea, but often the irreducible core of the problem has a lot of moving pieces, and in practice by default people factor out more of the problem than they should. This is especially true in complex spaces because they often have <a card=\"g4a3ed6c576_0_29\">emergent properties</a>.</p>\n<p>If you ignore actual constraints in the system, you’ll come up with ideas that sound plausible but actually won’t work. This both wastes time, and requires active energy to get people to move on from the sunk cost.</p>\n<p>The world is a messy place, and there are a number of <a card=\"g48845643ff_0_255\">fundamental, powerful, but inconvenient forces</a>. Ignoring them, while comforting in the short term, <a card=\"g48845643ff_0_270\">is a recipe for frustration and failure</a>. A corollary of <a card=\"g487aed6370_0_161\">good ideas must fit the constraints</a>. </p>",
			"slugs": "dont-cling-bad-ideas",
			"links": [
				"g48845643ff_1_10",
				"g4a3ed6c576_0_29",
				"g48845643ff_0_255",
				"g48845643ff_0_270",
				"g487aed6370_0_161"
			],
			"inbound_links": [
				"g487aed6370_0_141",
				"g48845643ff_1_10",
				"g4a3ed6c576_0_29"
			]
		},
		"g48845643ff_1_5": {
			"index": 43,
			"id": "g48845643ff_1_5",
			"title": "Ignoring complexity will come back to bite you",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complexity the best way to work is to <a card=\"g487aed6370_0_256\">have your north-star, and then pick solutions with the wind at your back with high velocity towards that north star</a>.</p>\n<p>You often want to pick short-term direction based on what feels best without over-complicating it, but that is only a good idea if you already have a good sense of the overall dynamics of the space well enough first. Because <a card=\"g487aed6370_0_55\">people tend to prefer detail</a>, there is a strong bias to leave discovery phase way too early.</p>\n<p>If you don’t understand your problem space well enough to have a <a card=\"g487aed6370_0_81\">north-star that is both plausible and good</a>, then that lack of understanding will come back to bite you, in the short or medium term.</p>",
			"slugs": "ignoring-bites",
			"links": [
				"g487aed6370_0_256",
				"g487aed6370_0_55",
				"g487aed6370_0_81"
			],
			"inbound_links": [
				"g487aed6370_0_161"
			]
		},
		"g487aed6370_0_121": {
			"index": 44,
			"id": "g487aed6370_0_121",
			"title": "Structure should guide thinking, not replace it",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Structure can be applied to complicated problem spaces to help make them more efficient, by reducing ambiguity and giving good defaults.</p>\n<p>But <a card=\"g487aed6370_0_40\">all problem spaces are fundamentally complex</a>, and structure over time tends to lock in things that are no longer true, meaning it can come to obscure the right answers. Fundamentally complex spaces require <a card=\"g487aed6370_0_141\">curiosity</a> and <a card=\"g487aed6370_0_106\">critical thinking</a>.</p>\n<p>Note that as time goes on, any structure (process or framework) in place will tend to ossify, as more and more of the team has joined only after it was in place, and not be familiar with the underlying thinking. When this happens, often <a card=\"g487aed6370_0_151\">no one can answer why</a>.</p>\n<p>An application of this insight is that <a card=\"g4871092f30_0_1531\">process should only formalize how things already work</a>.</p>",
			"slugs": "structure-should-guide-not-replace",
			"links": [
				"g487aed6370_0_40",
				"g487aed6370_0_141",
				"g487aed6370_0_106",
				"g487aed6370_0_151",
				"g4871092f30_0_1531"
			],
			"inbound_links": [
				"g487aed6370_0_106",
				"g487aed6370_0_111",
				"g487aed6370_0_156",
				"g48845643ff_0_250"
			]
		},
		"g487aed6370_0_306": {
			"index": 45,
			"id": "g487aed6370_0_306",
			"title": "Mis-applied structure actively obfuscates",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Structure here means process, frameworks, and plans. Structure is a great tool to help reduce complexity to mere complication. However, humans crave clarity and detail, which means we tend to <strong>apply structure too early</strong>. </p>\n<p>A structure that doesn’t actually “capture” or “explain” the underlying power structures and problem space is an active headwind, because it obscures what is actually happening. It’s similar to <a href=\"http://wiki.c2.com/?PrematureOptimization\">premature optimization</a>. </p>\n<p>Misapplied structure incorrectly implies a space is merely a complicated one, configured in a particular (wrong) way. This creates a headwind that must be actively overcome to get good things to happen, because people must overcome the inertia of the structure to figure out how it actually works.</p>\n<p>A corollary is to <a card=\"g4871092f30_0_1536\">apply process only retroactively</a>. </p>",
			"slugs": "bad-structure-obfuscates",
			"links": [
				"g4871092f30_0_1536"
			],
			"inbound_links": [
				"g4871092f30_0_1571",
				"g48845643ff_0_105",
				"g48845643ff_0_433",
				"g4871092f30_0_1531",
				"g4a3ed6c576_4_0"
			]
		},
		"g487aed6370_0_86": {
			"index": 46,
			"id": "g487aed6370_0_86",
			"title": "In complex spaces, avoid collapsing the wave function early",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complex spaces, you need to <a card=\"g487aed6370_0_76\">focus on direction, as opposed to solution</a>. You can think of the lingering ambiguity being in a superposition of possible final states according to some probability distribution.</p>\n<p>Every detail that you “lock in” is an ambiguity that has been definitively decided--collapsing the quantum state into a particular outcome that is likely wrong.</p>\n<p><strong>But in complex spaces, flexibility and maneuvering room can be extremely useful</strong>, as you learn more and get more clarity on the problem space. For example, they make building rough consensus easier, which can then be tightened and improved.</p>\n<p>People like detail and clarity so will want to collapse things earlier than you should. If you don’t need that detail to clarify something in the short-term, don’t collapse it.</p>",
			"slugs": "avoid-collapsing-wave-function",
			"links": [
				"g487aed6370_0_76"
			],
			"inbound_links": [
				"g487aed6370_0_76"
			]
		},
		"g487aed6370_0_156": {
			"index": 47,
			"id": "g487aed6370_0_156",
			"title": "Beware confusing means for ends",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The end is the “what” you want to accomplish. The means is simply the “how”; important to have a plausible approach but unimportant in and of itself.</p>\n<p>Because people tend to <a card=\"g487aed6370_0_71\">avoid abstract thinking and cling to detail</a> and over time teams tend to <a card=\"g487aed6370_0_121\">let their structure replace their thinking</a>, a team that was set up correctly to achieve a given end can often forget the end they were aiming for and instead become overly focused on sustaining the means.</p>\n<p>The end is your <a card=\"g487aed6370_0_81\">northstar</a>, the <a card=\"g487aed6370_0_76\">direction you should go</a>. If you forget your northstar, you’ll be lost. You’ll continue on auto-pilot, and small directional errors will compound over years, potentially putting you badly off course.</p>\n<p>If you can’t <a card=\"g487aed6370_0_151\">answer “Why?”</a> then it’s likely you’re confusing your means for an end. Teams will tend to violently resist detecting this in themselves.</p>",
			"slugs": "confusing-means-ends",
			"links": [
				"g487aed6370_0_71",
				"g487aed6370_0_121",
				"g487aed6370_0_81",
				"g487aed6370_0_76",
				"g487aed6370_0_151"
			],
			"inbound_links": [
				"g487aed6370_0_151",
				"g48845643ff_0_250"
			]
		},
		"g487aed6370_0_251": {
			"index": 48,
			"id": "g487aed6370_0_251",
			"title": "Everything is a balance",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complex spaces, <a card=\"g487aed6370_0_66\">everything is a shade of gray</a>. Black and white absolutes simply do not exist.</p>\n<p><strong>Many desirable properties turn out to be in tension in a fundamental trade-off.</strong> Some tensions are obvious (broad vs deep, velocity vs quality). But some are much more subtle (<a card=\"g4a9e93532f_0_5\">transparency vs candor</a>, messiness vs resilience in ecosystems).</p>\n<p>If you seek black and white answers, you’ll tend to get things out of balance, so you’ll end up flip flopping between two ends of the spectrum, swinging back and forth. This concept is also referred to as polarities.</p>\n<p>If a problem looks like there’s an obvious black-and-white solution, look for the hidden factors it’s in balance with, and ensure you introduce check metrics or otherwise keep them in balance. Even though everything is a balance <a card=\"g48845643ff_1_50\">compromise is often a cop out</a>.</p>",
			"slugs": "everything-balance",
			"links": [
				"g487aed6370_0_66",
				"g4a9e93532f_0_5",
				"g48845643ff_1_50"
			],
			"inbound_links": [
				"g487aed6370_0_256",
				"g48845643ff_1_50",
				"g4a6111ef7e_0_45",
				"g4a9e93532f_0_5"
			]
		},
		"g48845643ff_0_234": {
			"index": 49,
			"id": "g48845643ff_0_234",
			"title": "Be as patient as your runway allows",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>A long-term perspective helps find sustainable approaches to problems--it’s the only way to spot potential <a card=\"g487aed6370_0_20\">compounding effects of infrastructure</a> or <a card=\"g487aed6370_0_236\">nudges</a>.</p>\n<p>If you have 3 months left, planning a five year vision is folly. But if you know you’ll be around in 5 years, you can do <a card=\"g487aed6370_0_236\">nudges</a> that will compound and lead to 100x or 1000x outcomes with <em>relatively </em>little work. <strong>You should take as long-term a perspective as your runway allows.</strong></p>\n<p>Remember to <a card=\"g48a31f22cb_0_50\">minimize the time to adding value</a> to ensure you aren’t chasing an idea that won’t work--this advice is primarily to allow you to spot compounding effects early.</p>\n<p>Remember that your runway includes funding but <a card=\"g48845643ff_0_239\">also things like political capital</a>.</p>",
			"slugs": "patient-as-runway-allows",
			"links": [
				"g487aed6370_0_20",
				"g487aed6370_0_236",
				"g48a31f22cb_0_50",
				"g48845643ff_0_239"
			],
			"inbound_links": [
				"g48a31f22cb_0_50",
				"g48845643ff_0_239",
				"g4a41d8c468_1_47"
			]
		},
		"g487aed6370_0_231": {
			"index": 50,
			"id": "g487aed6370_0_231",
			"title": "Small decisions can compound even with no discontinuities",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In practice there are lots of <strong>zig or zag decisions day to day where either option seems fine</strong>. If you just picked the default, you’d have a random walk. But if you have a clear <a card=\"g487aed6370_0_81\">north star</a>, then you can consistently pick the “right” one, bending you closer and closer to the north-star. </p>\n<p>These decisions compound, meaning that over sufficiently long time horizons you can end up in a very different and much more favorable region, without ever having had a critical <a card=\"g487aed6370_0_241\">discontinuity</a>.</p>\n<p>One downside is that people not watching closely will erroneously believe that that outcome was inevitable or happened on its own, since <a card=\"g487aed6370_0_321\">continuous processes are hard to spot</a>. One trick to mitigate that is <a href=\"https://twitter.com/mekkaokereke/status/1027552576454021120\">difficulty anchoring</a>.</p>",
			"slugs": "small-decisions-compound",
			"links": [
				"g487aed6370_0_81",
				"g487aed6370_0_241",
				"g487aed6370_0_321"
			],
			"inbound_links": [
				"g48845643ff_0_276"
			]
		},
		"g487aed6370_0_20": {
			"index": 51,
			"id": "g487aed6370_0_20",
			"title": "The compounding effect of infrastructure",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>One of the forgotten <a card=\"g487aed6370_0_15\">compounding effects</a>. Allows you to automate a thing you did previously at a high constant factor of energy… for free. Think of infra as expanding the option value of your capabilities and locking them in. Infrastructure for external developers can kick off an additional compounding effect by enabling the 3P developers to tackle new and larger problems, creating more demand.</p>\n<p>Infra automates things, freeing up energy for other things, but also brings new things into the <a card=\"g487aed6370_0_0\">adjacent possible</a> that it wouldn’t have made sense to focus on on their own. Similar dynamics to the value of capital investment in capital-intensive businesses. </p>\n<p>The infra has to be <em>useful</em>--actually helps with <a card=\"g487aed6370_0_0\">adjacent possible</a> things. Beware the <a card=\"g48845643ff_0_453\">myth of infrastructure</a>: infra must be demonstrably useful in short to medium term. Aim for 80% efficiency of infra for the current concrete need, with 20% being over built that is aligned with your <a card=\"g487aed6370_0_81\">north star</a>.</p>\n<p></p>",
			"slugs": "compounding-infrastructure",
			"links": [
				"g487aed6370_0_15",
				"g487aed6370_0_0",
				"g48845643ff_0_453",
				"g487aed6370_0_81"
			],
			"inbound_links": [
				"g487aed6370_0_256",
				"g48845643ff_0_234",
				"g48845643ff_0_453",
				"g48845643ff_1_10",
				"g4a6111ef7e_0_5",
				"g4a3ed6c576_8_0"
			]
		},
		"g48845643ff_0_453": {
			"index": 52,
			"id": "g48845643ff_0_453",
			"title": "The myth of infrastructure",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><em>Inspired by </em><em><a href=\"https://www.usv.com/blog/the-myth-of-the-infrastructure-phase\">The Myth of the Infrastructure Phase</a></em><em>. See also </em><em><a card=\"g48a31f22cb_0_50\">minimize time to initial value</a></em><em></em></p>\n<p><a card=\"g487aed6370_0_20\">Useful infrastructure has a compounding effect</a>, especially when it allows developers to tackle problems that were previously impossible, adding an additional compounding. When you’re trying to create a developer offering (internal or external) it can be tempting to believe “build it and they will come”. </p>\n<p>However, in complex spaces the detailed solution you build will almost always violate <a card=\"g487aed6370_0_161\">currently hidden constraints</a>. <strong>Infrastructure should only be built in response to </strong><strong><em>concrete</em></strong><strong> customer demand</strong>. Concrete means that there are a handful of specific customers who have proactively told you they want to use it. </p>\n<p>Then, <strong>invest energy to meet inbound energy</strong>. You might start with a small kernel of demand, but can quickly grow it via compounding effects into something much larger.</p>\n<p></p>",
			"slugs": "myth-of-infrastructure",
			"links": [
				"g48a31f22cb_0_50",
				"g487aed6370_0_20",
				"g487aed6370_0_161"
			],
			"inbound_links": [
				"g48a31f22cb_0_50",
				"g487aed6370_0_20"
			]
		},
		"g487aed6370_0_151": {
			"index": 53,
			"id": "g487aed6370_0_151",
			"title": "The power of asking “Why?”",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>If you’re in a problem space and can’t figure out where to start, the simplest question is to just ask “Why?”. It forces you to think about the <strong>end</strong> you’re trying to achieve, and to break into a broader, more abstract perspective that’s not as tied to the details of the situation today.</p>\n<p>The answers to these stack on top of one another and generally top out at something like “to ensure the thriving of humanity”. It often takes 5-6 repeated stackings of “Why?” to top out at this. </p>\n<p>If any of the “Why?”s in your stack don’t have a clear answer, that’s a good sign that you’ve gotten trapped into <a card=\"g487aed6370_0_156\">confusing means for ends</a>.</p>",
			"slugs": "power-of-why",
			"links": [
				"g487aed6370_0_156"
			],
			"inbound_links": [
				"g487aed6370_0_121",
				"g487aed6370_0_156",
				"g487aed6370_0_191",
				"g487aed6370_0_116",
				"g487aed6370_0_246",
				"g48845643ff_0_564"
			]
		},
		"g487aed6370_0_321": {
			"index": 54,
			"id": "g487aed6370_0_321",
			"title": "Continuous processes are hard to spot",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Continuous processes can lead to extremely strong <a card=\"g487aed6370_0_15\">compounding effects</a> that can overwhelm just about any other force in a system. </p>\n<p>But unlike <a card=\"g487aed6370_0_241\">discontinuities</a> which are discrete and obvious, continuous effects are smooth and incremental as the system morphs between adjacent equilibrium states.</p>\n<p>Human brains are percentage-of-change detectors, which means our brains are constantly re-calibrating. That means continuous processes don’t “look like much” in the day to day. It’s only over long time horizons that they become obvious.</p>\n<p>This is one of the reasons that a compounding ecosystem effect can often take competitors by surprise--it doesn’t look like much in absolute terms, until it’s too late to catch up.</p>",
			"slugs": "continuous-hard-to-spot",
			"links": [
				"g487aed6370_0_15",
				"g487aed6370_0_241"
			],
			"inbound_links": [
				"g487aed6370_0_231",
				"g487aed6370_0_331",
				"g48845643ff_0_276",
				"g48845643ff_0_167",
				"g48845643ff_0_209"
			]
		},
		"g487aed6370_0_241": {
			"index": 55,
			"id": "g487aed6370_0_241",
			"title": "Discontinuities are miracles",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Normal actions are moves to points in the <a card=\"g487aed6370_0_0\">adjacent possible</a>; they’re incremental. They go from one equilibrium state to another adjacent equilibrium point, often under the internal momentum of the system, or with carefully applied external <a card=\"g487aed6370_0_236\">nudges</a>.</p>\n<p>Discontinuities often require a <strong>strong external application of force at the same time</strong>. That force is often not sustainable, push the equilibrium beyond its breaking point, or don’t change the underlying dynamics of the system, leading it to <a card=\"g487aed6370_0_271\">bounce back when the force is removed</a>. It’s nearly impossible to predict how a system pushed past equilibrium will respond; often it simply breaks.</p>\n<p>The number of miracles your plan needs in order to work is a <a card=\"g487aed6370_0_161\">count of how many constraints your plan violates</a>. Plans that have even a single miracle are highly unlikely; plans that require multiple miracles are nearly impossible. <a card=\"g48845643ff_0_544\">Hope is not a strategy</a>.</p>\n<p></p>",
			"slugs": "discontinuities-are-miracles",
			"links": [
				"g487aed6370_0_0",
				"g487aed6370_0_236",
				"g487aed6370_0_271",
				"g487aed6370_0_161",
				"g48845643ff_0_544"
			],
			"inbound_links": [
				"g487aed6370_0_161",
				"g487aed6370_0_0",
				"g487aed6370_0_231",
				"g487aed6370_0_321",
				"g487aed6370_0_271",
				"g487aed6370_0_311",
				"g48845643ff_0_443",
				"g4a3ed6c576_4_0"
			]
		},
		"g487aed6370_0_296": {
			"index": 56,
			"id": "g487aed6370_0_296",
			"title": "Resist the urge to fight fires; focus on fire prevention",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In a complex space, “fires” (that is, short term emergencies) are a constant fact of life. There’s never a “good time” to focus on fire prevention (taking the long-term approach). Often it <em>feels </em>like after a particular fire is put out you’ll have time--but that’s not true. There will always be more fires to fight, constantly.</p>\n<p>But if you don’t focus on fire prevention--on setting up scalable approaches--then you’ll never unlock the compounding effects of sustainable teams, and you’ll always be fighting fires. Fire-fighting over fire prevention is a form of <a card=\"g48845643ff_0_215\">unsustainable heroism</a>.</p>\n<p>Put out the most urgent fires, but don’t feel the need to put <em>all </em>of them out--some are OK to let smolder so you can figure out a sustainable approach.  <a card=\"g48845643ff_0_469\">Actively </a><em><a card=\"g48845643ff_0_469\">make</a></em><a card=\"g48845643ff_0_469\"> time for the necessary long-term thinking</a>.</p>",
			"slugs": "resist-fire-fighting",
			"links": [
				"g48845643ff_0_215",
				"g48845643ff_0_469"
			]
		},
		"g487aed6370_0_5": {
			"index": 57,
			"id": "g487aed6370_0_5",
			"title": "Discovery vs Performance Phase",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Also known as divergent and convergent phases. The latter is also known as socializing.</p>\n<p>In a complex problem space, you need to dig into problems and look at them from many angles. As you have a nugget of an idea that develops, you need to share it with ever-widening groups of people to communicate your plan and, sometimes, get approval to pursue it.</p>\n<p>At all points you should be actively looking for disconfirming evidence of insights, and incorporate them continuously to improve your plan, although that willingness should decline as the project proceeds, since <a card=\"g48a31f22cb_0_15\">bad ideas look good from a distance</a>.</p>\n<p>In discovery phase, aim for <a card=\"g487aed6370_0_35\">collaborative debate</a>, keeping the set of people as small as you can while still having a spanning set of the relevant expertise. In the performance phase, <a card=\"g48a31f22cb_0_10\">minimize discontinuities</a> as you socialize more broadly.</p>\n<p></p>",
			"slugs": "discovery-vs-performance",
			"links": [
				"g48a31f22cb_0_15",
				"g487aed6370_0_35",
				"g48a31f22cb_0_10"
			],
			"inbound_links": [
				"g487aed6370_0_291",
				"g48a31f22cb_0_10",
				"g487aed6370_0_181",
				"g487aed6370_0_196"
			]
		},
		"g48a31f22cb_0_10": {
			"index": 58,
			"id": "g48a31f22cb_0_10",
			"title": "Minimize discontinuities in the performance phase",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In complex problem spaces, there’s a <a card=\"g487aed6370_0_5\">discovery phase and a performance phase</a>. Although you should always be in learning mode and willing to see your idea is actually bad, during the performance phase the emphasis should be on communicating why the idea is good.</p>\n<p>Each additional person who comes to the idea has some static probability of wrongly thinking a good idea is a bad one. If people see someone reactive negatively they are much more likely to react negatively too, creating a compounding effect. </p>\n<p>The more relatively powerful a person is, the bigger the setback for a negative reaction. Thus the risk of a socialization at a given event goes up <strong>exponentially with number of new people in the event, multiplied by the power differentials</strong>. Break your socialization into discrete, smaller socialization steps that minimize this risk. If you must have a discontinuity, work to derisk it.</p>",
			"slugs": "minimize-discontinuities-performance",
			"links": [
				"g487aed6370_0_5"
			],
			"inbound_links": [
				"g487aed6370_0_5",
				"g48a31f22cb_0_20",
				"g487aed6370_0_196",
				"g4a6111ef7e_0_20"
			]
		},
		"g48a31f22cb_0_20": {
			"index": 59,
			"id": "g48a31f22cb_0_20",
			"title": "If you must have a performance discontinuity, derisk it",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>To socialize ideas you want to <a card=\"g48a31f22cb_0_10\">break up the steps into smaller discrete steps to minimize the risk of a good idea derailing</a>.</p>\n<p>But sometimes you have no choice, for example for a review with many new people in it. In those cases, invest time in pre-work to minimize the risk.</p>\n<p>The ideal is to have a (high-level) idea of where most peopls’ heads are at make sure they have a high-level understanding of the idea so they <a card=\"g48a31f22cb_0_25\">aren’t surprised in the meeting</a>. This is especially true for people with high relative power.</p>\n<p><a card=\"g487aed6370_0_196\">1:1s are magic</a>, so they are the ideal way to do pre-work. Approach them as mini collaborative debates to uncover new insights and perspectives to include.</p>\n<p>Approach it as lining up rough consensus and then locking it in in the review.</p>",
			"slugs": "",
			"links": [
				"g48a31f22cb_0_10",
				"g48a31f22cb_0_25",
				"g487aed6370_0_196"
			],
			"inbound_links": [
				"g48a31f22cb_0_25"
			]
		},
		"g48845643ff_0_403": {
			"index": 60,
			"id": "g48845643ff_0_403",
			"title": "Intuition relies on a super-power of our brains",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Our brains are good at low-fidelity but highly-parallel <strong>pattern matching</strong>. It can do cheaply and even when we aren’t aware of it--although sometimes it has false positives.</p>\n<p>However, our intuition can fall prey to many well-documented biases. (e.g. simulating  thing and reading out our emotions; recency bias; halo effect; etc) This bias can be especially damaging to under-represented groups.</p>\n<p>Intuition can give us a “gut” that there’s some connection to make. But because of biases we need to <strong>trust but verify</strong>. You can do this by working to distill the intuition into specific <a card=\"g487aed6370_0_50\">insights</a>. If those are strong enough to re-derive the end analysis to others, that’s a good sign it wasn’t just a bias. </p>\n<p>Intuition is a skill that can be sharpened by exercise and giving it more patterns to match against. <a card=\"g48a31f22cb_0_30\">The best leads have highly sharpened intuition</a>.</p>",
			"slugs": "intuition-superpower",
			"links": [
				"g487aed6370_0_50",
				"g48a31f22cb_0_30"
			],
			"inbound_links": [
				"g48a31f22cb_0_72",
				"g48a31f22cb_0_61",
				"g48a31f22cb_0_30"
			]
		},
		"g48845643ff_1_10": {
			"index": 61,
			"id": "g48845643ff_1_10",
			"title": "Factor out complicated pieces of your problem space",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The challenge and overhead of complexity goes up with the square of the “size” of the complex region.</p>\n<p>Often in an overwhelmingly complex problem space you’ll come across aspects of the problem that are well contained and isolated, and almost certainly need to be fixed.</p>\n<p>These sub-pieces are often merely complicated, and by factoring them out you can reduce the overall scope of the complexity of the rest of the space. If you do this often enough you can have a non-linear reduction in challenge in your space.</p>\n<p><a card=\"g487aed6370_0_286\">Beware, however, the natural tendency to factor out too much</a>, because complex problem spaces often have i<a card=\"g4a9e93532f_0_10\">rreducible complexity at their core</a>. Identifying <a card=\"g487aed6370_0_20\">useful infrastructure</a>--things that will have value in almost any possible future--is one way of chipping off sub-problems effectively.</p>",
			"slugs": "factor-out-complicated-pieces",
			"links": [
				"g487aed6370_0_286",
				"g4a9e93532f_0_10",
				"g487aed6370_0_20"
			],
			"inbound_links": [
				"g487aed6370_0_286",
				"g4a9e93532f_0_10"
			]
		},
		"g487aed6370_0_236": {
			"index": 62,
			"id": "g487aed6370_0_236",
			"title": "Apply energy as nudging forces, not motive forces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Making things happen encounters tons of friction, requiring <a card=\"g4871092f30_0_1541\">constant input of energy</a>. <strong>Motive force </strong>is using your energy to push through that molasses.</p>\n<p><strong>Guiding force</strong>, on the other hand, applies that energy to affect the <em>direction</em><strong><em> </em></strong>of an <a card=\"g48a31f22cb_0_45\">agent</a> that has their own intrinsic motive force and momentum. They are often called <strong>nudges</strong>.</p>\n<p>Whereas motive force must be continuously applied, guiding force needs to only be applied as needed, and has scale of impact proportional not to the nudge, but to the underlying momentum of the agent. </p>\n<p><strong>The secret to scaling is applying as much of your energy as nudges</strong>. You’ll <a card=\"g48845643ff_0_222\">trade off precision for much higher overall impact</a>.</p>\n<p>There are often many possible nudges; choose which to apply <a card=\"g48845643ff_0_227\">strategically.</a></p>",
			"slugs": "nudges",
			"links": [
				"g4871092f30_0_1541",
				"g48a31f22cb_0_45",
				"g48845643ff_0_222",
				"g48845643ff_0_227"
			],
			"inbound_links": [
				"g487aed6370_0_261",
				"g48845643ff_0_234",
				"g487aed6370_0_241",
				"g48845643ff_0_227",
				"g48845643ff_0_244",
				"g48845643ff_0_222"
			]
		},
		"g48845643ff_0_227": {
			"index": 63,
			"id": "g48845643ff_0_227",
			"title": "Apply nudges where things aren’t converging",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_236\">Nudges are the best way to scale</a>, but there are nearly infinite nudges you could do.</p>\n<p>Nudges get more expensive the <strong>farther from your cone of influence they are</strong>, and the <strong>less they align with the existing momentum</strong> of the system you’re nudging. Also be careful that nudges from farther afield are more likely to be <a card=\"g48845643ff_0_244\">strongly resisted</a>.</p>\n<p>The main question is <strong>“if this system continues on its current trajectory, will it converge to a good-enough solution in a reasonable time-frame with acceptable efficiency?”</strong></p>\n<p>Apply nudges where things aren’t converging and the bang-for-buck per unit energy is high.</p>",
			"slugs": "when-to-nudge",
			"links": [
				"g487aed6370_0_236",
				"g48845643ff_0_244"
			],
			"inbound_links": [
				"g487aed6370_0_236"
			]
		},
		"g487aed6370_0_271": {
			"index": 64,
			"id": "g487aed6370_0_271",
			"title": "Systems in equilibrium are meta-stable",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>When a system is in equilibrium, its internal loops are in balance, and the internal logic of the system can continue under its own momentum and internal intrisic energy. The systems in equilibrium occur naturally often, but <a card=\"g48845643ff_0_155\">can’t be created in a lab</a>.</p>\n<p>When an external force acts on the system, it may shift, but will <strong>tend to revert back to equilibrium when the force is removed</strong>, unless the external force breaks the loops of the system, creating a <a card=\"g487aed6370_0_241\">discontinuity</a>, which will then have an unpredictable effect.</p>\n<p>With continued thoughtful nudges, you can evolve an equilibrium continuously.</p>\n<p>Because <a card=\"g487aed6370_0_276\">culture can be thought of a systems problem</a>, cultures can be extremely difficult to change, and it’s often easier to go along with what that culture is good at and avoid problems it’s bad at--an example of <a card=\"g487aed6370_0_261\">keeping the wind at your back</a>.</p>\n<p></p>",
			"slugs": "equilibriums-are-metastable",
			"links": [
				"g48845643ff_0_155",
				"g487aed6370_0_241",
				"g487aed6370_0_276",
				"g487aed6370_0_261"
			],
			"inbound_links": [
				"g487aed6370_0_241"
			]
		},
		"g487aed6370_0_311": {
			"index": 65,
			"id": "g487aed6370_0_311",
			"title": "Miracles in retrospect incorrectly look intentional",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_241\">Discontinuities</a> happen all of the time, but their outcome is nearly impossible to predict.</p>\n<p>There is an extremely strong <a href=\"https://en.wikipedia.org/wiki/Survivorship_bias\">survivorship bias</a>; an organization that got lucky and randomly benefited from a discontinuity, will, knowing they succeeded, be able to retroactively rationalize (or “<a href=\"https://en.wikipedia.org/wiki/Retroactive_continuity\">retcon</a>”) the insights that led them to make it through that filter event. The illusion is caused by the same dynamic that underlies the <a href=\"https://en.wikipedia.org/wiki/Monty_Hall_problem\">Monty Hall problem</a>.</p>\n<p>This retcon will often come to be taken as an immovable founding myth that will become actively dangerous in new situations, and in general makes the organization have an <strong>unwarrantedly high estimation of its ability to tackle new and different problems</strong>. This is one of the reasons Silicon Valley has toxic <a card=\"g48845643ff_0_413\">hero worship</a>.</p>\n<p></p>",
			"slugs": "miracles-survivorship-bias",
			"links": [
				"g487aed6370_0_241",
				"g48845643ff_0_413"
			]
		},
		"g487aed6370_0_331": {
			"index": 66,
			"id": "g487aed6370_0_331",
			"title": "Slippery slope processes require creating a discontinuity",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>If there are compounding or continuous processes that will lead to a gradual decline to a thing that, from a distance, is obviously a bad outcome, you need a special approach.</p>\n<p>Because <a card=\"g487aed6370_0_321\">continuous processes are hard to spot</a>, there will be no discontinuity that obviously calls for a breaking point (e.g. a massive protest in a democracy). This is one of the mechanisms that helps lead to the rise of dictatorships.</p>\n<p>The trick is to <em>create </em>an artificial breaking point well ahead of time. Identify the conditions that are obviously egregious if they were to happen in the long-term, and describe the action that you will take. </p>\n<p>Make that plan widely known, and revisit it often as the process continues, treating it as an immovable object and imbuing it with leverage. <a href=\"https://en.wikipedia.org/wiki/Doomsday_Clock\">The Doomsday Clock</a> is an example of this approach in practice. Set <a card=\"g48845643ff_0_514\">kill and success criteria early</a> is an application of this.</p>\n<p></p>",
			"slugs": "slippery-slope-discontinuity",
			"links": [
				"g487aed6370_0_321",
				"g48845643ff_0_514"
			]
		},
		"g4871092f30_0_1571": {
			"index": 67,
			"id": "g4871092f30_0_1571",
			"title": "Power differentials exist everywhere",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Power differentials are often called “leverage,” and they exist in almost every human interaction. In formalized organizational structure, they manifest as management structure and the level of individuals. <a card=\"g487aed6370_0_186\">Privilege</a> is also a form of power differential.</p>\n<p>Humans have a deep, intuitive sense for when they are at the weak end of a power differential and will tend to respond with <a card=\"g487aed6370_0_171\">emotional intensity</a> because <a card=\"g487aed6370_0_181\">the stakes are high</a>.</p>\n<p>Power structures exist even if they are not formalized. Formalizing power structures, to the extent they match to the actual operative power structures, is an example of reducing complexity to mere complication <a card=\"g487aed6370_0_306\">via structure</a>.</p>",
			"slugs": "power-differentials-are-everywhere",
			"links": [
				"g487aed6370_0_186",
				"g487aed6370_0_171",
				"g487aed6370_0_181",
				"g487aed6370_0_306"
			],
			"inbound_links": [
				"g487aed6370_0_171",
				"g487aed6370_0_166",
				"g487aed6370_0_176",
				"g487aed6370_0_186",
				"g487aed6370_0_131",
				"g487aed6370_0_136",
				"g487aed6370_0_301",
				"g487aed6370_0_96"
			]
		},
		"g487aed6370_0_171": {
			"index": 68,
			"id": "g487aed6370_0_171",
			"title": "Emotional intensity overrides intellectual intensity",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>There are two types of intensity: <strong>intellectual</strong> intensity (the “good” kind, that’s necessary for rigorous <a card=\"g487aed6370_0_35\">collaborative debate</a>), and <strong>emotional</strong> intensity (the “bad” kind, at least in a work environment).</p>\n<p>Humans are not robots. <strong>Emotions are a fact of life</strong>, and evolutionary biology tells us that they a key <em>feature</em> is that they are intense and overwhelming. <strong></strong></p>\n<p>Humans have a tendency to interpret <em>any </em>intensity as emotional intensity, especially if there’s a <a card=\"g4871092f30_0_1571\">power differential</a> in place. And once any participant has diagnosed it as emotional intensity, it <em>is </em>emotional intensity. That intensity will compound, activating emotional intensity for <em>all</em> participants. <strong>Emotional intensity is viral</strong>.</p>\n<p><strong>Emotionally intense discussions cannot be intellectually productive. </strong>That’s why you must <a card=\"g487aed6370_0_166\">carefully create the conditions for collaborative debate</a>.</p>\n<p></p>",
			"slugs": "emotional-vs-intellectual-intensity",
			"links": [
				"g487aed6370_0_35",
				"g4871092f30_0_1571",
				"g487aed6370_0_166"
			],
			"inbound_links": [
				"g487aed6370_0_35",
				"g4871092f30_0_1571",
				"g487aed6370_0_166",
				"g487aed6370_0_176",
				"g487aed6370_0_181",
				"g487aed6370_0_196"
			]
		},
		"g487aed6370_0_101": {
			"index": 69,
			"id": "g487aed6370_0_101",
			"title": "Politics is human emotion at scale",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>“Politics” has a negative connotation, and it’s tempting to think “we’re a healthy team, we don’t have politics here.” </p>\n<p>But there’s a difference between <strong>active </strong>politics and <strong>passive </strong>politics. Active politics is manipulative and intentional. Passive politics is merely emotion at scale, and requires no malice or bad intent on behalf of anyone to manifest.</p>\n<p>Passive politics exists everywhere that humans work together as a powerful and omnipresent force. Ignoring it is dangerous; it would be like ignoring gravity when designing a rocket. There’s a difference between <a card=\"g48845643ff_0_291\">navigating politics and playing politics</a>.</p>\n<p>This is the primary reason a<a card=\"g487aed6370_0_96\">ll problems that involve humans--even incidentally--are complex</a>.</p>",
			"slugs": "politics-is-emotion-at-scale",
			"links": [
				"g48845643ff_0_291",
				"g487aed6370_0_96"
			],
			"inbound_links": [
				"g487aed6370_0_91",
				"g487aed6370_0_96",
				"g48845643ff_0_255"
			]
		},
		"g487aed6370_0_91": {
			"index": 70,
			"id": "g487aed6370_0_91",
			"title": "Have a moral compass in complex spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Because <a card=\"g487aed6370_0_66\">complex spaces are fundamentally gray</a>, and <a card=\"g487aed6370_0_101\">politics is a fact of life</a>, it’s dangerously easy to slide down a slippery slope of moral relativism where any means can be justified.</p>\n<p>That is extremely dangerous, and when allowed to infect a team culture, can create an unrecoverable toxic spiral.</p>\n<p>It is important to follow the moral north star to <strong>always do the right thing, from the broadest possible perspective</strong>.</p>\n<p>Be aware of your own bias towards outcomes that are favorable to you and your team; actively force yourself to consider problems from a <a card=\"g4871092f30_0_1561\">positive-sum mindset</a>, as close to the <a href=\"https://en.wikipedia.org/wiki/Veil_of_ignorance\">veil of ignorance ideal</a> as possible.</p>",
			"slugs": "moral-compass",
			"links": [
				"g487aed6370_0_66",
				"g487aed6370_0_101",
				"g4871092f30_0_1561"
			]
		},
		"g487aed6370_0_166": {
			"index": 71,
			"id": "g487aed6370_0_166",
			"title": "The conditions for collaborative debate must be created",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Collaborative debate requires intellectual intensity and rigor, but by default <a card=\"g487aed6370_0_171\">intensity explodes into emotional intensity</a>. That means the<strong> conditions have to be actively created</strong>.</p>\n<p>First and foremost, the space must be <strong>psychologically safe</strong> for all participants. That is a fundamental requirement. This requires active work to intentionally set, model, and reward the right culture within a team. This work must be constantly ongoing.</p>\n<p>Then you must be intentional about <strong>minimizing emotional escalators</strong>--even the subtle ones--including <a card=\"g487aed6370_0_176\">us-vs-them thinking</a>, <a card=\"g487aed6370_0_181\">high stakes</a>, and unnecessary <a card=\"g4871092f30_0_1571\">power differentials</a>, including those caused by <a card=\"g487aed6370_0_186\">privilege</a>.</p>",
			"slugs": "conditions-for-collaborative-debate",
			"links": [
				"g487aed6370_0_171",
				"g487aed6370_0_176",
				"g487aed6370_0_181",
				"g4871092f30_0_1571",
				"g487aed6370_0_186"
			],
			"inbound_links": [
				"g487aed6370_0_35",
				"g487aed6370_0_171"
			]
		},
		"g487aed6370_0_176": {
			"index": 72,
			"id": "g487aed6370_0_176",
			"title": "The nasty trap of Us-vs-Them",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Humans are innately wired to split groups into two sides: one that contains “us”, and the other that contains “them”. The <a href=\"https://en.wikipedia.org/wiki/Fundamental_attribution_error\">fundamental attribution error</a> means that we give ourselves a pass, meaning that we always see the “us” group as superior.</p>\n<p>Because <a card=\"g4871092f30_0_1571\">power differentials exist everywhere</a>, creating the <a card=\"g487aed6370_0_171\">conditions for emotional intensity which has a compounding effect</a>, this us-vs-them distinction can escalate to extreme lengths--in the most heinous cases to literal genocides.</p>\n<p>This can happen over even completely arbitrary and random properties, like splitting a group into a <a href=\"https://www.age-of-the-sage.org/psychology/social/sherif_robbers_cave_experiment.html\">red team and blue team</a>, and workplace situations are rife with differences (product area, which office you work in, your team’s cultural style, functional ladder).</p>\n<p>The <a card=\"g487aed6370_0_191\">dynamic is sometimes harnessed to do useful work, but should never be because it is fundamentally toxic</a>. Watch out for the <a card=\"g487aed6370_0_201\">risk factor</a>s that predict it.</p>",
			"slugs": "us-vs-them",
			"links": [
				"g4871092f30_0_1571",
				"g487aed6370_0_171",
				"g487aed6370_0_191",
				"g487aed6370_0_201"
			],
			"inbound_links": [
				"g487aed6370_0_166",
				"g487aed6370_0_201",
				"g487aed6370_0_207",
				"g487aed6370_0_212",
				"g48845643ff_0_255"
			]
		},
		"g487aed6370_0_191": {
			"index": 73,
			"id": "g487aed6370_0_191",
			"title": "The us-vs-them dynamic is fundamentally toxic",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The <a card=\"g487aed6370_0_191\">us-vs-them</a> dynamic is very real and can escalate quickly.</p>\n<p>The dynamic is obviously toxic <strong>between </strong>groups, but unfortunately it can be an extremely powerful motivator <strong>within </strong>groups. That means that it is often tempting to harness this motivator within a team--or fall into a trap of relying on it inadvertently.</p>\n<p>But the <strong>dynamic is fundamentally toxic</strong>. It can escalate to dangerous levels, and even if the “other” team is far away organizationally, the effect can get strong enough to be toxic even at the company-wide or even society-wide level.</p>\n<p>It also often obscures the <a card=\"g487aed6370_0_151\">why</a> by framing your goals in opposition to another group and contaminates the <a card=\"g487aed6370_0_81\">long-term goals and priorities</a> for a team, which can lead the team to tackle the wrong problems. </p>",
			"slugs": "us-vs-them-is-toxic",
			"links": [
				"g487aed6370_0_191",
				"g487aed6370_0_151",
				"g487aed6370_0_81"
			],
			"inbound_links": [
				"g487aed6370_0_176",
				"g487aed6370_0_191",
				"g4a9e93532f_0_0"
			]
		},
		"g487aed6370_0_201": {
			"index": 74,
			"id": "g487aed6370_0_201",
			"title": "Us-vs-them risk factors",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The <a card=\"g487aed6370_0_176\">us-vs-them</a> factor can apply anywhere, but certain risk factors make it more likely. If these apply, the best bet is to do <a card=\"g487aed6370_0_207\">preventative maintenance</a>.</p>\n<p><strong>Substantially different cultures on the different sub-teams</strong> Different groups will fail to recognize the value of the other team, while feeling undervalued themselves.</p>\n<p><strong>Time-horizon mismatch.</strong> One group will want to invest time on deep discussions, and another group will find every moment not spent on execution makes the fires worse.</p>\n<p><strong>Split Benefit/Cost</strong> When one sub-team accrues most of the benefit, but another sub-team pays most the cost, friction is likely, especially if the costs or benefit are hard to quantity.</p>\n<p></p>",
			"slugs": "us-vs-them-risk-factors",
			"links": [
				"g487aed6370_0_176",
				"g487aed6370_0_207"
			],
			"inbound_links": [
				"g487aed6370_0_176",
				"g487aed6370_0_207",
				"g487aed6370_0_212",
				"g4a3ed6c576_0_54"
			]
		},
		"g487aed6370_0_207": {
			"index": 75,
			"id": "g487aed6370_0_207",
			"title": "Preventative maintenance for team culture",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>When<a card=\"g487aed6370_0_176\"> us-vs-them</a> triggers, it can compound so quickly that it’s hard to stop. The best approach is to invest in preventative maintenance when the <a card=\"g487aed6370_0_201\">risk factors are present</a>. You don’t know precisely <em>what </em>will trigger the toxic spiral, you know that it’s more likely in these cases. Preventative maintenance gives resilience to whether those bumps. </p>\n<p>The best preventative maintenance is <strong>low-stakes face-to-face interactions</strong>. When people see the other people as fellow humans who are trying to do the right thing, it helps inoculate the most toxic parts of the “them” reaction.</p>\n<p><strong>Shared team identity </strong>(making the entirety of the group one big “us”) can also be worth it, but can be extremely expensive, so only do it <a card=\"g487aed6370_0_212\">when it will be worth it</a>. Also be careful that you don’t create a <em>different </em>“them” that the whole group is in opposition to.</p>",
			"slugs": "team-culture-preventative-maintenance",
			"links": [
				"g487aed6370_0_176",
				"g487aed6370_0_201",
				"g487aed6370_0_212"
			],
			"inbound_links": [
				"g487aed6370_0_201",
				"g487aed6370_0_212",
				"g48845643ff_0_388"
			]
		},
		"g487aed6370_0_212": {
			"index": 76,
			"id": "g487aed6370_0_212",
			"title": "When is preventative maintenance worth it?",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_207\">Preventative maintenance of team culture</a> is the best way to deal with <a card=\"g487aed6370_0_176\">us-vs-them</a>, but it’s expensive.</p>\n<p>It’s <em>always</em> worth it for the core group of people who will work together often. For other cases, invest according to <strong>how closely the group will have to work together, multiplied by the </strong><strong><a card=\"g487aed6370_0_201\">risk factors</a></strong><a card=\"g487aed6370_0_201\">.</a></p>\n<p>The energy to build team cohesion goes up exponentially with how many people are in it, and gets significantly more expensive the farther afield the various groups are (in org structure, cultural values, physical location).</p>",
			"slugs": "team-culture-preventative-maintenance-worth-it",
			"links": [
				"g487aed6370_0_207",
				"g487aed6370_0_176",
				"g487aed6370_0_201"
			],
			"inbound_links": [
				"g487aed6370_0_207"
			]
		},
		"g487aed6370_0_181": {
			"index": 77,
			"id": "g487aed6370_0_181",
			"title": "Stakes are often inadvertently high",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>High stakes are one of the things that cause <a card=\"g487aed6370_0_171\">emotional intensity</a>. The stakes are often inadvertently high, or high only for certain participants. Because these dynamics are subtle and inconvenient, groups tend to ignore them, deliberately or accidentally.</p>\n<p>Some of the things that cause high stakes:</p>\n<ul>\n\t<li><strong><span class='small'>Decisions</span></strong><span class='small'> If a decision is being made that has effects on some people in the discussion, the stakes are high, and that is not a good forum for </span><span class='small'><a card=\"g487aed6370_0_35\">collaborative debate</a></span><span class='small'>.</span></li>\n\t<li><strong><span class='small'>Seniority </span></strong><span class='small'>No one wants to look dumb in front of people who are more senior, so the stakes are often automatically high when there’s a senior person in the room. Often, the only way for true collaborative debate to occur is for senior participants to deliberately not attend the </span><span class='small'><a card=\"g487aed6370_0_5\">discovery portion, but be present only for the performance portion</a></span><span class='small'>.</span></li>\n\t<li><strong><span class='small'>Large Audiences </span></strong><span class='small'>The more people present, the more people to witness any potential embarrassment, making things higher stakes. Remember that this is true for written communication as well, for any e-mails that are to a large list, or that may be inadvertently forwarded to one later.</span></li>\n</ul>",
			"slugs": "inadvertently-high-stakes",
			"links": [
				"g487aed6370_0_171",
				"g487aed6370_0_35",
				"g487aed6370_0_5"
			],
			"inbound_links": [
				"g4871092f30_0_1571",
				"g487aed6370_0_166",
				"g487aed6370_0_196",
				"g48a31f22cb_0_25"
			]
		},
		"g487aed6370_0_186": {
			"index": 78,
			"id": "g487aed6370_0_186",
			"title": "Privilege as a power differential",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g4871092f30_0_1571\">Power differentials</a> are omnipresent. Privilege is a key type of power differential that is particularly insidious because it is often invisible to those who wield it.</p>\n<p>Privilege is contextual, it is any aspect of a person that has led them to have the <strong>wind at their back</strong> in some way. Because those who have it in a given context have never <em>not</em> had it, it intuitively but incorrectly feels like the default that <em>everyone</em> experiences.</p>\n<p>If you have privilege it is on <em>you</em> to educate yourself, by watching videos and reading books by people who do not have that privilege. Even once you have educated yourself, it is extremely easy to forget, because being aware of your privilege takes <strong>active mental effort</strong>. Be on the lookout for signs your privilege is manifesting in a given situation. </p>\n<p><em>See also the </em><em><a href=\"http://www.guidetoallyship.com/\">boots vs sandals</a></em><em> metaphor on guidetoallyshiip.com to understand privilege</em>.</p>",
			"slugs": "privilege-as-power-differential",
			"links": [
				"g4871092f30_0_1571"
			],
			"inbound_links": [
				"g4871092f30_0_1571",
				"g487aed6370_0_166"
			]
		},
		"g487aed6370_0_131": {
			"index": 79,
			"id": "g487aed6370_0_131",
			"title": "Leadership means a strong but flexible opinion",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>In a complex space, it’s tempting to have no opinion because <a card=\"g487aed6370_0_66\">everything is gray</a>, but actually those are the spaces where rigorous debate is the <em>most </em>necessary. Because people by default won’t take strong positions in these spaces, it’s often up to the leader to do it, to give something for others to react to and build off of.</p>\n<p>This is sometimes articulated as “strong opinions, weakly held”.  You should debate rigorously but respectfully, and <a card=\"g487aed6370_0_141\">always be curious</a>, and <a card=\"g4871092f30_0_1571\">aware of your power differential</a>. <strong>Nearly everyone aspires to this standard, but nearly no one achieves it </strong>in practice.</p>\n<p>In practice it’s extremely hard to hold yourself to this standard if you have formal power in the team, because of <a card=\"g487aed6370_0_136\">a toxic but extremely common spiral</a>. As a lead you must take <strong>active, intentional, </strong>and <strong>constant </strong>steps to ensure that you are not creating an echo chamber around your ideas.</p>\n<p></p>",
			"slugs": "strong-opinions-weakly-held",
			"links": [
				"g487aed6370_0_66",
				"g487aed6370_0_141",
				"g4871092f30_0_1571",
				"g487aed6370_0_136"
			],
			"inbound_links": [
				"g48845643ff_1_50"
			]
		},
		"g487aed6370_0_136": {
			"index": 80,
			"id": "g487aed6370_0_136",
			"title": "Squelching dissent is a toxic spiral",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g4871092f30_0_1571\">Power differentials exist everywhere</a>, meaning even small gestures in a <a card=\"g487aed6370_0_35\">collaborative debate</a> environment can start to compound as people see that engaging in debate with a leader is punished--even if that punishment is extremely subtle and unintentional.</p>\n<p>As people dissent less, leaders get less and less feedback that their ideas aren’t correct, making then even more confident that they’re right, in a version of <a card=\"g48845643ff_0_408\">compounding confirmation bias</a>.</p>\n<p>This can accelerate, especially for people in formal positions of power until the core team is comprised entirely of yes-people, and recovery is nearly impossible.</p>\n<p>This exact same mechanism (just with a higher-stakes power differential) is at the core of why dictatorships fundamentally don’t work.</p>",
			"slugs": "squelching-dissent",
			"links": [
				"g4871092f30_0_1571",
				"g487aed6370_0_35",
				"g48845643ff_0_408"
			],
			"inbound_links": [
				"g487aed6370_0_131"
			]
		},
		"g487aed6370_0_301": {
			"index": 81,
			"id": "g487aed6370_0_301",
			"title": "Over-extending informal leverage points breaks them",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>All interactions of humans (and human-created systems) are defined by <a card=\"g4871092f30_0_1571\">power differentials</a> and leverage points.</p>\n<p>Some leverage points are formally expressed in structures like laws or formal reporting structures. But many leverage points are informal or situational, sometimes referred to “informal authority” or “<a card=\"g48845643ff_0_311\">credibility</a>.”</p>\n<p>If you try to apply too much informal-authority-derived leverage at a point, it sometimes will not work--and the fact that everyone sees that you didn’t have that leverage erodes the leverage it was based on; if it succeeds, it can create more leverage.</p>\n<p>The space of the <a card=\"g487aed6370_0_0\">adjacent possible</a> is thus defined, at least partially, by how much leverage of different types can be successfully applied without breaking. See also <a card=\"g48845643ff_0_306\">earning credibility means putting some on the line</a>.</p>",
			"slugs": "informal-authority-overextension",
			"links": [
				"g4871092f30_0_1571",
				"g48845643ff_0_311",
				"g487aed6370_0_0",
				"g48845643ff_0_306"
			],
			"inbound_links": [
				"g48845643ff_0_244",
				"g4a9e93532f_0_35",
				"g48845643ff_0_296",
				"g48845643ff_0_306"
			]
		},
		"g487aed6370_0_116": {
			"index": 82,
			"id": "g487aed6370_0_116",
			"title": "Use a diversity of lenses",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>It’s important to <a card=\"g487aed6370_0_111\">use different lenses</a>. Here’s a quick overview of some.</p>\n<ul>\n\t<li><a card=\"g4a3ed6c576_0_34\">Critical User Journeys</a></li>\n\t<li><a card=\"g48a31f22cb_0_66\">Historical Parallel</a></li>\n\t<li><a card=\"g48a31f22cb_0_61\">Metaphor</a></li>\n\t<li><a card=\"g4a3ed6c576_0_54\">Varying Time-Scales</a></li>\n\t<li><a card=\"g487aed6370_0_10\">Systems Theory</a></li>\n\t<li><a card=\"g4a3ed6c576_0_14\">Game Theory</a></li>\n\t<li><a card=\"g4a3ed6c576_0_19\">Simulations</a></li>\n\t<li><a card=\"g487aed6370_0_151\">Asking Why</a></li>\n</ul>",
			"slugs": "lens-list",
			"links": [
				"g487aed6370_0_111",
				"g4a3ed6c576_0_34",
				"g48a31f22cb_0_66",
				"g48a31f22cb_0_61",
				"g4a3ed6c576_0_54",
				"g487aed6370_0_10",
				"g4a3ed6c576_0_14",
				"g4a3ed6c576_0_19",
				"g487aed6370_0_151"
			],
			"inbound_links": [
				"g487aed6370_0_111",
				"g487aed6370_0_141",
				"g487aed6370_0_76",
				"g4a3ed6c576_0_34",
				"g48a31f22cb_0_61",
				"g4a3ed6c576_0_54",
				"g4a3ed6c576_0_14",
				"g4a3ed6c576_0_19"
			]
		},
		"g4a3ed6c576_0_34": {
			"index": 83,
			"id": "g4a3ed6c576_0_34",
			"title": "Critical User Journeys as a lens",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Critical User Journeys (CUJ) are one <a card=\"g487aed6370_0_116\">lens</a> to understand a complex space. It focuses on a deep analysis of the task the user is trying to accomplish and how they tackle it.</p>\n<p>Building a solution to a critical user journey often has the <a card=\"g487aed6370_0_261\">wind at your back</a> because you’re solving a known user need. Note however that users often only can ask for incremental improvements that are very close to their current behaviors, ignoring slightly bigger steps within the <a card=\"g487aed6370_0_0\">adjacent possible</a> that might be possible because of new technologies or investments. If you don’t have a <a card=\"g487aed6370_0_81\">north-star</a> you’re building towards it’s just a random walk buffeted by user whims. CUJ are thus a useful lens for the finding <a card=\"g48a31f22cb_0_50\">short-term improvements to make</a>, but not good for strategic goals.</p>\n<p>Beware that by going too deep on use cases <a card=\"g4a3ed6c576_0_39\">you might not build the right connective tissue</a>, leading your solution to be worth less than the sum of its parts.</p>",
			"slugs": "cuj-lens",
			"links": [
				"g487aed6370_0_116",
				"g487aed6370_0_261",
				"g487aed6370_0_0",
				"g487aed6370_0_81",
				"g48a31f22cb_0_50",
				"g4a3ed6c576_0_39"
			],
			"inbound_links": [
				"g487aed6370_0_116"
			]
		},
		"g48a31f22cb_0_72": {
			"index": 84,
			"id": "g48a31f22cb_0_72",
			"title": "Parallels help uncover hidden constraints",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Reduce an idea to its essence to make it easier to <a card=\"g48845643ff_0_403\">pattern match</a>.</p>\n<p>Find possible examples and think critically about whether they actually match the fundamental dynamics of this situation or not.</p>\n<p>If they do, look for adjacent parallels--perhaps a constraint is obvious in the parallel, but was not yet obvious in your own situation. </p>\n<p>Having a parallel also helps you consider multiple solutions at once, sometimes allowing you to factor out a shared, higher-level insight underlying them both.</p>\n<p><a card=\"g48a31f22cb_0_66\">Historical parallels</a> and <a card=\"g48a31f22cb_0_61\">metaphor</a> are two sub-classes of parallels.</p>",
			"slugs": "parallels-constraints",
			"links": [
				"g48845643ff_0_403",
				"g48a31f22cb_0_66",
				"g48a31f22cb_0_61"
			],
			"inbound_links": [
				"g48a31f22cb_0_66",
				"g48a31f22cb_0_61"
			]
		},
		"g48a31f22cb_0_66": {
			"index": 85,
			"id": "g48a31f22cb_0_66",
			"title": "Historical Parallels as a lens",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Historical parallels are previous experiences that have some fundamental parallel to the situation at hand. They can be used to help make predictions, or to find hidden constraints in your own problem space that are more clear in the historical example.</p>\n<p>These can be well-known historic events (accounts of famous battles are overly-prevalent examples), but they can also be drawing on your own personal experiences or experiences you heard about from someone else. This is one of the reasons <a card=\"g48a31f22cb_0_35\">mentoring is a win-win-win</a>.</p>\n<p>Historical parallels are a particular type of <a card=\"g48a31f22cb_0_72\">parallel</a>.</p>",
			"slugs": "historical-parallel-lens",
			"links": [
				"g48a31f22cb_0_35",
				"g48a31f22cb_0_72"
			],
			"inbound_links": [
				"g487aed6370_0_116",
				"g48a31f22cb_0_72",
				"g48a31f22cb_0_61"
			]
		},
		"g48a31f22cb_0_61": {
			"index": 86,
			"id": "g48a31f22cb_0_61",
			"title": "Metaphor as a lens",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Metaphor is one of the most undervalued <a card=\"g487aed6370_0_116\">lenses</a>. It’s often seen as frivolous, fanciful, and overly abstract.</p>\n<p>But well-constructed metaphors are extremely powerful. The human brain thinks in terms of concrete stories and situations, and metaphors that capture the interesting underlying dynamics of a problem can nicely distill them to something that is more intuitive to grasp.</p>\n<p>Plus, sometimes inconvenient facts are easier to confront when they’re abstracted.</p>\n<p>Metaphors are a good way of extracting out the underlying pattern, which can then be <a card=\"g48845643ff_0_403\">matched more quickly to other situations</a>. Metaphors are a type of <a card=\"g48a31f22cb_0_72\">parallel</a>. They’re powerful for similar reasons as <a card=\"g48a31f22cb_0_66\">historical parallels</a>, but can be deployed even when there isn’t an obvious historical parallel.</p>",
			"slugs": "metaphor-lens",
			"links": [
				"g487aed6370_0_116",
				"g48845643ff_0_403",
				"g48a31f22cb_0_72",
				"g48a31f22cb_0_66"
			],
			"inbound_links": [
				"g487aed6370_0_116",
				"g48a31f22cb_0_72"
			]
		},
		"g4a3ed6c576_0_54": {
			"index": 87,
			"id": "g4a3ed6c576_0_54",
			"title": "Varying time-scales as a lens",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Considering varying time-scales is one <a card=\"g487aed6370_0_116\">lens</a> that can be applied to complexity.</p>\n<p>In a complex problem space it’s important to keep an eye on <a card=\"g48845643ff_0_95\">the short- and long-term simultaneously</a>. Focusing just on the short-term leads to a random walk, whereas focusing ovelry on the long-term leads to exploring solutions with no plausible path from here to there.</p>\n<p>Often if the way forward isn’t clear in one time-scale, looking at a different time-scale can help clarify. For example, asking “where do we expect to be in 3 years” can often help elucidate where it makes sense to build infrastructure.</p>\n<p>Note also that <a card=\"g487aed6370_0_201\">one predictor of friction between teams</a> is when there’s a time-scale mismatch: one team is trying to fight fires, and another is trying to plan a utopia.</p>",
			"slugs": "time-scales-lens",
			"links": [
				"g487aed6370_0_116",
				"g48845643ff_0_95",
				"g487aed6370_0_201"
			],
			"inbound_links": [
				"g487aed6370_0_116"
			]
		},
		"g4a3ed6c576_0_14": {
			"index": 88,
			"id": "g4a3ed6c576_0_14",
			"title": "Game Theory as a lens",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Game theory is a powerful <a card=\"g487aed6370_0_116\">lens</a>. Although game theory has a <a href=\"https://en.wikipedia.org/wiki/Game_theory\">formal, rigorous mathematical definition</a>, in practice ‘game theory’ means <strong>analyzing the interdependent incentives of </strong><strong><a card=\"g48a31f22cb_0_45\">agents</a></strong><strong> in a system</strong>.</p>\n<p>Incentives are one of the primary forces within an ecosystem, so mapping them out. Be careful to analyze what a self-interested agent would <em>actually </em>be incentivized to do, not what you <em>want </em>them to be incentivized to do. If a strategy requires agents to go against their incentives then it won’t work because it violates a constraint.</p>\n<p>Incentives are interdependent. When incentives align correctly, they can compound, creating <a card=\"g48845643ff_0_204\">gravity wells</a>. Ecosystem strategy is often about <a card=\"g48845643ff_0_95\">aligning short- and long-term incentives of agents</a>. Sometimes individual incentives align to a global outcome no one prefers, as in the <a href=\"https://en.wikipedia.org/wiki/Prisoner%27s_dilemma\">prisoner’s dilemma</a> and <a href=\"https://en.wikipedia.org/wiki/Collective_action_problem\">the collective action problem</a>.</p>",
			"slugs": "game-theory-lens",
			"links": [
				"g487aed6370_0_116",
				"g48a31f22cb_0_45",
				"g48845643ff_0_204",
				"g48845643ff_0_95"
			],
			"inbound_links": [
				"g487aed6370_0_116",
				"g48845643ff_0_204"
			]
		},
		"g487aed6370_0_10": {
			"index": 89,
			"id": "g487aed6370_0_10",
			"title": "Systems Theory is a powerful lens in complex spaces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Systems theory is a tool that charts out feedback loops between various entities in a system. It can be used to model everything from a thermostat up to massive human-scale systems.</p>\n<p>By far the best primer is <a href=\"https://www.amazon.com/Thinking-Systems-Donella-H-Meadows/dp/1603580557\">Thinking in Systems by Donella H. Meadows</a>. It’s roughly a three hour read, full of concrete examples to illustrate high-level insights.</p>\n<p>Although systems theory is typically applied to mapping out a web of fundamentally straight-forward processes, it can also be successfully applied to human incentives and how those change over time.</p>\n<p>No <a card=\"g487aed6370_0_111\">lens is all-powerful</a>, but systems theory is often one of the best to understand highly complex problems.</p>",
			"slugs": "systems-theory-lens",
			"links": [
				"g487aed6370_0_111"
			],
			"inbound_links": [
				"g487aed6370_0_40",
				"g487aed6370_0_30",
				"g487aed6370_0_116",
				"g48845643ff_0_173",
				"g487aed6370_0_15"
			]
		},
		"g4a3ed6c576_0_19": {
			"index": 90,
			"id": "g4a3ed6c576_0_19",
			"title": "Simulations as a lens",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Simulation is one type of <a card=\"g487aed6370_0_116\">lens</a> for complex problem spaces. <a card=\"g4a3ed6c576_0_24\">Complex systems cannot be fully understood by human minds</a>. </p>\n<p>But setting up simulations and seeing how the evolve can help elucidate the underlying dynamics in the system and test them to see how they will handle new conditions. This approach is known as <a href=\"https://en.wikipedia.org/wiki/Agent-based_model\">agent-based modeling</a>.</p>\n<p>Design a model in any programming environment you’re familiar with, aiming to keep it simple. Test it on simple situations and see if the results match real-world outcomes. If they do, you can have confidence you have a good understanding of the inner workings.</p>\n<p>You can then try giving more exaggerated inputs to see how they respond. Beware, however, that with extreme-enough inputs the dynamics of a system can change, so predictions are valid only when they the conditions are similar to real-world ones.</p>\n<p></p>",
			"slugs": "simulation-lens",
			"links": [
				"g487aed6370_0_116",
				"g4a3ed6c576_0_24"
			],
			"inbound_links": [
				"g487aed6370_0_116",
				"g4a3ed6c576_0_24",
				"g48845643ff_0_173"
			]
		},
		"g4a3ed6c576_0_29": {
			"index": 91,
			"id": "g4a3ed6c576_0_29",
			"title": "Complex systems have emergent behavior",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Most complex systems exhibit some kind of emergent behavior, where the behavior of the system is great than the sum of its individual parts, because the various parts interact in ways that can have non-linear relationship.</p>\n<p>This means that you cannot remove any part of the system and still have it exhibit the same behavior. This is one of the reasons why it’s <a card=\"g487aed6370_0_286\">tempting but dangerous to reduce out too much detail when trying to understand complex systems</a>.</p>\n<p><a card=\"g4a3ed6c576_0_29\">Human minds cannot understand emergent systems</a>.</p>",
			"slugs": "emergent-behavior",
			"links": [
				"g487aed6370_0_286",
				"g4a3ed6c576_0_29"
			],
			"inbound_links": [
				"g487aed6370_0_286",
				"g4a3ed6c576_0_29",
				"g4a3ed6c576_0_24"
			]
		},
		"g4a3ed6c576_0_24": {
			"index": 92,
			"id": "g4a3ed6c576_0_24",
			"title": "Emergent systems cannot be understand by human minds",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Emergent systems have highly inter-depedent pieces with large amounts of irreducible complexity, that exhibit <a card=\"g4a3ed6c576_0_29\">nonlinear behaviors</a>.</p>\n<p>Human minds only have limited amount of space for rational analysis. The result is that we can analyze emergent systems only at the micro-level (the low-level rule sets that lead to the overall emergent behavior), or at the micro-level (the high-level properties that the system <em>tends</em> to have under certain conditions). But keeping in mind both the macro- and micro-level at once is impossible for humans.</p>\n<p>Economies, democracy, ecosystems, and deep-learned ML models all have this property.</p>\n<p>The best tool to understand them is often <a card=\"g4a3ed6c576_0_19\">simulation</a>--deferring to the computer to understand the details, and allowing quick experimentation and tinkering.</p>",
			"slugs": "emergent-systems-cant-be-understood",
			"links": [
				"g4a3ed6c576_0_29",
				"g4a3ed6c576_0_19"
			],
			"inbound_links": [
				"g4a3ed6c576_0_19"
			]
		},
		"g48845643ff_1_50": {
			"index": 93,
			"id": "g48845643ff_1_50",
			"title": "Compromise is often a cop out",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Just because <a card=\"g487aed6370_0_251\">everything’s in balance</a> and the best way to understand complex spaces is <a card=\"g487aed6370_0_35\">collaborative debate</a> does not mean that designing things by committee is good.</p>\n<p>Design by committee often implies repeatedly making <strong>compromises</strong> that no one entity is particularly happy with. In some cases, like where the decision will determine which of the participants reaps the benefits, compromise is necessary (unless you can <a card=\"g48845643ff_0_494\">find a positive-sum judge</a>).</p>\n<p>But other types of compromise are actively bad, because they imply to some extent that the problem space isn’t understood well enough to come to a conclusion that everyone can affirmatively agree is good.</p>\n<p><a card=\"g487aed6370_0_131\">Leadership is strong opinions, weakly held</a>.</p>\n<p></p>",
			"slugs": "compromise-cop-out",
			"links": [
				"g487aed6370_0_251",
				"g487aed6370_0_35",
				"g48845643ff_0_494",
				"g487aed6370_0_131"
			],
			"inbound_links": [
				"g487aed6370_0_251"
			]
		},
		"g48845643ff_0_509": {
			"index": 94,
			"id": "g48845643ff_0_509",
			"title": "If people don’t want to engage in discovery, ask questions",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Some people just want to have averserial discussion and are not in <a card=\"g487aed6370_0_141\">learning mode</a>.</p>\n<p>You can <strong>ask questions </strong>instead to get them to self-reflect and perhaps get to a point where they’re more open to new ideas or understand the complexity in the space:</p>\n<ul>\n\t<li>What is the end that this helps us accomplish?</li>\n\t<li>What would change your mind?</li>\n\t<li>What are the principles underlying that decision?</li>\n\t<li>What might the second-order effect of this decision be?</li>\n\t<li>Why do you feel strongly about this? What are you most worried about? What fear or anxiety does this decision help alleviate for you?</li>\n\t<li>Why hasn't someone else done this already?</li>\n\t<li>What are some ways this idea could fail?</li>\n</ul>",
			"slugs": "ask-questions",
			"links": [
				"g487aed6370_0_141"
			]
		},
		"g48845643ff_0_173": {
			"index": 95,
			"id": "g48845643ff_0_173",
			"title": "The tell of a compounding loop is an accelerating curve",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>If you see any success metric <strong>whose second-order derivative is positive</strong>, you’ve caught some kind of feedback loop.</p>\n<p>Now you can carefully study to understand how it works. <a card=\"g487aed6370_0_10\">Systems theory</a> and <a card=\"g4a3ed6c576_0_19\">simulation</a> are two powerful lenses for understanding the core dynamics of a loop.</p>\n<p>Once you understand how it works (the <a card=\"g48845643ff_0_191\">enablers</a>), you can figure out the <a card=\"g4a41d8c468_1_0\">accelerants</a> that can evolve it to go even faster.</p>",
			"slugs": "tell-of-compounding-loop",
			"links": [
				"g487aed6370_0_10",
				"g4a3ed6c576_0_19",
				"g48845643ff_0_191",
				"g4a41d8c468_1_0"
			],
			"inbound_links": [
				"g48845643ff_0_167"
			]
		},
		"g48845643ff_0_191": {
			"index": 96,
			"id": "g48845643ff_0_191",
			"title": "Ecosystems have enablers and accelerants",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The fundamental enabler of an ecosystem is a compounding loop.</p>\n<p>Once you find a successful compounding effect, there are a number of ways to make it run hotter via accelerants.</p>\n<p>But no matter how many accelerants you have, if you don’t have a core enabler then you have nothing.</p>\n<p>The hard part is finding a loop that fundamentally works.</p>\n<p>There are a number of different <a card=\"g4a41d8c468_1_0\">accelerants</a> you can use.</p>\n<p></p>\n<p></p>",
			"slugs": "enablers-vs-accelerants",
			"links": [
				"g4a41d8c468_1_0"
			],
			"inbound_links": [
				"g48845643ff_0_173",
				"g4a41d8c468_1_0",
				"g4a6111ef7e_0_25"
			]
		},
		"g4a41d8c468_1_0": {
			"index": 97,
			"id": "g4a41d8c468_1_0",
			"title": "Accelerants make systems run hotter",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Thriving systems have <a card=\"g48845643ff_0_191\">enablers</a> that make the loop fundamentally work, but accelerants can help make that loop run hotter. In general, accelerants <strong>reduce the lag in the main feedback loop, </strong>making the cause and effect more direct. A few examples:</p>\n<ul>\n\t<li><strong>Marketing</strong>, to reach customers who would value the service but don’t yet know about it</li>\n\t<li><strong>In product promotions</strong> - Make adjacent use cases have more of an affordance to use the feature more directly</li>\n\t<li><strong>Social</strong> - If you can get a social loop going on top of a compounding loop, it can spread more virally</li>\n\t<li><strong>Delight</strong> - Unexpected value, including of a kind the user didn’t know they wanted (e.g. cute mascots) , encourages them to keep searching for more.</li>\n</ul>",
			"slugs": "ecosystem-accelerants",
			"links": [
				"g48845643ff_0_191"
			],
			"inbound_links": [
				"g48845643ff_0_173",
				"g48845643ff_0_191"
			]
		},
		"g487aed6370_0_96": {
			"index": 98,
			"id": "g487aed6370_0_96",
			"title": "Human problems are all complex",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_40\">All problems are complex</a>, but that is even more true for problems involving humans because human interactions are nuanced, highly motivated, and highly inter-related.</p>\n<p>Even if the underlying problem is merely complicated, if there’s a problem to get a large group of informally-organized humans to pull in the right direction, it’s a complex problem overall.</p>\n<p>This is because <a card=\"g4871092f30_0_1571\">power differentials exist everywhere</a>, humans all have emotions, and <a card=\"g487aed6370_0_101\">politics is emotion at scale</a>. This is especially true in <a card=\"g48a31f22cb_0_55\">bottoms-up cultures</a>, where the power structures are often <a card=\"g48845643ff_0_311\">informal</a>, or in any condition where the formal power structures do not match the underlying power dynamics well.</p>",
			"slugs": "human-problems-are-complex",
			"links": [
				"g487aed6370_0_40",
				"g4871092f30_0_1571",
				"g487aed6370_0_101",
				"g48a31f22cb_0_55",
				"g48845643ff_0_311"
			],
			"inbound_links": [
				"g487aed6370_0_40",
				"g487aed6370_0_101"
			]
		},
		"g48845643ff_0_276": {
			"index": 99,
			"id": "g48845643ff_0_276",
			"title": "Well-applied nudges are indistinguishable from luck",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>Because they are <a card=\"g487aed6370_0_321\">continuous processes (which are hard to notice)</a>, and because they can be very subtle, merely picking to <a card=\"g487aed6370_0_231\">zig instead of zag</a>.</p>\n<p>As a positive, this means that systems often <a card=\"g48845643ff_0_276\">won’t resist them</a> because they don’t feel like undue influence.</p>\n<p>As a negative, it means that even if you pull off a long-term miracle by careful nudging, leadership might think “that was always going to happen”. One trick to mitigate that is <a href=\"https://twitter.com/mekkaokereke/status/1027552576454021120\">difficulty anchoring</a>.</p>",
			"slugs": "nudges-look-like-luck",
			"links": [
				"g487aed6370_0_321",
				"g487aed6370_0_231",
				"g48845643ff_0_276"
			],
			"inbound_links": [
				"g48845643ff_0_276"
			]
		},
		"g487aed6370_0_196": {
			"index": 100,
			"id": "g487aed6370_0_196",
			"title": "1:1s are magic",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>When socializing an idea, you want to <a card=\"g48a31f22cb_0_10\">minimize discontinuities and risk</a>.</p>\n<p><a card=\"g487aed6370_0_181\">Stakes go up exponentially with the number of participants</a>, so 1:1s are the lowest stakes by far. This creates the ideal conditions for a frank, <a card=\"g487aed6370_0_35\">collaborative debate</a>. 1:1s should always be in “<a card=\"g487aed6370_0_5\">discovery</a>” mode--be on the lookout for new insights and constraints that you didn’t already know about.</p>\n<p>If things have gotten <a card=\"g487aed6370_0_171\">emotionally intense</a> in the team, talking with various people 1:1 will often uncover what’s actually going on and how best you can help the right thing happen.</p>\n<p>At the beginning of the 1:1, take steps to create a frank environment by sharing your own perspective, even if it’s embarrassing, or calling out the elephant in the room for the broader team, showing you see inconvenient or awkward problems clearly.</p>",
			"slugs": "one-on-one-magic",
			"links": [
				"g48a31f22cb_0_10",
				"g487aed6370_0_181",
				"g487aed6370_0_35",
				"g487aed6370_0_5",
				"g487aed6370_0_171"
			],
			"inbound_links": [
				"g48a31f22cb_0_20"
			]
		},
		"g48a31f22cb_0_45": {
			"index": 101,
			"id": "g48a31f22cb_0_45",
			"title": "Agents are human-scale systems with intrinsic motivation",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>An <strong>agent</strong> is the way to describe an <strong>intrinsically motivated</strong> sub-system that is powered, ultimately, by humans. Intrinsically motivated means that without any external forces they will still move under their own power. Agents in practice often can mean <strong>individuals</strong>, <strong>teams</strong>, or <strong>ecosystems.</strong></p>\n<p>Different types of agents will have different amounts of intrinsic motivation and energy. The amount of energy is tied to how strong the incentive is, and how easy it is to align the internal forces to pull to the same outcome. For example, a small team of developers has high monetary motivation, and by being small is easy to get to pull in the same direction.</p>\n<p>Many of the same analysis for human-systems system theory <a card=\"g48845643ff_0_126\">applies for any human-scale system</a> with its own intrinsic motivation.</p>\n<p><strong></strong></p>\n<p></p>",
			"slugs": "agents-are-systems-with-motivation",
			"links": [
				"g48845643ff_0_126"
			],
			"inbound_links": [
				"g487aed6370_0_236",
				"g4a3ed6c576_0_14",
				"g48845643ff_0_260",
				"g4a3ed6c576_0_44",
				"g4a41d8c468_1_47"
			]
		},
		"g48845643ff_0_443": {
			"index": 102,
			"id": "g48845643ff_0_443",
			"title": "Motivated agents can search the adjacent possible for you",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>The <a card=\"g487aed6370_0_0\">adjacent possible</a> is a search space to find the good ideas that are possible to reach without <a card=\"g487aed6370_0_241\">discontinuities</a>. Often you have to search the space yourself, which is expensive, and can be thought of as a form of <a card=\"g48845643ff_0_215\">unsustainable heroics</a>.</p>\n<p>But if there are <a card=\"g48845643ff_0_443\">motivated agents</a> whose energy you can harness (e.g. developers, highly motivated users) you can allow them to search the space and find the good ideas for you.</p>\n<p>A lot of consumer product approaches presume that people won’t do things unless you push them to. If they’re intrinsically motivated a lot of other approaches open up.</p>\n<p>Note that this will happen any time there are motivated actors. If their incentives aren’t fully aligned with yours (and they never are perfectly), the <a card=\"g48845643ff_0_250\">result can be problematic</a>.</p>",
			"slugs": "motivated-agents-search-adjacent-possible",
			"links": [
				"g487aed6370_0_0",
				"g487aed6370_0_241",
				"g48845643ff_0_215",
				"g48845643ff_0_443",
				"g48845643ff_0_250"
			],
			"inbound_links": [
				"g48845643ff_0_443",
				"g48845643ff_0_250",
				"g48845643ff_0_132"
			]
		},
		"g48a31f22cb_0_25": {
			"index": 103,
			"id": "g48a31f22cb_0_25",
			"title": "Everyone will react negatively when surprised in high stakes",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>No one likes being surprised by information in a <a card=\"g487aed6370_0_181\">high-stakes environment</a>, especially if it not aligned with their previous knowledge or stated preferences.</p>\n<p>Being put on the spot in a big review unexpectedly, or being the last to learn about a thing that you should have already known about, will make almost everyone react negatively. Worse, one negative reaction can <a card=\"g48a31f22cb_0_20\">kick off negative reactions in others in a compounding cascade</a>.</p>\n<p>If at all possible, people should not be surprised by information in reviews. This is one of the reasons <a card=\"g48a31f22cb_0_20\">1:1s are great ways to derisk reviews</a>.</p>",
			"slugs": "high-stakes-are-emotionally-intense",
			"links": [
				"g487aed6370_0_181",
				"g48a31f22cb_0_20"
			],
			"inbound_links": [
				"g48a31f22cb_0_20"
			]
		},
		"g48845643ff_0_255": {
			"index": 104,
			"id": "g48845643ff_0_255",
			"title": "Fundamental gravitational forces",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p>There are some forces that are constants in human-scale systems, and you should assume they’re operative in your space. <a card=\"g48845643ff_0_270\">Ignoring them is a mistake</a>.</p>\n<ul>\n\t<li><a card=\"g48845643ff_0_250\">Goodhart’s law</a></li>\n\t<li><a card=\"g487aed6370_0_101\">Politics is emotion at scale</a></li>\n\t<li><a card=\"g487aed6370_0_176\">Us-vs-them</a></li>\n\t<li><a card=\"g48845643ff_0_255\">Progress requires a constant influx of energy</a></li>\n\t<li><a card=\"g48845643ff_0_265\">Abstract ideas are harder to communicate at scale</a></li>\n\t<li><a card=\"g48845643ff_0_215\">Heroics are unsustainable and will fail at some point</a></li>\n</ul>",
			"slugs": "gravitational-forces",
			"links": [
				"g48845643ff_0_270",
				"g48845643ff_0_250",
				"g487aed6370_0_101",
				"g487aed6370_0_176",
				"g48845643ff_0_255",
				"g48845643ff_0_265",
				"g48845643ff_0_215"
			],
			"inbound_links": [
				"g487aed6370_0_286",
				"g48845643ff_0_255",
				"g48845643ff_0_250",
				"g48845643ff_0_270"
			]
		},
		"g48845643ff_0_250": {
			"index": 105,
			"id": "g48845643ff_0_250",
			"title": "Goodhart’s Law",
			"sectionname": "Half-Baked",
			"updated": false,
			"body": "<p><a href=\"https://en.wikipedia.org/wiki/Goodhart%27s_law\">Goodhart’s law</a> is one of the <a card=\"g48845643ff_0_255\">fundamental gravitational forces</a>. It states that “<strong>When a measure becomes a target, it ceases to be a good measure</strong>”.</p>\n<p>The core insight is that every conceivable metric has only some correlation with the deeper thing you care about. Humans are clever and will <a card=\"g48845643ff_0_443\">seek ideas in the adjacent possible that you didn’t intend</a>, especially if incentivized. Over time, as they find more clever loopholes, the correlation of the metric with what you care about will decline.</p>\n<p>Target metrics are a way of structuring a problem to reduce it to mere complication, <a card=\"g487aed6370_0_121\">but no structure should ever replace thinking</a>. The fix for Goodhart’s law is to always keep in mind the higher-level <a card=\"g487aed6370_0_156\">end</a> you’re trying to achieve, and critically analyze whether the current outcomes are aligned with it. A simple but imperfect mitigation is a <a href=\"https://medium.com/@gokulrajaram/the-second-most-important-metric-for-every-company-df958ff8c5ec\">check metric</a>, which helps defend against the most obvious loopholes.</p>",
			"slugs": "goodharts-law",
			"links": [
				"g48845643ff_0_255",
				"g48845643ff_0_443",
				"g487aed6370_0_121",
				"g487aed6370_0_156"
			],
			"inbound_links": [
				"g48845643ff_0_443",
				"g48845643ff_0_255"
			]
		},
		"g4871092f30_0_1581": {
			"index": 107,
			"id": "g4871092f30_0_1581",
			"title": "Rate of Surprise tells you how complex the problem space is",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>How often you or the team are getting surprised by new information or insights is the best predictor of how complex the problem space still is</p>\n<p>As clarity is brought to a problem space and complexity is reduced to mere complication, the rate of surprise lowers</p>",
			"slugs": "rate-of-surprise",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_141",
				"g4871092f30_0_1531"
			]
		},
		"g48a31f22cb_0_15": {
			"index": 108,
			"id": "g48a31f22cb_0_15",
			"title": "Bad ideas look good from a distance",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The world is full of constraints </p>\n<p>Even the least-bad ideas look bad from close up, which leads to a bias towards discarding an idea too easily.</p>\n<p>Simulated annealing</p>\n<p>Details kill most ideas, by either finding a fundamental constraint that is violated, or by just looking messy or arbitrary</p>\n<p></p>",
			"slugs": "ideas-look-bad-from-distance",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_5"
			]
		},
		"g48845643ff_0_270": {
			"index": 109,
			"id": "g48845643ff_0_270",
			"title": "Ignoring hidden forces is a recipe for disaster",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>It’s tempting to pretend that the <a card=\"g48845643ff_0_255\">hidden forces</a> don’t exist or can be ignored.</p>\n<p>But, like, gravity, they’re powerful and omnipresent. Once you understand them and work <em>with </em>them instead of pretending they don’t exist, you can harness them to do useful things, like slingshoting a rocket to the moon.</p>",
			"slugs": "ignoring-hidden-forces-disaster",
			"links": [
				"g48845643ff_0_255"
			],
			"inbound_links": [
				"g487aed6370_0_286",
				"g48845643ff_0_255"
			]
		},
		"g48845643ff_0_155": {
			"index": 110,
			"id": "g48845643ff_0_155",
			"title": "It’s not possible to create a thriving engine in a lab",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Thriving engines are systems that are in equilibrium with a source of sustainable intrinsic energy combined with calibrated feedback loops, in careful balance.</p>\n<p>Most possible configurations will fail to start or collapse on themselves. It’s basically impossible to create one in a lab, like finding a needle in a haystack.</p>\n<p>It’s much better to find one that already exists in the wild and then continuously evolve and grow it into something stronger. That is, <strong>systems in balance should be discovered, not created</strong>.</p>\n<p>Once you have one, it’s way easier to study it to figure out how it works than to have created it from thin air. See also the <a card=\"g48845643ff_0_111\">self-sustaining flame</a> metaphor.</p>",
			"slugs": "cant-create-engine-in-lab",
			"links": [
				"g48845643ff_0_111"
			],
			"inbound_links": [
				"g487aed6370_0_0",
				"g48a31f22cb_0_50",
				"g487aed6370_0_271",
				"g48845643ff_0_150"
			]
		},
		"g4871092f30_0_1541": {
			"index": 111,
			"id": "g4871092f30_0_1541",
			"title": "Friction takes energy to overcome",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Leads to more burden (more energy has to be put in to overcome it)</p>\n<p>Friction in terms of how far outside of <a card=\"g487aed6370_0_0\">adjacent possible</a> it is (which can include marketing, distribution cost, and cost of getting users to develop new usage pattern). Friction in terms of mismatch of structure to the underlying complexity.</p>\n<p>More friction increases the static a priori possibility that an explosion happens, which can then spiral out of control</p>\n<p>Nearly every problem space has abundant (and often non-obvious) friction. See also <a card=\"g48845643ff_0_260\">progress takes a constant influx of energy</a>.</p>",
			"slugs": "friction-takes-energy-to-overcome",
			"links": [
				"g487aed6370_0_0",
				"g48845643ff_0_260"
			],
			"inbound_links": [
				"g487aed6370_0_236",
				"g48845643ff_0_260",
				"g4871092f30_0_1546"
			]
		},
		"g48845643ff_0_260": {
			"index": 112,
			"id": "g48845643ff_0_260",
			"title": "Progress requires a constant influx of energy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Making things <em>happen </em>requires pushing through <a card=\"g4871092f30_0_1541\">friction</a> of all types in the real world. It’s not an infinite frictionless plane, it’s a vast swamp of molasses.</p>\n<p>You can ideally harness intrinsic energy from another <a card=\"g48a31f22cb_0_45\">agent</a>, instead of heroics</p>",
			"slugs": "progress-takes-energy",
			"links": [
				"g4871092f30_0_1541",
				"g48a31f22cb_0_45"
			],
			"inbound_links": [
				"g4871092f30_0_1541"
			]
		},
		"g487aed6370_0_246": {
			"index": 113,
			"id": "g487aed6370_0_246",
			"title": "Strategy vs tactics is a matter of perspective",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Strategy is the long-term north-star, the why and how. Tactics is the short-term what. </p>\n<p>But in practice problem spaces nest, and what looks like strategy at one layer is tactics for the layer above.</p>\n<p>The way to move, intellectually, up the layer hierarchy is to <a card=\"g487aed6370_0_151\">ask why</a>.</p>",
			"slugs": "strategy-vs-tactics-perspective",
			"links": [
				"g487aed6370_0_151"
			]
		},
		"g4871092f30_0_1536": {
			"index": 114,
			"id": "g4871092f30_0_1536",
			"title": "Process amount should be proportional to complicatedness",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>In complex environments, process is bad because breaks flexibility as you learn</p>\n<p>If you get it wrong, it requires constant energy to overcome the mismatch, which can come to dominate.</p>\n<p>One way this manifests is trying to apply a rigid process to a bottoms-up culture.</p>",
			"slugs": "process-proportional-complicatedness",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_306"
			]
		},
		"g4871092f30_0_1551": {
			"index": 115,
			"id": "g4871092f30_0_1551",
			"title": "Decision Making is not a magic moment",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>It should be more rubber stamping than a discontinuity</p>\n<p>Leads should instead act as referees, ensuring all of the various insights and perspectives are considered appropriately, from a <a card=\"g4871092f30_0_1561\">positive-sum perspective</a></p>\n<p>Lead is a shepherd, not a driver</p>\n<p>People often rely on decision making as a<a card=\"g487aed6370_0_71\"> crutch for clarity</a> in complex environments, but that’s an illusion</p>\n<p>There’s no substitute for collaborative debate in a complex environment</p>",
			"slugs": "decision-making-not-magic",
			"links": [
				"g4871092f30_0_1561",
				"g487aed6370_0_71"
			]
		},
		"g487aed6370_0_276": {
			"index": 116,
			"id": "g487aed6370_0_276",
			"title": "Culture can be thought of as an ecosystem",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The systems theory lens can be applied to human-scale systems, especially to the extent the culture is bottoms-up.</p>\n<p>Cultures are the result of inter-related actions by each individual actor interacting with every other actor in the system.</p>\n<p>This leads to an exponentially compounding effect, where even when some subset of individuals try to act under different rules, ultimately the exponential effect dominates.</p>\n<p>This is often called “inter-subjective realities”. They’re fictions that are held in place by the distributed logic and incentives.  </p>",
			"slugs": "culture-as-ecosystem",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_271"
			]
		},
		"g48845643ff_0_66": {
			"index": 117,
			"id": "g48845643ff_0_66",
			"title": "Constraints come in different flavors",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Even complex problem spaces can be <a card=\"g48845643ff_0_60\">thought of as constraint satisfaction problems</a>.</p>\n<p><a card=\"g487aed6370_0_161\">Good solutions are ones that don’t violate any constraints</a> (even hidden or not-yet-discovered ones), and <a card=\"g487aed6370_0_261\">have the wind at your back</a>.</p>\n<p>There are a number of categories of constraints:</p>\n<ul>\n\t<li><a card=\"g48845643ff_0_72\">Straightforward</a></li>\n\t<li><a card=\"g48845643ff_0_78\">Hidden but concrete</a></li>\n\t<li><a card=\"g48845643ff_0_84\">Fundamentally fuzzy</a></li>\n</ul>",
			"slugs": "types-of-constraints",
			"links": [
				"g48845643ff_0_60",
				"g487aed6370_0_161",
				"g487aed6370_0_261",
				"g48845643ff_0_72",
				"g48845643ff_0_78",
				"g48845643ff_0_84"
			],
			"inbound_links": [
				"g487aed6370_0_161",
				"g48845643ff_0_60"
			]
		},
		"g487aed6370_0_15": {
			"index": 118,
			"id": "g487aed6370_0_15",
			"title": "The types of compounding effects",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>When using a <a card=\"g487aed6370_0_10\">systems theory lens</a>, there are a number of compounding effects:</p>\n<ul>\n\t<li>Network effects</li>\n\t<li>Two-sided market (Developers + Users)</li>\n\t<li>Infrastructure </li>\n\t<li>Certain game theory incentive structures</li>\n</ul>",
			"slugs": "compounding-effects-list",
			"links": [
				"g487aed6370_0_10"
			],
			"inbound_links": [
				"g487aed6370_0_20",
				"g487aed6370_0_321"
			]
		},
		"g48845643ff_0_244": {
			"index": 119,
			"id": "g48845643ff_0_244",
			"title": "Systems will resist obvious external forces",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Often if your <a card=\"g487aed6370_0_236\">nudge</a> is obvious, <a card=\"g487aed6370_0_301\">overplays its hand</a>, or is perceived as stop energy, the system will react by routing around you, perhaps even accelerating now that they have a shared enemy.</p>\n<p>  </p>",
			"slugs": "systems-resist-obvious-forces",
			"links": [
				"g487aed6370_0_236",
				"g487aed6370_0_301"
			],
			"inbound_links": [
				"g48845643ff_0_227",
				"g4a41d8c468_1_27"
			]
		},
		"g48845643ff_0_239": {
			"index": 120,
			"id": "g48845643ff_0_239",
			"title": "Runways are not just about funding",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>If you’re a start up, your <a card=\"g48845643ff_0_234\">runway</a> is literally how long your current funding </p>\n<p>But the notion of a runway also extends to things like your teams’ <a card=\"g48845643ff_0_311\">political capital</a> within a large organization. How much real-world value is your team adding, compared to your current carrying cost (head count)?</p>",
			"slugs": "runways-capital",
			"links": [
				"g48845643ff_0_234",
				"g48845643ff_0_311"
			],
			"inbound_links": [
				"g48845643ff_0_234"
			]
		},
		"g48845643ff_0_90": {
			"index": 121,
			"id": "g48845643ff_0_90",
			"title": "‘Always’ rules are better than ‘sometimes’ rules",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>A specific version of “discontinuities” and slippery slope</p>\n<p>In general, when you have a motivated actor who is incentivized to find and exploit wiggle room, a bright line that contains the desired behavior (even if it’s loose) is worse than one that is tigher but less clear boundaries</p>\n<p>Useful for self-control to force you to do what you want to want</p>\n<p><em>See also the original essay, </em><em><a href=\"https://medium.com/@komorama/for-self-control-always-rules-are-better-than-sometimes-rules-4c38be32f318\">For self control, ‘always’ rules are better than ‘sometimes’ rules</a></em><em></em></p>",
			"slugs": "always-rules-better-than-sometimes-rules",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_105",
				"g4a85094c68_0_50"
			]
		},
		"g48845643ff_0_105": {
			"index": 122,
			"id": "g48845643ff_0_105",
			"title": "Start with loose structure and tighten as you learn more",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p><a card=\"g4a3ed6c576_4_5\">Complex systems need more maneuvering room</a>.</p>\n<p>Don’t formalize things too early. When you do, deliberately leave a little more wiggle room than you think you need. As you operationalize a problem space you’ll learn how things actually play out in practice. You want to have the constraints capture the 95th percentile within the bounds, but be as tight as you can be other than that.</p>\n<p>Formalizing the <a card=\"g487aed6370_0_306\">wrong structure can be expensive</a>, and systems with too much structure can have high efficiency but <a card=\"g4a3ed6c576_4_0\">low resiliency</a>. </p>\n<p>A version of <a card=\"g48845643ff_0_90\">always rules are better than sometimes rules</a>.</p>",
			"slugs": "start-loose-structure-then-tighten",
			"links": [
				"g4a3ed6c576_4_5",
				"g487aed6370_0_306",
				"g4a3ed6c576_4_0",
				"g48845643ff_0_90"
			],
			"inbound_links": [
				"g4871092f30_0_1531"
			]
		},
		"g48845643ff_0_138": {
			"index": 123,
			"id": "g48845643ff_0_138",
			"title": "Focus on problems that give you energy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Individuals have <a card=\"g48845643ff_0_132\">intrinsic energy that can be harnessed</a>.</p>\n<p>Individuals’ intrinsic energy is the drive to succeed</p>\n<p>Finding your passion, your highest and best use</p>\n<p>Optimizing your amount of time in your flow state</p>\n<p>When in flow state, individuals <em>get </em>energy, not just spend it. This means harnessing it can be a powerful source of unlimited energy.</p>\n<p>Managers’ job is to maximize the amount of time their reports are in their flow state.</p>\n<p></p>",
			"slugs": "focus-where-give-energy,highest-and-best-use",
			"links": [
				"g48845643ff_0_132"
			],
			"inbound_links": [
				"g4a85094c68_0_45"
			]
		},
		"g48845643ff_0_144": {
			"index": 124,
			"id": "g48845643ff_0_144",
			"title": "Ecosystems’ intrinsic energy comes from incentives",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Ecosystems have i<a card=\"g48845643ff_0_132\">ntrinsic energy that can be harnessed</a>.</p>\n<p>Ecosystems intrinsic energy comes from the sum total of all incentives of actors within the system, as well as those incentive structures playing off one another.</p>\n<p>Even if the underlying incentives are partially in tension they can still do useful work in aggregate.</p>\n<p>Democracy and capitalism harness this energy, for example</p>",
			"slugs": "ecosystem-energy-incentives",
			"links": [
				"g48845643ff_0_132"
			]
		},
		"g48845643ff_0_150": {
			"index": 125,
			"id": "g48845643ff_0_150",
			"title": "Don’t try to create intrinsic energy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Intrinsic energy comes from carefully calibrated loops within the system, and are hard to predict.</p>\n<p>Trying to create new ones is akin to t<a card=\"g48845643ff_0_155\">rying to create a thriving engine in a alab</a>.</p>\n<p>Instead, try to focus on harnessing or encouraging existing intrinsic energy</p>",
			"slugs": "dont-create-intrinsic-energy",
			"links": [
				"g48845643ff_0_155"
			]
		},
		"g48845643ff_0_100": {
			"index": 126,
			"id": "g48845643ff_0_100",
			"title": "What humans want to want is different than what they want",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>For example, I want to read analysis and arguments from people I disagree with to enhance my own understanding of the world. But in practice I gravitate towards reading articles that already agree with my world view.</p>\n<p>As another example, you might want to eat healthily and exercise, but in practice gravitate towards eating multiple desserts at a party.</p>\n<p>See also the importance of <a card=\"g48845643ff_0_95\">aligning short- and long-term incentives</a> </p>\n<p>As well as in the <a card=\"g4871092f30_0_1526\">distance people see problems more abstractly</a>.</p>",
			"slugs": "instinctive-vs-aspirational-self",
			"links": [
				"g48845643ff_0_95",
				"g4871092f30_0_1526"
			]
		},
		"g48845643ff_0_111": {
			"index": 127,
			"id": "g48845643ff_0_111",
			"title": "The self-sustaining flame",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>A metaphor for capturing the key insight of ecosystems: finding the feedback loop</p>\n<p>Finding that feedback loop is the most important thing, but the actions we can take to kick-start an ecosystem (Business Development deals, marketing, etc) are external forces that obscure whether the internal forces have “caught”. </p>\n<p>The best bet is to find a working loop, however small, and then evolve and grow that continuously. </p>\n<p>See also respond to concrete demand and the <a card=\"g48845643ff_0_116\">myth of infrastructure</a>.</p>\n<p><em>See also the original essay: </em><em><a href=\"https://medium.com/@komorama/the-self-sustaining-flame-84326d2e1645\">The self-sustaining flame</a></em><em></em></p>",
			"slugs": "self-sustaining-flame",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_155"
			]
		},
		"g48845643ff_0_167": {
			"index": 128,
			"id": "g48845643ff_0_167",
			"title": "Feedback loops create compounding effects",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Feedback loops are the magic behind successful ecosystems. They take a source of sustainable intrinsic energy and multiply it at compounding rates to reach astronomical heights.</p>\n<p>You can tell you have one if <a card=\"g48845643ff_0_173\">you see an accelerating curve</a>.</p>\n<p>Because they are<a card=\"g487aed6370_0_321\"> continuous processes, they’re hard to spot</a>, and competitors often won’t spot them until it’s too late.</p>",
			"slugs": "feedback-loops-compounding-effects",
			"links": [
				"g48845643ff_0_173",
				"g487aed6370_0_321"
			]
		},
		"g48845643ff_0_332": {
			"index": 129,
			"id": "g48845643ff_0_332",
			"title": "Continuous processes avoid shocks, keeping the current loops",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The intrinsic logic of a system can be upended when there’s a sufficiently poweful external shock.</p>\n<p>But a continuous process tends to keep the same loops in place (although at different points different balancing loops might stop being dormant)</p>\n<p>As an example, because culture of a team is a system, slowing adding more people one at a time is a continuous process, meaning that the culture will stay the same. This can be either a bad or good thing. </p>",
			"slugs": "continuous-processes-continuous",
			"links": []
		},
		"g48a31f22cb_0_30": {
			"index": 130,
			"id": "g48a31f22cb_0_30",
			"title": "The best leads are strong fuzzy pattern matchers",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The best leads often rely heavily on <a card=\"g48845643ff_0_403\">intuition</a>, and then the ability to dig into an idea to verify it. They draw on a an array of knowledge to find fuzzy pattern matches that might help in this problem space.</p>\n<p>The fuzzier the pattern, the potentially less predictive it is, but the more situations it can be applied to.</p>\n<p>If, once you’ve discovered a possible pattern to match against, you can distill those insights and verify they work, that’s great. Intuition is primarily about finding potential matches quickly.</p>\n<p>The more experience you have and the more you’ve learned, the more patterns you have to match against, <a card=\"g48845643ff_0_185\">which is a strong compounding loop</a>. <a card=\"g48a31f22cb_0_35\">Mentoring</a> is not just a good thing to do, as a bonus it’s a great way to get more patterns to match.</p>\n<p></p>",
			"slugs": "leads-fuzzy-pattern-matching",
			"links": [
				"g48845643ff_0_403",
				"g48845643ff_0_185",
				"g48a31f22cb_0_35"
			],
			"inbound_links": [
				"g48845643ff_0_403",
				"g48a31f22cb_0_35"
			]
		},
		"g48a31f22cb_0_35": {
			"index": 131,
			"id": "g48a31f22cb_0_35",
			"title": "Mentoring is win-win-win",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>It’s a great way to have a strong positive impact on someone’s life.</p>\n<p>It’s a great way to force yourself to <a card=\"g48a31f22cb_0_40\">distill intuition to insights</a>. </p>\n<p>It’s a great way to get <a card=\"g48a31f22cb_0_30\">more patterns to match against</a>.</p>",
			"slugs": "mentoring-win-win-win",
			"links": [
				"g48a31f22cb_0_40",
				"g48a31f22cb_0_30"
			],
			"inbound_links": [
				"g48a31f22cb_0_66",
				"g48a31f22cb_0_30"
			]
		},
		"g48a31f22cb_0_40": {
			"index": 132,
			"id": "g48a31f22cb_0_40",
			"title": "Talking helps distill intuition to insight",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>You have a fuzzy idea in your head, but you need to reify it to ensure it works, and also to verify it makes sense.</p>\n<p>Talking is fundamentally about modeling the other person’s mind and figuring the right string of words to say to get them to have a similar thought as you. That requires massive distillation. Often his distillation compresses an intuition into an <a card=\"g487aed6370_0_50\">insight</a>, which can then be captured and shared.</p>\n<p>If you don’t have someone to talk to, try talking to yourself. Exploratory document writing and brainstorming can be a great way to “talk” to yourself.</p>",
			"slugs": "talking-distills-intuition-insight",
			"links": [
				"g487aed6370_0_50"
			],
			"inbound_links": [
				"g48a31f22cb_0_35"
			]
		},
		"g4a3ed6c576_0_39": {
			"index": 133,
			"id": "g4a3ed6c576_0_39",
			"title": "Going too deep can create non-compounding islands",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Neighboring use cases unlock value as people use the system in ways that cuts across them. This creates a strong compounding effect in platforms, especially since <a card=\"g4a3ed6c576_0_44\">developers tend to use platforms in ways you never expected</a>.</p>\n<p>If you go too deep and don’t make sure there’s connective tissue, you might end up creating islands who are only as useful as the sum of their parts instead of harnessing a compounding effect.</p>",
			"slugs": "too-deep-fragmentation",
			"links": [
				"g4a3ed6c576_0_44"
			],
			"inbound_links": [
				"g4a3ed6c576_0_34"
			]
		},
		"g4a3ed6c576_0_44": {
			"index": 134,
			"id": "g4a3ed6c576_0_44",
			"title": "Developers will use platforms in ways you didn’t anticipate",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Developers have their own <a card=\"g48a31f22cb_0_45\">intrinsic motivatio</a>n to use a platform, and they’ll seek out points in the <a card=\"g487aed6370_0_0\">adjacent possible</a> on the platform that work for them--even if you didn’t realize those points worked.</p>\n<p>The first time you hear of a high-profile use case on your platform that is a surprise to you is a mark of success for a new ecosystem. It shows that there’s organic energy and momentum.</p>",
			"slugs": "developers-use-unanticipated",
			"links": [
				"g48a31f22cb_0_45",
				"g487aed6370_0_0"
			],
			"inbound_links": [
				"g4a3ed6c576_0_39"
			]
		},
		"g48845643ff_0_337": {
			"index": 135,
			"id": "g48845643ff_0_337",
			"title": "Giving something a name makes it A Thing",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Everything is a big gray fog. What you choose to give a handle/name changes how it chunks in how people perceive of it, and talk about it with others. </p>\n<p>The name itself often doesn’t matter TOO much (except for mass consumer things), more about what you to decide to lump together into one name (or system of related names)</p>\n<p>How Brand-y the name is affects how people see it, and there are different levers</p>",
			"slugs": "names-make-a-thing",
			"links": []
		},
		"g48845643ff_0_388": {
			"index": 136,
			"id": "g48845643ff_0_388",
			"title": "Debt comes in many forms",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Familiar with technical debt, but also a useful concept elsewhere:</p>\n<ul>\n\t<li>Inclusion debt</li>\n\t<li>Product debt</li>\n\t<li>Org structure debt</li>\n\t<li><a card=\"g487aed6370_0_207\">Team culture debt</a></li>\n\t<li>Ecosystem debt (e.g. predictability)</li>\n</ul>\n<p>Preventative maintenance is paying down this debt ahead of time. This helps you have <strong>resiliency </strong>to the shocks that are inevitable but whose details are unknowable a priori.</p>",
			"slugs": "types-of-debt",
			"links": [
				"g487aed6370_0_207"
			]
		},
		"g48845643ff_0_423": {
			"index": 137,
			"id": "g48845643ff_0_423",
			"title": "Structurally create opportunities for dissent",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Even in a collaborative debate, people will shy away from dissent to maintain harmony.</p>\n<p>So structurally introduce it, by having a Red Team whose job is to (respectfully) seek to say why the idea won’t work. Or have as a gate that the group has to brainstorm five ideas why it won’t work.</p>\n<p>Surfacing those ideas helps bring the group together; allows people to get doubts on the table, and to have more confidence that other headwinds aren’t lurking</p>",
			"slugs": "create-opportunities-dissent",
			"links": []
		},
		"g48845643ff_0_428": {
			"index": 138,
			"id": "g48845643ff_0_428",
			"title": "Actions matter more than words",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Everyone wants teams that are creative, not afraid to fail, etc.</p>\n<p>But actions speak louder than words. Organizations have to reward the right behaviors, and tolerate respectful dissent or divergent thinking.</p>\n<p>Leads can inadvertently squelch this by applying their power differential (intentionally or unintentionally)</p>",
			"slugs": "actions-matter-more",
			"links": []
		},
		"g48845643ff_0_438": {
			"index": 139,
			"id": "g48845643ff_0_438",
			"title": "Getting yourself out a rut",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>If you aren’t growing or learning, you may be in a rut.</p>\n<p>A few things that can shake things up:</p>\n<ul>\n\t<li>Career or role change</li>\n\t<li>Moving abroad for 6 months or more</li>\n\t<li>Intentionally do something you’re bad at</li>\n\t<li>Seek out people who are very unlike yourself</li>\n</ul>\n<p>Always be curious. When you’re surprised, dig in and learn more!</p>",
			"slugs": "getting-out-of-rut",
			"links": []
		},
		"g48845643ff_0_433": {
			"index": 140,
			"id": "g48845643ff_0_433",
			"title": "Dissonance is stressful and expensive",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>E.g. if a process doesn’t actually model the problem space correctly but everyone is forced to pretend like it does</p>\n<p>A similar mechanic as <a card=\"g487aed6370_0_306\">bad structure actually obfuscating</a>.</p>\n<p>Or a team <em>says</em> they value creativity and new ways of thinking but in practice has rigid structure that subtly punishes new ways of looking at problems, since actions matter more than words.</p>",
			"slugs": "dissonance-is-stressful",
			"links": [
				"g487aed6370_0_306"
			]
		},
		"g4871092f30_0_1531": {
			"index": 141,
			"id": "g4871092f30_0_1531",
			"title": "Process Should Only Retroactively Pave Cowpaths",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_306\">Bad structure is actively costly</a>, and in complexity it can often be unclear what the right answer is.</p>\n<p>So the safest thing is to <strong>formalize how things </strong><strong><em>already </em></strong><strong>informally worked</strong>. If you are still <a card=\"g4871092f30_0_1581\">regularly being surprised</a>, that’s a sign it’s too early to structure that part of the problem.</p>\n<p>Resist the urge to overly formalize too much--it’s likely that the underlying dynamics are more subtle than you thought. Start with a <a card=\"g48845643ff_0_105\">loose structure and tighten as your rate of surprise goes down</a>. </p>\n<p></p>",
			"slugs": "process-pave-cowpaths",
			"links": [
				"g487aed6370_0_306",
				"g4871092f30_0_1581",
				"g48845643ff_0_105"
			],
			"inbound_links": [
				"g487aed6370_0_121"
			]
		},
		"g48845643ff_0_311": {
			"index": 142,
			"id": "g48845643ff_0_311",
			"title": "Credibility is informal authority",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Authority is people giving you the benefit of the doubt--taking what you say as a given by default.</p>\n<p>Formal authority comes from being formally empowered in an org structure. Informal authority is earned credibility. </p>\n<p>In a healthy org, formal and informal authority have a high correlation.</p>\n<p>Note that in bottoms-up cultures, sometimes informal authority is way more important than formal authority.</p>\n<p>Credibility is often called “political capital”.</p>",
			"slugs": "credibility-informal-authority",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_301",
				"g487aed6370_0_96",
				"g48845643ff_0_239",
				"g48845643ff_0_301",
				"g4a9e93532f_0_35"
			]
		},
		"g48a31f22cb_0_55": {
			"index": 143,
			"id": "g48a31f22cb_0_55",
			"title": "Cultures can be bottoms-up or tops-down",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Organization cultures exist on a spectrum between tops-down and bottoms-up. </p>\n<p>The more top-down, the more predictable and merely complicated (although even these structures are more complex than they appear). These organizations are efficient but not very resilient.</p>\n<p>The more bottoms-up a culture is, the more emergent the behaviors, and the more the system can be thought of <strong>as an ecosystem</strong>. In these cultures, <a card=\"g487aed6370_0_281\">coordination is enormously expensive</a> and process is often not correlated with what’s actually happening, but the more resilient the organization is to unexpected shocks.</p>\n<p> The more bottoms-up your organization is, the more you should approach problems  by <a card=\"g487aed6370_0_40\">default as complex</a>.</p>",
			"slugs": "culture-bottoms-up-top-down",
			"links": [
				"g487aed6370_0_281",
				"g487aed6370_0_40"
			],
			"inbound_links": [
				"g487aed6370_0_96",
				"g4a3ed6c576_4_0"
			]
		},
		"g4a3ed6c576_4_0": {
			"index": 144,
			"id": "g4a3ed6c576_4_0",
			"title": "Resilient systems can weather discontinuities better",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Systems in equilibrium can generally continue under their own momentum and internal logic for long stretches of time.</p>\n<p><a card=\"g487aed6370_0_241\">Discontinuities</a> are large external shocks to a system. These external shocks can bend the internal logic of a system, potentially to the point where it breaks. At that point, the system descends into chaos. Sometimes that states is temporary and will reconfigure itself into a slightly new (but unpredictable) equilibrium. Sometimes the system is sufficiently different it can never reconfigure.</p>\n<p>Systems that can weather discontinuities are resilient. That means they can <strong>bend farther without their internal loops breaking</strong>. As a general rule, <strong>the more </strong><strong><a card=\"g48a31f22cb_0_55\">top-down</a></strong><strong> and </strong><strong><a card=\"g487aed6370_0_306\">efficient</a></strong><strong> a system is, the less resilient</strong>.</p>",
			"slugs": "resilient-systems-weather-discontinuities",
			"links": [
				"g487aed6370_0_241",
				"g48a31f22cb_0_55",
				"g487aed6370_0_306"
			],
			"inbound_links": [
				"g48845643ff_0_105"
			]
		},
		"g487aed6370_0_281": {
			"index": 145,
			"id": "g487aed6370_0_281",
			"title": "In bottoms-up cultures, coordination is impossibly expensive",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The cultures of large teams can be thought of via the systems theory lens.</p>\n<p>In bottoms-up culture, autonomy is prized, and power structures are diffuse and informal.</p>",
			"slugs": "bottoms-up-coordination-expensive",
			"links": [],
			"inbound_links": [
				"g48a31f22cb_0_55"
			]
		},
		"g48845643ff_0_301": {
			"index": 146,
			"id": "g48845643ff_0_301",
			"title": "Support for nuanced approach needs to come from the top",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>At the lower levels of an organization, execution and efficiency are most important.</p>\n<p>Nuanced approach to complex spaces often feels like navel-gazing in the short term, fanciful, abstract, and disconnected from reality. The nuanced approach is obviously powerful when its full effect is seen, but you have to build to that point.</p>\n<p>It takes time for a nuanced approach to show its (compounding!) value, but during that time you need to rely on a large bank of <a card=\"g48845643ff_0_311\">credibility</a>, often from someone with authority (formal or informal) at a high level in the organization.</p>\n<p>If you don’t have that, you’ll have to make small bets to earn credibility, which will take a very long time to show compounding value.</p>",
			"slugs": "support-nuance-from-top",
			"links": [
				"g48845643ff_0_311"
			]
		},
		"g4871092f30_0_1566": {
			"index": 147,
			"id": "g4871092f30_0_1566",
			"title": "Leads need to support the nuanced superpowers\t",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>In promotion environments, the things that are easiest to measure concretely are the easiest to convince people of in an anonymous committee</p>\n<p>So there’s already a bias</p>\n<p>But oftent he most important superpowers are the ones that are hardest to measure; nuance, insight, long-term thinking. (McNamara fallacy)</p>\n<p>The only way to help with this is for suficiently senior leadership to provide extra support and context and calibration about how that person is different than the ladder and that’s <em>what makes them special</em></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_204": {
			"index": 148,
			"id": "g48845643ff_0_204",
			"title": "A successful engine changes the incentives around it",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Akin to a gravity well</p>\n<p>This means that a successful ecosystem engine can start off with most entities not wanting to participate, but as it runs hotter it attracts more energy, which makes it more powerful, which attracts even more energy.</p>\n<p>This also means that analyzing an ecosystem requires an <a card=\"g48845643ff_0_209\">analysis over time, not just at a snapshot</a>.</p>\n<p>The lens of <a card=\"g4a3ed6c576_0_14\">game theory</a> can help elucidate these compounding effects.</p>",
			"slugs": "gravity-well",
			"links": [
				"g48845643ff_0_209",
				"g4a3ed6c576_0_14"
			],
			"inbound_links": [
				"g4a3ed6c576_0_14",
				"g4a6111ef7e_0_10",
				"g4a6111ef7e_0_20",
				"g4a7499c914_0_0",
				"g4a85094c68_0_55",
				"g48845643ff_0_25"
			]
		},
		"g48845643ff_0_209": {
			"index": 149,
			"id": "g48845643ff_0_209",
			"title": "Analyzing an engine requires seeing trends over time",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Anything with a compounding loop has <strong>dynamics that will change over time</strong>. This means analyzing a static snapshot of a system can lead to very wrong conclusions, because they miss the important compounding effects.</p>\n<p>You must analyze the system to understand where non-linearities exist, and most critically, understand where feedback loops will activate, since those can dominate all other factors in a system.</p>\n<p>Humans are very good at intuitively understanding 2D graphs, but it’s hard to visualize 2D graphs changing over time, and videos are harder to produce and take longer to watch. </p>\n<p>This is one of the reasons that <a card=\"g487aed6370_0_321\">continuous effects--even compounding ones--are often hard to spot</a>.</p>",
			"slugs": "analyze-engines-over-time",
			"links": [
				"g487aed6370_0_321"
			],
			"inbound_links": [
				"g48845643ff_0_204"
			]
		},
		"g48845643ff_0_215": {
			"index": 150,
			"id": "g48845643ff_0_215",
			"title": "Heroism is a form of unsustainable extrinsic energy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Heroism is celebrated in the tech industry</p>\n<p>It often <em>is </em>the right approach, but only in the short-term. In the long-term it prevents more sustainble, compounding effects from taking hold, e.g. sustainable team structure with clear leadership.</p>\n<p>It’s especially unreasonable when you counter your linear force against a thriving engine</p>",
			"slugs": "heroism-unsustainable",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_296",
				"g48845643ff_0_443",
				"g48845643ff_0_255",
				"g48845643ff_0_479"
			]
		},
		"g48845643ff_0_281": {
			"index": 151,
			"id": "g48845643ff_0_281",
			"title": "The more energy in a system, the bigger its adjacent possible",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Going farther afield requires more energy--sometimes a lot more.</p>\n<p>But successful ecosystem engines have TONS of energy, so they can hop farther afield.</p>\n<p>Think of it like firebreaks, a powerful forest fire and hop larger and larger breaks.</p>",
			"slugs": "energy-bigger-adjacent-possible",
			"links": []
		},
		"g48845643ff_0_265": {
			"index": 152,
			"id": "g48845643ff_0_265",
			"title": "Abstract ideas are harder to communicate at scale",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>People like detail</p>\n<p>Abstract ideas require more background knowledge, more to nitpick.</p>\n<p>Exacerbated by Silicon Valley’s over-reliance on the technical lens.</p>\n<p>Only <a card=\"g48845643ff_0_459\">communicate your northstar as widely as you need to</a></p>",
			"slugs": "communicating-abstract-ideas-scale",
			"links": [
				"g48845643ff_0_459"
			],
			"inbound_links": [
				"g48845643ff_0_255",
				"g487aed6370_0_226",
				"g487aed6370_0_266"
			]
		},
		"g48845643ff_0_459": {
			"index": 153,
			"id": "g48845643ff_0_459",
			"title": "North stars don’t have to be socialized widely to be effective",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_81\">North stars</a> help you and the team decide between zig and zag points day to day.</p>\n<p>Socializing abstract ideas are hard, and in bottoms-up organizations, can be very expensive.</p>\n<p>If you don’t need someone to know the north star, sometimes you don’t need to emphasize it. In addition, your short-term plans should all plausibly add short-term value on their own (with the fact they move closer to the north star a bonus).</p>",
			"slugs": "north-stars-dont-need-much-socialization",
			"links": [
				"g487aed6370_0_81"
			],
			"inbound_links": [
				"g48845643ff_0_265"
			]
		},
		"g48845643ff_0_479": {
			"index": 154,
			"id": "g48845643ff_0_479",
			"title": "Beware doing non-scalable things",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Even when it’s early, because <a card=\"g48845643ff_0_215\">they’re a form of unsustainable heroics</a> and should only be used for a short period.</p>\n<p>If they work, then there’s never a good time to stop (at each time step, the easier thing to do is keep layering on duct tape than to fix the underlying problem, which continues to get more expensive). And more often, they get you stuck in corners from which there is no sustainable approach to be found.</p>\n<p>It can be OK if: </p>\n<ul>\n\t<li>It’s a time-boxed search for Product Market Fit, and you have a commitment to pause and do it more sustainably if you find fit.</li>\n\t<li>OR there’s a plausible incremental path to grow the unsustainable solution to a sustainable, equilbrium solution with no discontinuities</li>\n</ul>",
			"slugs": "beware-non-scalable",
			"links": [
				"g48845643ff_0_215"
			]
		},
		"g48845643ff_0_504": {
			"index": 155,
			"id": "g48845643ff_0_504",
			"title": "Rubrics can help systematize thinking",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Intuition can be biased in various ways.</p>\n<p>Rubrics are a nice tool to systematize your thinking, which makes it easier to analyze whether it’s plausible and unbiased.</p>\n<p>A well-distilled rubric can sharpen your intuition and clarify where ambiguity remains (and how much is left).</p>\n<p>Of course, be careful not to let it replace your thinking, only guide it.</p>",
			"slugs": "rubrics-systematize-thinking",
			"links": []
		},
		"g48845643ff_1_40": {
			"index": 156,
			"id": "g48845643ff_1_40",
			"title": "Polarities are difficult to keep in balance",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Polarities are two good things in fundamental tension and trade-off.</p>\n<p>The right balance point depends on the context, and often needs subtle adjudgements and nudges.</p>\n<p>But the feedback loop is long, which leads to swinging over-corrections by default.</p>\n<p>Polarities are had to detect mis-balances in practice because there’s not ONE polarity with a two-dimensional balance (which is hard enough to detect) but a three dimensional sweep of them that all need to be kept in balance, and it’s hard to keep track of which ones might be salient</p>\n<p>And often there are polarities that aren’t obvious (like transparency vs candor)</p>\n<p></p>",
			"slugs": "polarities-in-balance",
			"links": []
		},
		"g487aed6370_0_226": {
			"index": 157,
			"id": "g487aed6370_0_226",
			"title": "The McNamara Fallacy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The McNamara fallacy states, roughly, that <a href=\"https://en.wikipedia.org/wiki/McNamara_fallacy\">things that cannot be measured do not matter</a>. </p>\n<p>Although this can be true in some obvious problem spaces, and even, sometimes, in complicated ones, it is untrue in complex problem spaces. In fact, in <strong>complex problem spaces often the factors that can’t be measured are the </strong><strong><em>most</em></strong><strong> important</strong>.</p>\n<p>Complex problem spaces often have highly emergent, compounding properties that mean that subtle differences in incentives, problem structure, or momentum can lead to vastly different outcomes.</p>\n<p>The McNamara fallacy arises partially from the same underlying principle that leads to <a card=\"g48845643ff_0_265\">abstract ideas being hard to communicate at scale</a>.</p>",
			"slugs": "mcnamara-fallacy",
			"links": [
				"g48845643ff_0_265"
			]
		},
		"g48845643ff_1_25": {
			"index": 158,
			"id": "g48845643ff_1_25",
			"title": "In complexity, teams need maneuvering room",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Packing them in too tightly minimizes <a card=\"g4a5429b3f0_0_0\">maneuvering room</a>, and can lead to two bad situations: This is doubly true for PMs, who are often the savviest at navigating</p>\n<p>First is putting agents in competition over the same territory, which is fundamentally zero-sum (territory is rivalrous), which implies strife and conflict.</p>\n<p>The second is effectively the opposite. For territory in the middle that no one unambiguously owns, sometimes <em>no </em>agent will take responsibility, because they want to avoid stepping on the other agent’s toes, and want to avoid conflict.</p>\n<p>The solution for both is to ensure that the org structure (as much as possible) has a single decider who presides over the combined scope, which gives them <a card=\"g4871092f30_0_1561\">a positive-sum perspective</a> and helps them see where the structure is not set up for success.</p>\n<p></p>\n<p></p>",
			"slugs": "complexity-manuevering-room",
			"links": [
				"g4a5429b3f0_0_0",
				"g4871092f30_0_1561"
			]
		},
		"g4a6111ef7e_0_15": {
			"index": 159,
			"id": "g4a6111ef7e_0_15",
			"title": "Open Source does not necessarily mean open",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Open source in some ways does, because it’s possible to fork if the project goes too far in the wrong direction, but forking is expensive.</p>\n<p>Far more important are the power dynamics within the organization. Open projects have open governance, where the amount of power in the repo is proportionate to the amount of time and value that person has invested in the project.</p>\n<p>The most concrete test is: “<strong>If someone were to invest half a year of good quality work into the project, would they gain committer status?</strong>”</p>\n<p>Another test is if the work or organizing and designing the project is conducted in public documents and bugs, or if only the code is public. The former is way easier to fork, which has a nice balancing effect.</p>",
			"slugs": "open-source-vs-open",
			"links": [],
			"inbound_links": [
				"g4a6111ef7e_0_20",
				"g4a6111ef7e_0_40"
			]
		},
		"g4a41d8c468_1_62": {
			"index": 160,
			"id": "g4a41d8c468_1_62",
			"title": "The incentives of #1 and #2 are different than the rest",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>In a space, the top player often has a (plausible) play at some aggregation effect, which is really useful.</p>\n<p>The second player (and sometimes the third) think they can <em>become </em>the first.</p>\n<p>But everyone else sees they’ll never be number 1, and a better play is to pitch in together in a way that at least <em>no one </em>can control fully.</p>",
			"slugs": "incentives-different-at-top",
			"links": [],
			"inbound_links": [
				"g4a6111ef7e_0_10",
				"g4a41d8c468_1_67"
			]
		},
		"g4a6111ef7e_0_10": {
			"index": 161,
			"id": "g4a6111ef7e_0_10",
			"title": "Gravity wells are most common when two big players join in",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Creating a <a card=\"g48845643ff_0_204\">gravity well</a> effect is most likely when you have 1) a truly open source project that is open from day one, which creates the underlying <em>potential </em>for a gravity well.</p>\n<p>But in practice the thing that is the single best predictor of an open source gravity well is when <strong>two independent big players invest engineering effort into the project</strong>.</p>\n<p>That demonstrates that the project is unlikely to be controlled by a single powerful entity, and also that the biggest discontinuity in the path to gravity well (another big player participating) has been crossed.</p>\n<p>Related to <a card=\"g4a41d8c468_1_62\">the incentives of the top players is different than the rest</a>.</p>",
			"slugs": "gravity-wells-with-two-players",
			"links": [
				"g48845643ff_0_204",
				"g4a41d8c468_1_62"
			]
		},
		"g4a6111ef7e_0_20": {
			"index": 162,
			"id": "g4a6111ef7e_0_20",
			"title": "Open-source-from-first-commit minimizes discontinuities",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>An extreme version of <a card=\"g48a31f22cb_0_10\">minimizing discontinuities</a> when trying to create a <a card=\"g48845643ff_0_204\">gravity well</a> open source project. </p>\n<p>Think of the moment the project flips from private to public as a <a card=\"g48845643ff_0_519\">launch</a>. The project will start being developed in a new way. Will it be a truly open source project, or open code only? Will the project encourage participation and discussion from others, or shun it? Were any of the design decisions made to date incorrect and based on a poorly understood problem space? At that moment it’s impossible to tell.</p>\n<p>If the project is open from the beginning, other participants  can meaningfully participate in decision decisions if they choose, and the <a card=\"g4a6111ef7e_0_15\">bugs/designs/etc are more likely to be public and real</a>.</p>",
			"slugs": "open-from-first-commit",
			"links": [
				"g48a31f22cb_0_10",
				"g48845643ff_0_204",
				"g48845643ff_0_519",
				"g4a6111ef7e_0_15"
			],
			"inbound_links": [
				"g4a6111ef7e_0_40"
			]
		},
		"g4a6111ef7e_0_25": {
			"index": 163,
			"id": "g4a6111ef7e_0_25",
			"title": "Public discussion lists are good accelerants",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Ecosystems have <a card=\"g48845643ff_0_191\">enablers and accelerants</a>. </p>\n<p><strong>Any project with motivated users</strong> (all developer offerings, most creative tools, a number of other product types) <strong>will have meaningful acceleration of the core loop with a thriving public discussion list</strong>. It has its own compounding effect.</p>\n<p>There are a few reasons this works:</p>\n<ul>\n\t<li><strong><span class='small'>More moments</span></strong><span class='small'> - Each email people get has some chance of inspiring them to engage more. At the very least it’s a reminder the project exists on a regular basis.</span></li>\n\t<li><strong><span class='small'>Inspiration</span></strong><span class='small'> - The things others do will often inspire people to use the product in new ways</span></li>\n\t<li><strong><span class='small'>Community</span></strong><span class='small'> - The </span><span class='small'><a card=\"g4a6111ef7e_0_30\">stronger a community is, the lower the risk the project is</a></span><span class='small'>. A thriving mailing list is a direct indicator of the health of the community, so it makes a </span><span class='small'><a card=\"g4a6111ef7e_0_35\">trustworthy signal</a></span><span class='small'>.</span></li>\n</ul>\n<p>You can get these lists going--encouraging people to engage actively and supportively--with <a card=\"g48845643ff_0_554\">ringers</a>.</p>",
			"slugs": "public-discussion-accelerant",
			"links": [
				"g48845643ff_0_191",
				"g4a6111ef7e_0_30",
				"g4a6111ef7e_0_35",
				"g48845643ff_0_554"
			]
		},
		"g4a6111ef7e_0_30": {
			"index": 164,
			"id": "g4a6111ef7e_0_30",
			"title": "Projects with thriving communities are safer bets",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>When people decide to use a project, they’re taking a bet that the project will continue to at the very least continue to be maintained. This bet scales with the size of the project riding on it--up from a quick personal hobby project all the way up to $100M+ businesses. Projects with thriving communities are much safer bets. </p>\n<p>It’s tempting to dismiss this as mere herd mentality, but it’s more. For a few reasons:</p>\n<ul>\n\t<li><strong><span class='small'>Trustworthy signal</span></strong><span class='small'> - The signal is hard to fake, making it </span><span class='small'><a card=\"g4a6111ef7e_0_35\">trustworthy</a></span><span class='small'> as an indication of project utility</span></li>\n\t<li><strong><span class='small'>More documentation and tools</span></strong><span class='small'> - The more people using the project, the more likely there is to be good tutorials, good coverage on stack overflow, more tools designed to work with it, etc</span></li>\n\t<li><strong><span class='small'>Less risk - </span></strong><span class='small'>The chance that the project becomes unmaintained is lower, because it could be </span><em><span class='small'>any </span></em><span class='small'>motivated community member, and there are a lot of them. Also, if forking is necessary, the combined wisdom and knowledge in the heads of the broader community makes a </span><span class='small'><a card=\"g4a6111ef7e_0_40\">successful fork</a></span><span class='small'> more likely.</span></li>\n</ul>\n<p></p>",
			"slugs": "thriving-communities-safe-bets",
			"links": [
				"g4a6111ef7e_0_35",
				"g4a6111ef7e_0_40"
			],
			"inbound_links": [
				"g4a6111ef7e_0_25",
				"g4a6111ef7e_0_40"
			]
		},
		"g4a6111ef7e_0_40": {
			"index": 165,
			"id": "g4a6111ef7e_0_40",
			"title": "Ability to successfully fork is a measure of openness",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>When making a decision to use a project, a developer needs to assess the likelihood the project ceases to be maintained at some point in the future. One of the useful signals is, in the worst case, how hard would it be to successfully fork the project?</p>\n<p>That is, if any single entity went incompetent, lazy, or evil--even if it was the owner of the project--could you mitigate that risk?</p>\n<p>Some of the things that make a project more likely to be forkable:</p>\n<ul>\n\t<li><strong><span class='small'><a card=\"g4a6111ef7e_0_20\">Open from first commit</a></span></strong><strong><span class='small'> </span></strong><span class='small'>-- The entire history of the project is visible</span></li>\n\t<li><strong><span class='small'><a card=\"g4a6111ef7e_0_15\">Design docs and bugs are open </a></span></strong><span class='small'>- The history of all of the design decisions and their rationale is public</span></li>\n\t<li><strong><span class='small'><a card=\"g4a6111ef7e_0_30\">Thriving community</a></span></strong><span class='small'> - There are lots of people in the community who have developed knowledge (and motivation) and would be happy to help, and collectively have the expertise necessary</span></li>\n</ul>",
			"slugs": "ability-to-fork-openness",
			"links": [
				"g4a6111ef7e_0_20",
				"g4a6111ef7e_0_15",
				"g4a6111ef7e_0_30"
			],
			"inbound_links": [
				"g4a6111ef7e_0_30",
				"g48845643ff_0_37"
			]
		},
		"g4a6111ef7e_0_5": {
			"index": 166,
			"id": "g4a6111ef7e_0_5",
			"title": "Tackling a problem too early is 10x more expensive",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>In complexity, <a card=\"g48845643ff_0_121\">the future gets exponentially more fuzzy</a>. If you build a solution without <a card=\"g48a31f22cb_0_50\">concrete demand</a>, the likelihood you build a thing that is actually useful (and doesn’t violate a previously unknown constraint) is slim.</p>\n<p>Often solutions farther out need to resolve lots of unresolvable questions to move forward. Searching for those solutions is extremely expensive, distracting, and very unlikely to actually find a good solution.</p>\n<p>If the problem isn’t important now, but the dynamics of the problem space mean the problem won’t get any <em>harder </em>to solve later, you should table it. Also look for opportunities to factor out useful infrastructure that will be useful for that solution, but also many others, today, <a card=\"g487aed6370_0_20\">building a compounding effect</a> that might make the problem even easier to tackle in the future. </p>",
			"slugs": "tackling-problem-too-early-expensive",
			"links": [
				"g48845643ff_0_121",
				"g48a31f22cb_0_50",
				"g487aed6370_0_20"
			]
		},
		"g4a6111ef7e_0_45": {
			"index": 167,
			"id": "g4a6111ef7e_0_45",
			"title": "Transparency is not always good",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_251\">Everything is in balance</a>, and almost every good thing is in tension with some other good thing.</p>\n<p>Certain <a card=\"g48845643ff_0_377\">types of challenging topics are hard to discuss in public</a>. <a card=\"g4a6111ef7e_0_45\">Certain types of constraints</a> (especially about specific individuals) are subtle, or potentially embarrassing. A good idea, especially in a complex system, <a card=\"g487aed6370_0_161\">satisfies all salient constraints, even ones that aren’t known or acknowledged</a>.</p>\n<p>Transparency is <em>often </em>good, but like all things, there are downsides of going too far, and what’s important is finding the right balance point.</p>\n<p></p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_251",
				"g48845643ff_0_377",
				"g4a6111ef7e_0_45",
				"g487aed6370_0_161"
			],
			"inbound_links": [
				"g4a6111ef7e_0_45"
			]
		},
		"g4a41d8c468_1_47": {
			"index": 168,
			"id": "g4a41d8c468_1_47",
			"title": "Agents give too much weight to short-term considerations",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>It might seem that <a card=\"g48a31f22cb_0_45\">agents</a> will make rational decisions that are aligned with their long-term interests.</p>\n<p>But in many cases, the short-term considerations <em>dominate </em>the decision, especially when the long-term value is theoretical, abstract, or hard to measure. In practice, if the long-term value is any of these things, it has to be an order of magnitude larger than the short-term value to outweigh it. Related to developers <a card=\"g4a41d8c468_1_17\">always want more control</a>.</p>\n<p>The reasons for this preference is based on, among other things, <a href=\"https://en.wikipedia.org/wiki/Prospect_theory\">prospect theory</a>, the fact that far enough into the future <a card=\"g48845643ff_0_234\">you may have run out of runway anyway</a>, <a card=\"g487aed6370_0_55\">a preference for concrete detail</a>, and others.</p>",
			"slugs": "agents-focus-on-short-term",
			"links": [
				"g48a31f22cb_0_45",
				"g4a41d8c468_1_17",
				"g48845643ff_0_234",
				"g487aed6370_0_55"
			]
		},
		"g4a7499c914_0_0": {
			"index": 169,
			"id": "g4a7499c914_0_0",
			"title": "Aligning incentives: what starts as a bonus becomes primary",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>When aligning short and long-term incentives, often you can have something that is useful to people in the short term, with a (non-zero) bonus that isn’t why people do it, but is nice to have.</p>\n<p>If the bonus has a compounding effect <a card=\"g48845643ff_0_204\">gravity well</a>, then over time that “bonus” reason can become the primary motivator. And if it doesn’t, you’re still adding value.</p>",
			"slugs": "aligning-incentives-bonus-to-primary",
			"links": [
				"g48845643ff_0_204"
			],
			"inbound_links": [
				"g4a85094c68_0_55",
				"g4a41d8c468_1_27"
			]
		},
		"g4a7499c914_0_5": {
			"index": 170,
			"id": "g4a7499c914_0_5",
			"title": "In complexity, assume there aren’t any big bold bets",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>They’re rare. And if you’re searching for them, you’ll miss the solid solutions that don’t violate any constraints and have compounding effects.</p>\n<p>Searching for big bold bets is a wild goose chase. And verify that it’s not just a fear of complexity motivating you to search for one instead of embracing complexity.</p>\n<p>And if there ARE big bold bets, then you’ll still likely come across them, because you understand the space better and know the constraints.</p>",
			"slugs": "complexity-no-big-bold-bets",
			"links": []
		},
		"g4a7499c914_0_10": {
			"index": 171,
			"id": "g4a7499c914_0_10",
			"title": "If you have informal authority, acting like it can give you more",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Informal authority is impossible to measure, but can be extremely important, especially in a bottoms- up org.</p>\n<p>If you have informal authority, <em>act </em>like it--confidently participate in discussions and apply nudges. If the nudges work, and people see that they work, then that will give you more informal authority, in a kind of self fulfilling prophecy.</p>\n<p>Obviously you should never extend your informal authority farther than it goes; this effect is mild compared to earning credibility the main way.</p>\n<p>A reverse corrolary of over-extending informal authority erodes it.</p>",
			"slugs": "informal-authority-behavior-can-create-more",
			"links": []
		},
		"g4a7499c914_0_15": {
			"index": 172,
			"id": "g4a7499c914_0_15",
			"title": "Success begets success",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Remember to generally focus on the system and context more than the individual.</p>\n<p>When you have success, that generally means you now enjoy a better position with better outcomes in your adjacent possible--an effect that compounds. If you’re good enough and don’t make active mistakes, this can keep compounding. Over time it can be easy to forget that it comes, ultimately, from luck.</p>\n<p>Privilege is one way of understanding the luck of your starting hand.</p>\n<p>But never forget that fundamentally it’s the system + good enough baseline characteristics + random luck, and that doesn’t make you a better person than people that weren’t lucky.</p>",
			"slugs": "success-begets-success",
			"links": []
		},
		"g4a7499c914_0_20": {
			"index": 173,
			"id": "g4a7499c914_0_20",
			"title": "Passion blinds you to more sustainable solutions",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Passion is an extraordinary motivating force for individuals and teams, where it exists.</p>\n<p>But one downside of passion is that because it’s such an over-riding obvious thing for the person who has it, their answer is often to try to get <em>others </em>to be passionate about the thing they’re passionate about. And when others don’t get passionate about the same things, the most obvious thing is to try <em>harder </em>to get them passionate. But that can erode credibility over time, and make you increasingly blind to better approaches.</p>\n<p><strong>Assume that others will never be passionate about the things you’re passionate about</strong>--that it’s only powerful to you for some random reason<strong>.</strong> That will help reveal more sustainable solutions that are good ideas on their own, and as a bonus line up with your passion, giving you more sustainable energy. Corrolary of not trying to build intrinsic motivation in others.</p>",
			"slugs": "passion-blinds",
			"links": [],
			"inbound_links": [
				"g4a7499c914_0_26",
				"g4a7499c914_0_31",
				"g4a7499c914_0_47"
			]
		},
		"g4a7499c914_0_26": {
			"index": 174,
			"id": "g4a7499c914_0_26",
			"title": "Teams motivated by passion become more passionate",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>If you have a charismatic leader who is <a card=\"g4a7499c914_0_20\">passionate</a> about something, the team itself will tend to get more passionate over time, too.</p>\n<p>This is not because people surrounded by people who are passionate about something tend to beocme passionate themselves (although that is a minor factor). It’s primarily because over time people who are already passionate about the same thing will be more likely to join the team--and people who are passionate will be more likely than the average person to <em>stay </em>on the team. The more passionate a team is collectively, the more likely that people who are <em>not </em>passionate will not feel compelled to stay.</p>\n<p>The net result is a team who is consistently and deeply passionate. That also means that if they <a card=\"g4a7499c914_0_31\">experience a setback it can be catastrophic</a>.</p>",
			"slugs": "passionate-teams-become-more-passionate",
			"links": [
				"g4a7499c914_0_20",
				"g4a7499c914_0_31"
			],
			"inbound_links": [
				"g4a7499c914_0_31",
				"g4a7499c914_0_47"
			]
		},
		"g4a7499c914_0_31": {
			"index": 175,
			"id": "g4a7499c914_0_31",
			"title": "Setbacks for passionate teams are crushing",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Passion is an amazingly powerful intrinsic motivator, <a card=\"g4a7499c914_0_20\">but it’s not without its downsides</a>.</p>\n<p>One additional one is that passion is a motivator that is at the very core of people’s identities. Whereas the vast majority of projects people work on are things those people have come to care about as they’ve invested in the team and sunk energy into it, passion is intrinsic.</p>\n<p>That means that when a <a card=\"g4a7499c914_0_26\">deeply passionate team</a> experiences a significant setback that conflicts with their passion--the team is down-sized, split, or told to work on something else--the effect, instead of being a headwind, can be catastrophic and can shake people to their very core.</p>\n<p>When looking at reorgs, leads often miss the depth of passion on a team and signifiantly under-estimate the shock it will cause. </p>\n<p></p>",
			"slugs": "passion-crushing-setbacks",
			"links": [
				"g4a7499c914_0_20",
				"g4a7499c914_0_26"
			],
			"inbound_links": [
				"g4a7499c914_0_26",
				"g4a7499c914_0_47"
			]
		},
		"g4a7499c914_0_47": {
			"index": 176,
			"id": "g4a7499c914_0_47",
			"title": "Passionate teams isolate themselves",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Teams that are passionate about somethin<a card=\"g4a7499c914_0_26\">g tend to become more passionate over time</a>. But almost with certainty, the broader organization they’re i<a card=\"g4a7499c914_0_20\">n doesn’t share the same passion</a>.</p>\n<p>As teams get more and more passionate, it isolates them from the broader team. Within the sub-team, the feeling grows and multiplies that the broader team “just doesn’t get it”. And within the broader team, the feeling grows and multiplies that the sub-team is “in their little corner”, focused on the wrong things, and hard to work with (because they insist on seeing everything through the lens of their passion). This effect compounds as distrust builds, and can lead to a point where the team is reorged to “fix it”, which <a card=\"g4a7499c914_0_31\">can be catastrophic for passionate teams</a>.</p>",
			"slugs": "passionate-teams-isolate-themselves",
			"links": [
				"g4a7499c914_0_26",
				"g4a7499c914_0_20",
				"g4a7499c914_0_31"
			]
		},
		"g4a85094c68_0_40": {
			"index": 177,
			"id": "g4a85094c68_0_40",
			"title": "Allowing incremental work minimizes activation energy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Certain types of problems have intrinsic energy once the agent gets going--for example an individual working on their hobby project.</p>\n<p>However, even if you want to work on your project on a rainy sunday, you need to get going from a stand still, to load up all of the working state into your brain. Once you do you’ll have <a card=\"g4a85094c68_0_45\">unstoppable momentum</a>. <strong>But overcoming that activation energy can be nearly impossible</strong>.</p>\n<p>If you break up your problem to allow incremental work even in short bursts, you’ll reduce the activation energy as much as possible, allowing the momentum to dominate. Document your next steps, reasoning, and design in GitHub issues. Leave some low-hanging fruit clean-up tasks that are easy to start and can give you some momentum. </p>",
			"slugs": "incremental-work-minimizes-activation-cost",
			"links": [
				"g4a85094c68_0_45"
			]
		},
		"g4a85094c68_0_45": {
			"index": 178,
			"id": "g4a85094c68_0_45",
			"title": "The flow state is like a drug",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The flow state is an amazing motivator for individuals--nearly limitless energy, sustainably. <a card=\"g48845643ff_0_138\">Harnessing it is one of the secrets to scale</a>, and it’s a wonderful thing.</p>\n<p>But there is a dark side--that momentum, when it’s running really hot, can distract you from other things you should be doing, like spending time with family, exercising, doing mundane chores, etc.</p>\n<p>Flow state, when it’s at its strongest, has some properties in common with drug addiction.</p>\n<p>Respect the power of flow state: build structure to force yourself to come up for air or time-box the amount of time you’re in flow state.</p>",
			"slugs": "flow-state-drug",
			"links": [
				"g48845643ff_0_138"
			],
			"inbound_links": [
				"g4a85094c68_0_40",
				"g4a85094c68_0_50"
			]
		},
		"g4a85094c68_0_50": {
			"index": 179,
			"id": "g4a85094c68_0_50",
			"title": "Time-box your flow state",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p><a card=\"g4a85094c68_0_45\">Flow state can run away and become a problem</a>.</p>\n<p>If you know that a certain type of problem or work will suck you in and it will be difficult to come up for air, expanding to take all space available, structure your day with <a card=\"g48845643ff_0_90\">black-and-white rules</a> about when you’ll stop, no matter what.</p>\n<p>For example, “after the commute I won’t open my work computer” or “no working on my hobby project after lunch on the weekend”</p>",
			"slugs": "time-box-flow",
			"links": [
				"g4a85094c68_0_45",
				"g48845643ff_0_90"
			]
		},
		"g4a85094c68_0_55": {
			"index": 180,
			"id": "g4a85094c68_0_55",
			"title": "Once given, it’s hard to reduce control of developers",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Once you give them flexibility / control, reducing it is extremely hard. It takes time, needs a powerful carrot and a powerful stick</p>\n<p>The lower level the control you give, the harder it is to combine 3P content together</p>\n<p>In the PMF environment, tempting to give away tons of control to developers to get them to participate, but that ceded control <a card=\"g4a85094c68_0_60\">heavily constrains possibilities.</a> It’s way better to find some developers who are incentivized to participate (perhaps for a <a card=\"g4a7499c914_0_0\">bonus that later becomes a primary motivator</a>) if you can get a <a card=\"g48845643ff_0_204\">gravity well</a> effect going.</p>\n<p></p>",
			"slugs": "removing-control-developers-hard",
			"links": [
				"g4a85094c68_0_60",
				"g4a7499c914_0_0",
				"g48845643ff_0_204"
			],
			"inbound_links": [
				"g4a85094c68_0_60"
			]
		},
		"g4a85094c68_0_60": {
			"index": 181,
			"id": "g4a85094c68_0_60",
			"title": "The more control given to developers, the harder to combine",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>If you need to execute script to see what the content “is”, then whether the content is good/well-behaved reduces to the halting problem. The messier the content, the harder it is to inter-link, compose, etc, vastly constraining what can be done with it.</p>\n<p>Related to <a card=\"g4a85094c68_0_55\">control is hard to wrest away from developers once given</a></p>",
			"slugs": "developer-control-makes-combining-hard",
			"links": [
				"g4a85094c68_0_55"
			],
			"inbound_links": [
				"g4a85094c68_0_55",
				"g4a41d8c468_1_37"
			]
		},
		"g4a85094c68_0_65": {
			"index": 182,
			"id": "g4a85094c68_0_65",
			"title": "Monetization is extractive of energy",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>If you have an engine going, the energy flowing through can be harnessed to do useful work. In an engine that energy usually goes to inspire <em>more </em>energy, in a compounding effect.</p>\n<p>But you can also use that energy, combined with a point of influence, to monetize.</p>\n<p>But that energy that is extracted from the system can’t be used to do other (possibly compounding) work. If you extract too much, you can break the engine. The dynamics are similar to overfishing. Think of trading off money now for high opportunity cost of future money.</p>\n<p>If you have an engine and a given amount of money you want to extract, it’s better to let the engine run hotter and extract a relatively smaller proportion of the total energy instead of over-extracting too early.</p>",
			"slugs": "monetization-extractive-energy",
			"links": []
		},
		"g4a41d8c468_1_92": {
			"index": 183,
			"id": "g4a41d8c468_1_92",
			"title": "The randomness of details: the butterfly effect",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>The <a href=\"https://en.wikipedia.org/wiki/Butterfly_effect\">butterfly effect</a> in famous,  but the popular understand is misleading.</p>\n<p>The fact that that precise outcome was kicked off by that one butterfly’s wing flapping is both true and distracting. Because had that butterfly not flapped its wings just so, something similar likely would have happened for different reasons.</p>\n<p>In systems, you should <a card=\"g48845643ff_1_45\">analyze the system that creates the potential for outcomes, more than the details of the individual</a>, which is often just a random collection of happenstance.</p>\n<p>The thing to observe is that the system created conditions where an outcome within some region of probability was a near certainty; the precise point that was the outcome is not interesting.</p>",
			"slugs": "butterfly-effect",
			"links": [
				"g48845643ff_1_45"
			]
		},
		"g4a9e93532f_0_10": {
			"index": 184,
			"id": "g4a9e93532f_0_10",
			"title": "Complexity’s defining characteristic is it can’t be reduced",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_45\">Complicated vs complexity</a> is one of the key distinctions in many business environments. There are some <a card=\"g48845643ff_1_10\">complicated bits of the problem that can be chipped off</a>, but the hallmark of a complex problem is an <strong>irreducibly complex core</strong>.</p>\n<p>Complicated problems are black and white and perhaps extremely intricate, but fundamentally they can be separated into independent sub-problems, solved, and then re-combined into a working solution. They resemble software engineering in that way.</p>\n<p>But complex problems are so deeply inter-related in such subtle and important ways that trying to break them into sub-problems and solve them will yield solutions that cannot be recombined and be a viable solution to the broader problem. The sub-solutions are thus illusory and actively distracting; you’ve solved a “problem” that <a card=\"g487aed6370_0_161\">violates some key constraints and thus isn’t a good idea</a>.</p>\n<p></p>\n<p></p>",
			"slugs": "irreducible-complexity",
			"links": [
				"g487aed6370_0_45",
				"g48845643ff_1_10",
				"g487aed6370_0_161"
			],
			"inbound_links": [
				"g487aed6370_0_45",
				"g48845643ff_1_10"
			]
		},
		"g4a9e93532f_0_15": {
			"index": 185,
			"id": "g4a9e93532f_0_15",
			"title": "Beware illustory consensus due to ill-defined terms",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>People hate a lack of harmony and also <a card=\"g487aed6370_0_55\">hate being in abstract, complex problem spaces any longer than they have to</a>.</p>\n<p>Sometimes a group has what appears to be high-level consensus on a complex space, that as time goes on and things become more clear, is revealed to be illusory because there were fundamental disagreements. Often this is due to different people assuming that high-level terms had different concrete meanings (e.g. “MVP”, “infrastructure”)</p>\n<p>The solution is to <strong>rigorously document consensus, </strong>including specifically defining key terms, breaking down known constraints, etc. This is akin to writing a design doc to ensure your architectural approach to an engineering problem will work, and is necessary to ensure your consensus rests on a strong, rigorously defined base.</p>",
			"slugs": "illusory-consensus-terminology",
			"links": [
				"g487aed6370_0_55"
			]
		},
		"g4a9e93532f_0_30": {
			"index": 186,
			"id": "g4a9e93532f_0_30",
			"title": "Engagement in ecosystems follows a power law",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>If you look at the engagement of various actors in an ecosystem, it is a well-established pattern that it will follow a (steep) power-law distribution. It is not uncommon for less than 1% of agents to be responsible for 80% of the contributions.</p>\n<p>Often it’s tempting to try to get a large number of people to contribute to a system: to lower the friction to get more people contributing. But if the motivation doesn’t exist for those users, then reducing friction doesn’t do much. (And it’s not possible to create motivation where it doesn’t exist). </p>\n<p>Instead, the best bet is <strong>find your most motivated contributors and be laser-focused on making them happy and engaged</strong>. From there you can continuously try to grow the population of contributors, but often the biggest bang-for-buck is simply to make your already-engaged contributors have a higher engagement multiplier.</p>",
			"slugs": "",
			"links": []
		},
		"g4a9e93532f_0_35": {
			"index": 187,
			"id": "g4a9e93532f_0_35",
			"title": "In game-theoretic environments, threats must be credible",
			"sectionname": "Barely Edible",
			"updated": false,
			"body": "<p>Game-theoretic dynamics rule many types of systems, but it’s especially true of agents who are in a zero-sum framing with no relevant and credible higher authority to mutually appeal to.</p>\n<p>In these cases, ultimately all threats and power are informal posturing. What actions are in your adjacent possible define the moves you can plausibly make. You can sometimes posture in a way that makes certain bad moves for you look more plausible by aligning your incentives, or the well-known <a href=\"https://en.wikipedia.org/wiki/Madman_theory\">madman approach</a>.</p>\n<p>But one of the most important leverage points is demonstrating that your promises and actions in the past have been followed-through on. This is a form of <a card=\"g48845643ff_0_311\">credibility</a>, and is <a card=\"g48845643ff_0_306\">built</a>--and <a card=\"g487aed6370_0_301\">lost</a>--in similar ways. Because <a card=\"g4a9e93532f_0_40\">credibility is so difficult to gain but easy to lose</a>, credibility is often one of the most important assets in game-theoretic scenarios.</p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_311",
				"g48845643ff_0_306",
				"g487aed6370_0_301",
				"g4a9e93532f_0_40"
			],
			"inbound_links": [
				"g4a9e93532f_0_40"
			]
		},
		"g48845643ff_0_464": {
			"index": 189,
			"id": "g48845643ff_0_464",
			"title": "Tells that you’re in a complex space",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<ul>\n\t<li>Finger-pointing among teams</li>\n\t<li>Frustration with no obvious cause</li>\n\t<li>Strongly differing ideas about what the next step is</li>\n</ul>\n<p>… And remember, almost all problems are actually complex. Just take it as a given.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_291"
			]
		},
		"g4871092f30_0_1526": {
			"index": 190,
			"id": "g4871092f30_0_1526",
			"title": "Imagine the distant future to reveal your preferences",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Take advantage of temporal discounting (abstract vs concrete) to figure out how important given thing is in the short term by imaginging how easily you’d commit to it if were 6 months in the future (or 3 years for big things)</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_100"
			]
		},
		"g4a3ed6c576_4_5": {
			"index": 191,
			"id": "g4a3ed6c576_4_5",
			"title": "Maneuvering room is important in complex systems",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>In complex systems the future is hard to predict, and as you learn more you might</p>\n<p>Corollary to teams need maneuvering room (possible dupe)</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_105"
			]
		},
		"g4a3ed6c576_0_49": {
			"index": 192,
			"id": "g4a3ed6c576_0_49",
			"title": "Tools vs Services",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Related to <a card=\"g4a41d8c468_1_17\">developers always wanting more control</a>.</p>",
			"slugs": "",
			"links": [
				"g4a41d8c468_1_17"
			]
		},
		"g4871092f30_0_1561": {
			"index": 193,
			"id": "g4871092f30_0_1561",
			"title": "A Positive-Sum Perspective is necessary for good decisions",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>People “in” it with things to gain can’t be zero sum</p>\n<p>Leaders who are responsible for the entire scope of all of the problems (formally, or informally) are naturally in a zero-sum perspective</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_91",
				"g4871092f30_0_1551",
				"g48845643ff_1_25"
			]
		},
		"g487aed6370_0_266": {
			"index": 194,
			"id": "g487aed6370_0_266",
			"title": "Explain ideas with 70/20/10 mix short/medium/long-term",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p><a card=\"g48845643ff_0_265\">Abstract ideas are hard to communicate</a></p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_265"
			]
		},
		"g48845643ff_0_484": {
			"index": 195,
			"id": "g48845643ff_0_484",
			"title": "Incrementalism is not a bad word",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>As long as you have a clear north-star, so it’s not a random walk</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_0"
			]
		},
		"g48845643ff_0_222": {
			"index": 196,
			"id": "g48845643ff_0_222",
			"title": "Scaling requires letting go of the details",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p><a card=\"g487aed6370_0_236\">Nudges</a> are much more sustainable, but require you to focus not on precise outcomes, but rather that the system will get to a <em>region </em>of good outcomes</p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_236"
			],
			"inbound_links": [
				"g487aed6370_0_236"
			]
		},
		"g48845643ff_1_60": {
			"index": 197,
			"id": "g48845643ff_1_60",
			"title": "Distinguishing which details don’t matter is hard",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Embracing complexity means letting go of the details that don’t matter. But the key is “that don’t matter.” Often that’s only clear in retrospect.</p>\n<p>The main test is whether if this detail took any of likely values the direction of the next step would change (if not, it doesn’t matter). But that assumes that you know your north star.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_7": {
			"index": 198,
			"id": "g48845643ff_0_7",
			"title": "Openness is a spectrum",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>A polarity between resilience and cleanliness.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_2": {
			"index": 199,
			"id": "g48845643ff_0_2",
			"title": "Openness is about power differentials",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_14": {
			"index": 200,
			"id": "g48845643ff_0_14",
			"title": "You are biased about your own position in an ecosystem",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_19": {
			"index": 201,
			"id": "g48845643ff_0_19",
			"title": "A single closed point can affect an entire ecosystem",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g4871092f30_0_1546": {
			"index": 202,
			"id": "g4871092f30_0_1546",
			"title": "Two Peers With Different Skills Creates Friction",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>If two peers in the same function and area are peers and one of them isn’t clearly the lead it creates <a card=\"g4871092f30_0_1541\">friction</a></p>\n<p>Especially if they have <em>different </em>skills, because each won’t actively recognize how great it is the other ahs complimentary skills, because they’re in zero-sum</p>\n<p></p>",
			"slugs": "",
			"links": [
				"g4871092f30_0_1541"
			]
		},
		"g48845643ff_0_25": {
			"index": 203,
			"id": "g48845643ff_0_25",
			"title": "Open systems create gravity wells",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p><a card=\"g48845643ff_0_204\">Gravity wells</a></p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_204"
			]
		},
		"g48845643ff_0_31": {
			"index": 204,
			"id": "g48845643ff_0_31",
			"title": "Premature monetization can break an ecosystem’s loops",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_37": {
			"index": 205,
			"id": "g48845643ff_0_37",
			"title": "Minimizing your power in an ecosystem can help it thrive",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>This is best if it’s a <a card=\"g4a6111ef7e_0_35\">trustworthy signal</a>. One example is deliberately making the project <a card=\"g4a6111ef7e_0_40\">easy to fork</a>, or allowing members of the community to become committers.</p>",
			"slugs": "",
			"links": [
				"g4a6111ef7e_0_35",
				"g4a6111ef7e_0_40"
			]
		},
		"g48845643ff_0_43": {
			"index": 206,
			"id": "g48845643ff_0_43",
			"title": "Openness is an extreme “commoditize your complement”",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_48": {
			"index": 207,
			"id": "g48845643ff_0_48",
			"title": "Openness has large benefits but also large downsides",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Everything is in balance</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_54": {
			"index": 208,
			"id": "g48845643ff_0_54",
			"title": "Openness is not intrinsically a moral good",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_60": {
			"index": 209,
			"id": "g48845643ff_0_60",
			"title": "Even complex problems are constraint satisfaction problems",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Although the constraints are often not simple constraints, but abstract ones.</p>\n<p>There are a handful of <a card=\"g48845643ff_0_66\">different types of constraints</a>.</p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_66"
			],
			"inbound_links": [
				"g48845643ff_0_66"
			]
		},
		"g48845643ff_0_72": {
			"index": 210,
			"id": "g48845643ff_0_72",
			"title": "Types of simple constraints",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<ul>\n\t<li>Headcount</li>\n\t<li>Funding runway</li>\n\t<li>Distribution costs</li>\n</ul>\n<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_66"
			]
		},
		"g4a41d8c468_1_17": {
			"index": 211,
			"id": "g4a41d8c468_1_17",
			"title": "Developers always want lower level control than they should",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a41d8c468_1_47",
				"g4a3ed6c576_0_49"
			]
		},
		"g4a41d8c468_1_22": {
			"index": 212,
			"id": "g4a41d8c468_1_22",
			"title": "A well layered platform aligns incentives best",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Don’t have a huge jump downward if you need to peel back a layer</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_78": {
			"index": 213,
			"id": "g48845643ff_0_78",
			"title": "Dinosaur Bones: Hidden but concrete constraints",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_66"
			]
		},
		"g48845643ff_0_84": {
			"index": 214,
			"id": "g48845643ff_0_84",
			"title": "Laser beams: Fundamentally fuzzy constraints",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>\n<p>Examples: office politics, how easy-to-communicate an idea is,</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_0_66"
			]
		},
		"g48845643ff_0_95": {
			"index": 215,
			"id": "g48845643ff_0_95",
			"title": "The importance of aligning short and long-term incentives",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Especially individual short-term incentives with aggregate long-term incentives</p>\n<p>Hard to do in general, but when you find an idea that does align them, it’s likely a good idea.</p>\n<p>Sometimes you can add small nudges that take advantage of defaults in </p>\n<p>When the incentives don’t align where you want (which they rarely do), you’ll find outcomes you don’t want (and maybe no one does)</p>\n<p>Sometimes you can use <a card=\"g4a41d8c468_1_27\">guardrails to overcome small obstacles</a>.</p>",
			"slugs": "",
			"links": [
				"g4a41d8c468_1_27"
			],
			"inbound_links": [
				"g4a3ed6c576_0_54",
				"g4a3ed6c576_0_14",
				"g48845643ff_0_100",
				"g4a41d8c468_1_27"
			]
		},
		"g4a41d8c468_1_27": {
			"index": 216,
			"id": "g4a41d8c468_1_27",
			"title": "Guardrails sometimes align short and long-term incentives",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p><a card=\"g48845643ff_0_95\">Aligning short and long term incentives is important, but hard</a>.</p>\n<p>Sometimes developers don’t have a specific strong incentive, but have a default tend to zig or zag consistently. In those cases a guard rail can help divert the energy to the correct default.</p>\n<p>But if the incentive is too strong, not only will the energy hop the guardrail, but it might <a card=\"g48845643ff_0_244\">go to an even worse place (and with more momentum) than it was going before</a>.</p>\n<p>Examples are taking their energy <a card=\"g4a7499c914_0_0\">towards another thing for a compounding bonus they should want but don’t care about</a>--yet.</p>\n<p></p>\n<p></p>\n<p></p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_95",
				"g48845643ff_0_244",
				"g4a7499c914_0_0"
			],
			"inbound_links": [
				"g48845643ff_0_95"
			]
		},
		"g48845643ff_0_126": {
			"index": 217,
			"id": "g48845643ff_0_126",
			"title": "Similar systems dynamics exist in all human-scale systems",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<ul>\n\t<li>Individual motivation</li>\n\t<li>Teams</li>\n\t<li>Ecosystems</li>\n</ul>\n<p>See also Systems theory is a powerful lens</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48a31f22cb_0_45"
			]
		},
		"g48845643ff_0_132": {
			"index": 218,
			"id": "g48845643ff_0_132",
			"title": "Harness human systems’ intrinsic energy",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Individuals, teams, and ecosystems have intrisinc energy--energy that arises naturally from within the system without an external force.</p>\n<p>This energy can be harnessed to do useful work, like <a card=\"g48845643ff_0_443\">searching your adjacent possible</a> and prioritizing ideas.</p>\n<p>Where they’re more motivated (as in a successful developer ecosystem), there’s even more energy to harness.</p>\n<p></p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_443"
			],
			"inbound_links": [
				"g487aed6370_0_0",
				"g48a31f22cb_0_50",
				"g48845643ff_0_138",
				"g48845643ff_0_144"
			]
		},
		"g48845643ff_0_161": {
			"index": 219,
			"id": "g48845643ff_0_161",
			"title": "Extrinsic energy is unsustainable",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Energy has to come from somewhere; if you need to inject it into a system to keep it on track to counter the intrinsic energy of a system, it will fail.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_347": {
			"index": 220,
			"id": "g48845643ff_0_347",
			"title": "Positive sum framings are always preferable long term\t",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>…Wherever possible, if the sytem or operative framing can have that property</p>\n<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_398": {
			"index": 221,
			"id": "g48845643ff_0_398",
			"title": "Speed vs Velocity",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Velocity captures that speed in the wrong direction is not useful (and perhaps actively harmful)</p>\n<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_256"
			]
		},
		"g48845643ff_0_362": {
			"index": 222,
			"id": "g48845643ff_0_362",
			"title": "Emergent properties",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Things that arise naturally out of the dynamics of the system and the interactions of the pieces within the systems</p>\n<p>Can be hard to predict</p>\n<p>Sometimes only simulation can help predict</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_357": {
			"index": 223,
			"id": "g48845643ff_0_357",
			"title": "Cultural norms are emergent properties",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>People watch how others behave, and what behavior is rewarded or tolerated, and those _become_ the norms. Self-reinforcing.</p>\n<p>One of the reasons that noting microaggressions in the moment is important</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_367": {
			"index": 224,
			"id": "g48845643ff_0_367",
			"title": "Lend privilege where you have it",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Higher leverage than someone without it</p>\n<p>An action you take might be 100x more effective at setting the right cultural norms</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_372": {
			"index": 225,
			"id": "g48845643ff_0_372",
			"title": "Assume obstacles are helping you avoid a cliff you can’t see",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Especially in complex spaces, especially in environments where everyone’s incentives are (mostly) aligned</p>\n<p>Always be curious</p>\n<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_377": {
			"index": 226,
			"id": "g48845643ff_0_377",
			"title": "FUD-able ideas are hard to debate in public",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Everything is gray, but some complex ideas have a quick, black/white framing that is wrong but viral (activate moral outrage, fit with preconceived notions or themes, etc)</p>\n<p>Those topics are hard to have rational discourse on without carefully organizing the conversation.</p>\n<p>One of the reasons that policies are hard to discuss in a vote of non-experts, because topics that are complex enough and FUD-able enough can’t come to good outcomes.</p>\n<p>This is an example of the (often forgotten) balance between <a card=\"g4a9e93532f_0_5\">transparency and candor</a>.</p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_5"
			],
			"inbound_links": [
				"g4a6111ef7e_0_45"
			]
		},
		"g48845643ff_0_185": {
			"index": 227,
			"id": "g48845643ff_0_185",
			"title": "Accumulated experience is the compounding loop for people",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>One of the best way to tackle complex problem spaces is to pattern match--to be able to see large-scale patterns, and have a large library of patterns to martch against.</p>\n<p>This means that people who have this skill can get exponentially more effective over time.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48a31f22cb_0_30"
			]
		},
		"g48845643ff_0_198": {
			"index": 228,
			"id": "g48845643ff_0_198",
			"title": "Engines combine intrinsic energy with a compounding effect",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Ecosystem engines are some of the most powerful systems in the world</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_291": {
			"index": 229,
			"id": "g48845643ff_0_291",
			"title": "Navigating politics vs playing politics",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_101",
				"g48845643ff_0_296"
			]
		},
		"g48845643ff_0_296": {
			"index": 230,
			"id": "g48845643ff_0_296",
			"title": "Playing politics badly is the worst of all worlds",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>First, never <a card=\"g48845643ff_0_291\">play politics</a>.</p>\n<p>Demonstrates that you’re self-serving and your motives shouldn’t be trusted, while also being a way of <a card=\"g487aed6370_0_301\">over-using informal authority, massively eroding it</a>.</p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_291",
				"g487aed6370_0_301"
			],
			"inbound_links": [
				"g4a6111ef7e_0_0"
			]
		},
		"g48845643ff_0_408": {
			"index": 231,
			"id": "g48845643ff_0_408",
			"title": "Confirmation bias affects privileged people the most",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Because there are fewer signals that they might be wrong (especially if they’re senior).</p>\n<p>The more senior you are, the more actively you have to try to rigorously test your ideas and have others dig into them and try to break them (e.g. a Red Team)</p>\n<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_136"
			]
		},
		"g48845643ff_0_494": {
			"index": 232,
			"id": "g48845643ff_0_494",
			"title": "If you can’t be an impartial judge, find one",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Someone who doesn’t have skin in the game</p>\n<p>Helps protect against bias from within a team of various types, to ask the hard questions and help you weigh the evidence.</p>\n<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_1_50"
			]
		},
		"g48845643ff_0_514": {
			"index": 233,
			"id": "g48845643ff_0_514",
			"title": "Set success and kill criteria before the project gets going",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Take advantage of humans’ tendency to view far-future things abstractly and near-term things through emotion and bias.</p>\n<p>Get everyone to agree on what success or theres-no-way-this-works-if-this-is-true kill criteria look like <em>before </em>everyone gets overly emotionally tied to the solution they’re working on.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_331",
				"g4a6111ef7e_0_0"
			]
		},
		"g48845643ff_0_519": {
			"index": 234,
			"id": "g48845643ff_0_519",
			"title": "Launches are discontinuities",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>For consumer products you have to push for users to use it.</p>\n<p>A launch is a do or die roll of the dice. Maybe an influential blogger ate a bad burrito that day.</p>\n<p>If you don’t need a launch “bump” (which you don’t if there is intrinsic motivation from some subset of users) then avoid launch, look for a smooth roll out.</p>\n<p>Do things in public from the beginning (in open source) is an applciation of this insight</p>\n<p></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a6111ef7e_0_20"
			]
		},
		"g48845643ff_0_524": {
			"index": 235,
			"id": "g48845643ff_0_524",
			"title": "“Developers are just a different type of users” is misleading",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Yes, some of the same lenses (like CUJ) can be applied to developers.</p>\n<p>But for developers, the more salient lenses are ones that understand motivation, incentives, and compounding ecosystem effects. The lenses that work best for normal consumer products can be actively misleading or distracting.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_534": {
			"index": 236,
			"id": "g48845643ff_0_534",
			"title": "Don’t make the same mistake again",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Document mistakes to the root cause. Extract more abstract patterns. Distill them into the key insights so they can be more viral. Share them widely. Seek advice and cross-pollination so others can help you avoid mistakes you haven’t yet made, but they have before.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_539": {
			"index": 237,
			"id": "g48845643ff_0_539",
			"title": "“Infrastructure” means more than literal infrastructure",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Can be accumulated expertise, battle-tested code, battle-tested processes, usage patterns, momentum, </p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_549": {
			"index": 238,
			"id": "g48845643ff_0_549",
			"title": "Actually seek out disconfirming information",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Because we naturally look for confirming information, and because in friendly environment dissent is seen as rude.</p>\n<p>Assume you’re the villain</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_564": {
			"index": 239,
			"id": "g48845643ff_0_564",
			"title": "If you’re stuck",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Imagine (temporarily) that a fundamental assumption is actually the opposite. It probably isn’t, but that can shake up the thinking enough to dislodge new insights</p>\n<p>Also, rubber ducking works</p>\n<p>Also, <a card=\"g487aed6370_0_151\">asking why</a></p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_151"
			]
		},
		"g48845643ff_0_574": {
			"index": 240,
			"id": "g48845643ff_0_574",
			"title": "The highest cost is often opportunity cost",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>When there are near infinite different next actions you could take, and finite resources</p>\n<p>Opprotunity cost is hidden within the team, though, because the tradeoff isn’t visible, it’s all benefit, no cost.  It’s only from a higher-level perspective in the org that the trade-off can be seen.</p>\n<p>So the bar is not whether “this is a good idea” but rather “this idea is better than the other things we could be doing”.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_554": {
			"index": 241,
			"id": "g48845643ff_0_554",
			"title": "Bootstrap cultural norms with ringers",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>If you have a new mailing list, have a few ringers share thoughts, and behind the scenes encourage people to respond publicly and substantively.</p>\n<p>After you do it a few times, the culture will have taken hold and will be self-sustaining.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a6111ef7e_0_25"
			]
		},
		"g48845643ff_0_306": {
			"index": 242,
			"id": "g48845643ff_0_306",
			"title": "Earning credibility entails putting some on the line",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Double or nothing</p>\n<p>See also <a card=\"g487aed6370_0_301\">over-extending authority</a></p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_301"
			],
			"inbound_links": [
				"g487aed6370_0_301",
				"g4a9e93532f_0_35"
			]
		},
		"g487aed6370_0_326": {
			"index": 243,
			"id": "g487aed6370_0_326",
			"title": "MInimize number of changes necessary to succeed",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Corollary of minimize discontinuities.</p>\n<p>If an idea needs 5 different groups to independently prioritize a thing, and it’s only successful if all of them succeed, it won’t happen in a complex enviornment.</p>\n<p>(Game theory trap)</p>",
			"slugs": "",
			"links": []
		},
		"g487aed6370_0_146": {
			"index": 244,
			"id": "g487aed6370_0_146",
			"title": "The s-curve",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<ul>\n\t<li>Compounding effects</li>\n\t<li>Invisible asymtote</li>\n\t<li>Link to energy of human scale systems, self-sustaining flame</li>\n</ul>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_1_15": {
			"index": 245,
			"id": "g48845643ff_1_15",
			"title": "Ideas with larger adjacent possibles are better ideas",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Lots of maneuvering room within the solution space, giving you flexibility no matter how the world ends up going</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_1_20": {
			"index": 246,
			"id": "g48845643ff_1_20",
			"title": "Ruts help maximize energy to devote to novel problems",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Uncertainty takes energy to tackle.</p>\n<p>Ruts are factoring out the parts of your day or routine that don’t change much to reduce them to fully complicatd, or even obvious, problem spaces.</p>\n<p>That leaves more mental energy to focus on complex problems</p>\n<p>Efficiency is the top soil for creativity</p>\n<p>Flaubert quote, “Be regular and orderly in your life so you may be violent and original in your work.”</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_1_30": {
			"index": 247,
			"id": "g48845643ff_1_30",
			"title": "The Spidey Sense helps detect subtle but useful signal",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>In complexity there are rarely obvious signals, but rather subtle ones that all independently point in the right direction. It’s only by carefully digging and distilling and organizing the insights that it becomes clear the direction to go into.</p>\n<p>You need to be in tune with those signals, know where to dig more.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_1_35": {
			"index": 248,
			"id": "g48845643ff_1_35",
			"title": "Empathy is critical in complex spaces",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>You need to be able to see a problem from different perspectives, which requires being able to see things from other people’s perspectives, both to detect when there’s some subtle signal they’re trying to give you, and also as a novel vantage point to see new things from.</p>\n<p>If you see things as obstacles in complex spaces, it’s a recipe for disaster</p>\n<p>If empathy doesn’t come naturally for you, there are some tricks to force it:</p>\n<ul>\n\t<li>Identify a thing you think is an obvious good, then imagine what it’s in tension with, and why that thing could possibly be good</li>\n\t<li></li>\n</ul>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_529": {
			"index": 249,
			"id": "g48845643ff_0_529",
			"title": "Analysis should focus on the system, not specific individuals",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>If there’s plausibly a systemic issue at play (which most human issues are), analyze the systems that led people to do certain things, not that a specific individual was bad. That’s a cop out and prevents understanding and fixing the underlying issues.</p>\n<p>The insight behind blameless post mortems.</p>\n<p>A parallel to the fundamental attribution error.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_1_45": {
			"index": 250,
			"id": "g48845643ff_1_45",
			"title": "Often the system is way more relevant than the individual",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>It’s tempting to attribute success, failure, behavior to the intrinsic properties of an individual.</p>\n<p>But in practice the system in which that individual operates is often far more predictive of how they will behave than their intrinsic properties.</p>\n<p>Being good is necessary but not sufficient for success. Luck is a critical component, and depending on the context of where you are in the system, the distribution of “luck” can be radically different.</p>\n<p>This illusion is one that leads to meritocracy/inequality running rampant</p>\n<p><a href=\"https://twitter.com/ldobsonhughes/status/1070487063378739201\">Example</a></p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a41d8c468_1_92"
			]
		},
		"g48845643ff_0_489": {
			"index": 251,
			"id": "g48845643ff_0_489",
			"title": "Silicon Valley fetishizes risk",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Partially due to hero worship</p>\n<p>Partially due to an over-reliance on the technical lense, which reduces many complex problem spaces to chaotic (unknowable), so any option is as good as any other.</p>\n<p>Intentional risk is sometimes the best play if the EV is positive and you’ve de-risked as much as you can, but risk on its own, all other things equal, is actively bad.</p>\n<p></p>",
			"slugs": "",
			"links": []
		},
		"g4a41d8c468_1_37": {
			"index": 252,
			"id": "g4a41d8c468_1_37",
			"title": "Configuration options constrain future maneuvering room",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Configuration options interact in a matrix of conditions to consider and test. The cost of the goes up exponentially with number of config options, and <a card=\"g4a41d8c468_1_42\">deprecation is very expensive</a>.</p>\n<p>So it can feel like being responsive to concrete demand in the moment, but the long-term cost is substantial. With good design you can often cover most of the important cases with a minimum-spanning set of options.</p>\n<p>Corollary of why a well-layered platform is so useful, and that <a card=\"g4a85094c68_0_60\">giving too much control to developers is constraining</a></p>",
			"slugs": "",
			"links": [
				"g4a41d8c468_1_42",
				"g4a85094c68_0_60"
			]
		},
		"g4a5429b3f0_0_0": {
			"index": 253,
			"id": "g4a5429b3f0_0_0",
			"title": "Maneuvering room is the size of your adjacent possible",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>In complex spaces, you need maneuvering room to give you space to identify next actions that are both good ideas in the short term and align with your north star.</p>\n<p>Your maneuvering room is the size of your adjacent possible.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g48845643ff_1_25"
			]
		},
		"g4a41d8c468_1_42": {
			"index": 254,
			"id": "g4a41d8c468_1_42",
			"title": "Deprecation is way harder than launching",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Especially for developer features.</p>\n<p>Worst case is non-compounding or flat usage from a small number of heavy users</p>\n<p>Deprecation erodes trust in your future offerings that they won’t also be deprecated</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a41d8c468_1_37"
			]
		},
		"g4a41d8c468_1_52": {
			"index": 255,
			"id": "g4a41d8c468_1_52",
			"title": "Heavily constrained problems often have no big solutions",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>The more mature ,stable, large, and ossified the ecosytem is, the more the web of inter-related constraints, the more likely there isn’t a big, bold project or launch that could have huge impact without violating a constraint. (For example, entrenched but powerful interests may resist a change that disempowers them)</p>\n<p>Instead, you’ll need to focus on ideas with compounding leverage over time, which are boring.</p>\n<p>Hard to prove a negative, especially to leadership.</p>",
			"slugs": "",
			"links": []
		},
		"g4a41d8c468_1_57": {
			"index": 256,
			"id": "g4a41d8c468_1_57",
			"title": "Power is option value for future actions",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>A power differential or influence point is useful not because you <em>must </em>use it, but because it is option value on actions that otherwise wouldn’t be in your adjacent possible. </p>\n<p>If it’s not too expensive, and there’s high EV (small chance of huge impact, or large chance of shallow impact), then it can be worth it to invest in the capabilitiy.</p>\n<p>Corollary of the compounding effect of infrastructure</p>",
			"slugs": "",
			"links": []
		},
		"g4a41d8c468_1_67": {
			"index": 257,
			"id": "g4a41d8c468_1_67",
			"title": "The top dog rarely wants to standardize",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Corollary of open/standards as commodification, and the i<a card=\"g4a41d8c468_1_62\">ncentives of number 1 are different</a>.</p>",
			"slugs": "",
			"links": [
				"g4a41d8c468_1_62"
			]
		},
		"g4a6111ef7e_0_35": {
			"index": 258,
			"id": "g4a6111ef7e_0_35",
			"title": "Trustworthy signals are hard to fake",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>A signal should be a) correlated with the underlying thing it’s meant to be a signal of, and b) impossible (or at least prohibitively expensive) to fake.</p>\n<p>The concept comes from evolutionary biology, but applies in any game-theoretic scenario.</p>\n<p>In game theory scenarios where trust must be earned, trustworthy signals carry the most weight.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a6111ef7e_0_25",
				"g4a6111ef7e_0_30",
				"g48845643ff_0_37"
			]
		},
		"g4a41d8c468_1_77": {
			"index": 259,
			"id": "g4a41d8c468_1_77",
			"title": "Ignoring emotions in feedback will lead to confirmation bias",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>If you think that everyone is giving you 100% honest feedback to you (or your team’s) face all of the time, you’re probably wrong, especially if you’re powerful. Corollary of privileged have more confirmation bias, because nobody <em>wants</em> to need feedback.</p>\n<p>Giving feedback when stakes are high is hard, and often the calculation of value of chance for retribution is higher than the EV of feedback being received, so people don’t do it.</p>\n<p>Allowing anonymous or low-stakes feedback is critical, if nothing else to help be a barometer of how deeply you need to dig.</p>\n<p>Related to transparency is in <a card=\"g4a9e93532f_0_5\">tension with candor</a>.</p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_5"
			]
		},
		"g4a41d8c468_1_82": {
			"index": 260,
			"id": "g4a41d8c468_1_82",
			"title": "Invest energy to meet energy",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>In an ecosystem, motivated actors will often search the adjacent possible for you.</p>\n<p>You should invest energy to meet the observed energy you see (possibly a bit more). If there are compounding effects from a good PMF, that can lead to investing in the right options to maximize impact with finite resources.</p>\n<p>Corollary of respond to concrete demand.</p>",
			"slugs": "",
			"links": []
		},
		"g4a7499c914_0_42": {
			"index": 261,
			"id": "g4a7499c914_0_42",
			"title": "Benchmarks distill complexity to something measurable",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Making things that are otherwise impossible to compare comparable.</p>\n<p>But beware, Goodhart’s law applies even more strongly if competitive agents will compete strongly to win. </p>",
			"slugs": "",
			"links": []
		},
		"g4a41d8c468_1_87": {
			"index": 262,
			"id": "g4a41d8c468_1_87",
			"title": "Complexity is (often) worth it",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Complexity takes 10x more time and energy to dig into than complicated spaces.</p>\n<p>But often it’s worth it. Sometimes you don’t have a choice--the problem you are tasked with tackling is complex. But often complex system’s inter-linked nature means they’re rife with possibilities for compounding loops, which if you can harness them is totally worth it.</p>",
			"slugs": "",
			"links": []
		},
		"g4a41d8c468_1_72": {
			"index": 263,
			"id": "g4a41d8c468_1_72",
			"title": "Long or indirect feedback loops lead to oscillation",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>True in systems theory in general. </p>\n<p>Will lead to over-corrections and oscillation</p>",
			"slugs": "",
			"links": []
		},
		"g4a6111ef7e_0_0": {
			"index": 264,
			"id": "g4a6111ef7e_0_0",
			"title": "Compounding metrics are nearly always meaningful",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>In general, it’s good to <a card=\"g48845643ff_0_514\">set your success and kill criteria early</a>, before everyone gets into the thick of it and their judgement gets biased.</p>\n<p>There’s one (minor) exception: if you find a truly <a card=\"g48845643ff_0_296\">compounding metric</a>, in <em>any</em> metric with a plausible connection to a clear success or failure case, then you should take it seriously.</p>\n<p>Compounding effects only happen if there’s some feedback loop, and finding those feedback loop needles amongst the haystack of ideas is so rare that if you find one that looks like one, take it seriously and dig in to understand the loop.</p>",
			"slugs": "",
			"links": [
				"g48845643ff_0_514",
				"g48845643ff_0_296"
			],
			"inbound_links": [
				"g4a6111ef7e_0_50"
			]
		},
		"g4a6111ef7e_0_50": {
			"index": 265,
			"id": "g4a6111ef7e_0_50",
			"title": "Finding PMF is searching for a needle in a haystack",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Product Market Fit (PMF) is another word for a discovered compounding loop in a company’s adjacent possible space.</p>\n<p>These loops are hard to find and somewhat rare.</p>\n<p><a card=\"g4a6111ef7e_0_0\">If you find a compounding loop in any of your metrics, take it seriousl</a>y.</p>",
			"slugs": "",
			"links": [
				"g4a6111ef7e_0_0"
			]
		},
		"g4a85094c68_0_0": {
			"index": 266,
			"id": "g4a85094c68_0_0",
			"title": "Pragmatic optimism vs cynical idealism",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>The world isn’t perfect. There are all kinds of constraints that ideally wouldn’t be there or that are embarrassing or dispiriting. The incentives of system often align so that the outcome no one prefers is the default.</p>\n<p>The <a card=\"g4a85094c68_0_5\">perfect outcome doesn’t exist</a>. But it’s no use getting cynical about it.</p>\n<p>The pragmatic optimism outlook is that the world isn’t perfect and it never will be. But over long-enough timescales it tends to get better, and we can make deliberate decisions that compound to make it <strong>much </strong>better.</p>\n<p>Pragmatic optimism is necessary to tackle complex problem spaces. </p>",
			"slugs": "",
			"links": [
				"g4a85094c68_0_5"
			]
		},
		"g4a85094c68_0_5": {
			"index": 267,
			"id": "g4a85094c68_0_5",
			"title": "The perfect option doesn’t exist",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>The perfect is the enemy of the good.</p>\n<p>But in complex systems, even farther: <strong>the perfect option doesn’t exist</strong>. Perfect as balancing of forces that are in tension. Fast/Cheap/Good. If you’re searching for the perfect option, you’re probably just clinging to the search for a big bold bet because you’re afraid of complexity.</p>\n<p>Embrace complexity.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a85094c68_0_0"
			]
		},
		"g4a85094c68_0_10": {
			"index": 268,
			"id": "g4a85094c68_0_10",
			"title": "Vacations for leads should be a blip",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Leads should operate more and more by applying nudges.</p>\n<p>If a lead is gone for up to 2 weeks, no one should notice.</p>\n<p>If a lead is gone for between 2-4 weeks, questions on which decision to make should start accumulating.</p>\n<p>Between 4-6 weeks, the wheels should start wobbling in the project.</p>\n<p>If this doesn’t happen, there’s a chance that the lead is attempting (and likely failing) to lead via heroism</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a85094c68_0_15"
			]
		},
		"g4a85094c68_0_15": {
			"index": 269,
			"id": "g4a85094c68_0_15",
			"title": "Attempting to lead via heroism builds unsustainable teams",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Heroism in general is unsustainable. Leads should attempt to lead in complex spaces via nudges.</p>\n<p>But it’s hard to let go of details. Often leads say they want to delegate but only want to delegate execution, not strategy.</p>\n<p>If the lead is the decider, it can build a team that is unable to lead themselves, or to develop the skills to be comfortable in autonomy. It’s also likely that those teams will not be able to effectively dissent, making it more likely the team is pursuing bad ideas.</p>\n<p>If as a lead you <a card=\"g4a85094c68_0_10\">can’t take a vacation without the team derailing</a>, that’s a sign you’re attempting to lead via heroism.</p>\n<p></p>",
			"slugs": "",
			"links": [
				"g4a85094c68_0_10"
			]
		},
		"g4a85094c68_0_20": {
			"index": 270,
			"id": "g4a85094c68_0_20",
			"title": "Understanding systems is like understanding recursion",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Recursion appears at first to be non-intuitive: it requires a leap of faith that the recursion will complete and give the right answer.</p>\n<p>Trusting recursion will complete requires 1) ensuring that the base case is reached, 2) that any problem gets progressively smaller towards base case, and 3) that each inductive step is correct. If those are true, intuitively trusting recursion is letting go of doubt.</p>\n<p>Understanding systems intuitively is the same. Identify the large scale trends and forces. Verify that they’re converging, to a rigorous and plausible north-star. And then let go.</p>",
			"slugs": "",
			"links": []
		},
		"g4a85094c68_0_25": {
			"index": 271,
			"id": "g4a85094c68_0_25",
			"title": "VC funding is crowdsourcing search in the adjacent possible",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Motivated agents will search an adjacent possible.</p>\n<p>VC funding is predicated on blockbusters: support many different startups, and figure that one of them will win and win big to cover all of the investment.</p>\n<p>VC funding is an emergent property in an economy, but similar approaches can happen internally (just at a much smaller scale, meaning the approach is mathematically less sound).</p>\n<p>Remember <a card=\"g4a85094c68_0_30\">finding PMF is winning the lottery;</a> you need to be able to buy enough lottery tickets, and the return for the blockbuster has to be high enough, for it to be a sound investment strategy.</p>",
			"slugs": "",
			"links": [
				"g4a85094c68_0_30"
			]
		},
		"g4a85094c68_0_30": {
			"index": 272,
			"id": "g4a85094c68_0_30",
			"title": "Finding PMF is winning the lottery",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Finding a thriving engine is really hard, and most possible engines aren’t viable.</p>\n<p>When you find PMF, you’ll find compounding growth.</p>\n<p>But it’s a needle in a haystack.</p>\n<p>Finding PMF is like winning the lottery. There are patterns of investment that make it sound, but in general even if you buy 10 lottery tickets it’s still not a good investment.</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a85094c68_0_25"
			]
		},
		"g4a85094c68_0_35": {
			"index": 273,
			"id": "g4a85094c68_0_35",
			"title": "Leads should repeat their north star ad nauseum",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Ensures that the team is sighting off it, while giving them autonomy to make local decisions.</p>\n<p>Beware, though, not giving the team space to develop their own north-stars within sub-problems (because if they don’t then they won’t develop the ability to on their own)</p>",
			"slugs": "",
			"links": []
		},
		"g4a85094c68_0_70": {
			"index": 274,
			"id": "g4a85094c68_0_70",
			"title": "The entity that renders the pixels has the power",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g4a85094c68_0_75": {
			"index": 275,
			"id": "g4a85094c68_0_75",
			"title": "Three month crash efforts to derisk PMF scenarios",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>When you’re in a PMF environment, it can be hard to know what to build to not get left out.</p>\n<p>But building things too early is enormously expensive, and if you spread yourself thin you likely won’t build anything of substance.</p>\n<p>One way to derisk it is to prove to yourself that if someone else in the market were to find PMF in a given area, within three months you could have a successful crash effort to get out a viable competitor.</p>\n<p>With a <a card=\"g4a9e93532f_0_0\">competitor as a pseudo-north-star</a>, it’ll be easier to align internal incentives, which might mean that even if it’s possible to build it today, it will still be much cheaper if there were to be a competitor to chase.</p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_0"
			]
		},
		"g4a85094c68_0_80": {
			"index": 276,
			"id": "g4a85094c68_0_80",
			"title": "The lack of focus from no clear north star is very expensive",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>There are lots of things that aren’t that hard if everyone were pulling (mostly) in the same direction. That is, no miracles are required, but lots of people do have to pull together. This is the kind of work that’s just straightforward blocking and tackling, executing.</p>\n<p>This is especially true in PMF or otherwise ambiguous scenarios where there’s no clear shared north star.</p>\n<p>But if you find a north-star--or <a card=\"g4a9e93532f_0_0\">one happens naturally</a>--then that can snap a lot of things into high gear.</p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_0"
			]
		},
		"g4a9e93532f_0_0": {
			"index": 277,
			"id": "g4a9e93532f_0_0",
			"title": "A competitor with PMF is a fallback north-star",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Often it can be hard to find a north-star that everyone agrees to, which can be a drag on velocity.</p>\n<p>But if there’s a successful competitor who has PMF in a way that clearly makes strategic sense for you, too, that’s a convenient ready-made north-star that can be very motivating across the team, especially if the competitor is seen as a threat.</p>\n<p>But <strong>be extremely careful</strong>, for a number of reasons. First, this removes the need to develop a rigorous strategic north-star. If you do end up finding market success and no longer have someone to chase, the team might not know what to do, because the chase will have replaced strategy. </p>\n<p>Secondly, this is a special case of <a card=\"g487aed6370_0_191\">us-vs-them as a motivator</a>, which can become extremely toxic.  </p>\n<p></p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_191"
			],
			"inbound_links": [
				"g4a85094c68_0_75",
				"g4a85094c68_0_80"
			]
		},
		"g4a9e93532f_0_5": {
			"index": 278,
			"id": "g4a9e93532f_0_5",
			"title": "Transparency is in tension with candor",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>A specific (important) example of <a card=\"g487aed6370_0_251\">everything is in balance</a>.</p>\n<p>If things are fully transparent, and you don’t have a perfectly low-stakes, zero-power-differential environment (which almost never happen), then you likely are not hearing the real information, which means you likely aren’t designing solutions that are fully correct.</p>\n<p>Effectively you’ve failed to seek disconfirming evidence by making it less likely to show up.</p>\n<p>This isn’t to say that transparency isn’t good--because very often, more transparency is called for and good. It’s just to say that transparency is in tension with candor, and thus 100% complete transparency often isn’t good.</p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_251"
			],
			"inbound_links": [
				"g487aed6370_0_251",
				"g48845643ff_0_377",
				"g4a41d8c468_1_77"
			]
		},
		"g4a9e93532f_0_40": {
			"index": 279,
			"id": "g4a9e93532f_0_40",
			"title": "Credibility is orders of magnitude harder to gain than lose",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Credibility is hard to earn: some must be put on the line to earn it.</p>\n<p>Credibility is a demonstrated history of follow-through on past promises. It is partially an (expensive) way of signaling that your incentives and priorites are aligned so that when you make a promise, you keep it.</p>\n<p>But all it takes is a single slip-up, or a subtle pattern that suggests playing politics, that can call into question your motivations and incentives, and cause the credibility to evaporate extremely quickly.</p>\n<p><a card=\"g4a9e93532f_0_35\">Credibility is one of the most important assets in game theory</a>.</p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_35"
			],
			"inbound_links": [
				"g4a9e93532f_0_35"
			]
		},
		"g4a9e93532f_0_45": {
			"index": 280,
			"id": "g4a9e93532f_0_45",
			"title": "Org structures naturally create a converging effect",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Orgs have a shared ancestor that everyone reports into, and thus wants to make happy. That creates a natural converging effect, where people in the org all try to align their effort in a way that is at least consistent with what the ancestor wants.</p>\n<p>The nice thing about this converging effect is that it’s automatic and requires no constant influx of energy to maintain.</p>\n<p><a card=\"g4a9e93532f_0_50\">Org debt</a> exists when this structure is not being put to </p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_50"
			],
			"inbound_links": [
				"g4a9e93532f_0_55"
			]
		},
		"g4a9e93532f_0_50": {
			"index": 281,
			"id": "g4a9e93532f_0_50",
			"title": "Org debt",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>One of the types of abstract debt.</p>\n<p>Org structure is a natural convergence effect that can be harnessed to do useful aligning work. <strong>Org debt is when that natural converging effects is not being put to good use, or is working at cross-purposes to the strategic goals.</strong></p>\n<p>It is proportional to the sum of, for each pair in the group of agents who works together often on this project, the number of layers up the hierarchy you have to go to find their common ancestor, multiplied by how closely that pair must work and be aligned.</p>\n<p>Part of the reason is that escalating is a big, scary deal, and if the nearest common ancestor is very high up, there’s a huge chilling effect and many small misalignments won’t be flagged, accumulating and festering (compounding due to us-vs-them) until they might explode</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g4a9e93532f_0_45"
			]
		},
		"g4a9e93532f_0_55": {
			"index": 282,
			"id": "g4a9e93532f_0_55",
			"title": "Continued alignment requires an influx of energy ",
			"sectionname": "Stubs",
			"updated": false,
			"body": "<p>Alignment--where various agents are converging on the right answer--can be maintained by careful nudging. But it does often require active nudging. The cost of those nudges can add up considerably (while still being cheaper than the cost of motive force), especially if the nudges are of agents that are far afield or whose natural momentum is very different.</p>\n<p><a card=\"g4a9e93532f_0_45\">Org structure is one of the (rare) free forms of converging energy</a>.</p>",
			"slugs": "",
			"links": [
				"g4a9e93532f_0_45"
			]
		},
		"g48845643ff_0_342": {
			"index": 284,
			"id": "g48845643ff_0_342",
			"title": "Go slow to go fast",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>Application of compounding infrastructure</p>\n<p>Don’t jump to execution before doing discovery phase</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_352": {
			"index": 285,
			"id": "g48845643ff_0_352",
			"title": "Wording implying zero-sum framings is suspect",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>Using words like fight, beat, battle, “win”, all imply a zero-sum framing.</p>\n<p>If they keep coming up, watch out, becuase they might reveal the underlying wrong mind-set.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_569": {
			"index": 286,
			"id": "g48845643ff_0_569",
			"title": "Picking the most user value...",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>Is just a random walk. But if you have a north-star, you pick the thing that has the highest velocity: the highest speed in the general direction of the goal.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_413": {
			"index": 287,
			"id": "g48845643ff_0_413",
			"title": "Silicon valley’s technical hubris",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>That the technical lens is the one true lens</p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_311"
			]
		},
		"g48845643ff_0_544": {
			"index": 288,
			"id": "g48845643ff_0_544",
			"title": "Hope is not a strategy",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>Parallel to minimize miracles </p>",
			"slugs": "",
			"links": [],
			"inbound_links": [
				"g487aed6370_0_241"
			]
		},
		"g48845643ff_0_559": {
			"index": 289,
			"id": "g48845643ff_0_559",
			"title": "Ask if someone wants solutions or sympathy",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_286": {
			"index": 290,
			"id": "g48845643ff_0_286",
			"title": "An aggregator is an ecosystem with one primary beneficiary",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>So not open in the classical sense.</p>\n<p></p>",
			"slugs": "",
			"links": []
		},
		"g4a3ed6c576_8_0": {
			"index": 291,
			"id": "g4a3ed6c576_8_0",
			"title": "Most good ideas have some kind of compounding effect",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>Otherwise it never gets any cheaper or higher impact</p>\n<p>There are lots of (sometimes minor) compounding effects, like <a card=\"g487aed6370_0_20\">infrastructure</a></p>",
			"slugs": "",
			"links": [
				"g487aed6370_0_20"
			]
		},
		"g4a41d8c468_1_7": {
			"index": 292,
			"id": "g4a41d8c468_1_7",
			"title": "Starting with a whitelist makes solutions unscalable",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p></p>",
			"slugs": "",
			"links": []
		},
		"g4a41d8c468_1_12": {
			"index": 293,
			"id": "g4a41d8c468_1_12",
			"title": "Threat models should include how motivated attacker is",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>It’s not enough to show one threat reduces to another threat (e.g. <a href=\"https://www-users.cs.york.ac.uk/susan/joke/3.htm#boil\">the mathematician boiling water joke</a>).</p>\n<p>Because the amount of energy/motivation necessary to expend to use that vector matters hugely.</p>\n<p>If a nation state has physical access to your device you’re hosed, and everything reduces to that ultimately. But that doesn’t matter because the degree of energy required is what matters</p>",
			"slugs": "",
			"links": []
		},
		"g4a7499c914_0_36": {
			"index": 294,
			"id": "g4a7499c914_0_36",
			"title": "New mediums unlock new insights",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>They allow the human brain to off-load new types of thoughts, connections, calculations, and represent them in a different form.</p>",
			"slugs": "",
			"links": []
		},
		"g48845643ff_0_499": {
			"index": 295,
			"id": "g48845643ff_0_499",
			"title": "A problem is hard if it can be reduced to a hard problem",
			"sectionname": "Random Thoughts",
			"updated": false,
			"body": "<p>Similar to NP-Hard proofs</p>\n<p>If you’re trying to figure out if a given use case is plausibly strong in some context, but the use case, if it were strong, would be strictly stronger in the siimilar but more common context, but doesn’t exist, that strongly implies that the use case is not viable for some currently unknown reason</p>",
			"slugs": "",
			"links": []
		}
	},
	"slug_index": {
		"the-cynefin-model": "g487aed6370_0_25",
		"complex-complicated": "g487aed6370_0_45",
		"everything-is-complex": "g487aed6370_0_40",
		"critical-thinking": "g487aed6370_0_106",
		"embracing-complexity-details": "g487aed6370_0_61",
		"insights-distill-complexity": "g487aed6370_0_50",
		"lenses-mine-insights": "g487aed6370_0_111",
		"curiosity": "g487aed6370_0_141",
		"humans-dislike-complex": "g487aed6370_0_55",
		"black-and-white": "g487aed6370_0_66",
		"detail-illusion": "g487aed6370_0_71",
		"time-exponential": "g48845643ff_0_121",
		"beware-chaotic": "g487aed6370_0_30",
		"direction-not-solution": "g487aed6370_0_76",
		"collaborative-debate": "g487aed6370_0_35",
		"good-ideas-constraints": "g487aed6370_0_161",
		"adjacent-possible": "g487aed6370_0_0",
		"short-and-long-term": "g487aed6370_0_256",
		"minimize-time-to-value": "g48a31f22cb_0_50",
		"wind-at-your-back": "g487aed6370_0_261",
		"north-stars": "g487aed6370_0_81",
		"complexity-takes-times": "g487aed6370_0_291",
		"make-space-long-term": "g48845643ff_0_469",
		"dont-cling-bad-ideas": "g487aed6370_0_286",
		"ignoring-bites": "g48845643ff_1_5",
		"structure-should-guide-not-replace": "g487aed6370_0_121",
		"bad-structure-obfuscates": "g487aed6370_0_306",
		"avoid-collapsing-wave-function": "g487aed6370_0_86",
		"confusing-means-ends": "g487aed6370_0_156",
		"everything-balance": "g487aed6370_0_251",
		"patient-as-runway-allows": "g48845643ff_0_234",
		"small-decisions-compound": "g487aed6370_0_231",
		"compounding-infrastructure": "g487aed6370_0_20",
		"myth-of-infrastructure": "g48845643ff_0_453",
		"power-of-why": "g487aed6370_0_151",
		"continuous-hard-to-spot": "g487aed6370_0_321",
		"discontinuities-are-miracles": "g487aed6370_0_241",
		"resist-fire-fighting": "g487aed6370_0_296",
		"discovery-vs-performance": "g487aed6370_0_5",
		"minimize-discontinuities-performance": "g48a31f22cb_0_10",
		"intuition-superpower": "g48845643ff_0_403",
		"factor-out-complicated-pieces": "g48845643ff_1_10",
		"nudges": "g487aed6370_0_236",
		"when-to-nudge": "g48845643ff_0_227",
		"equilibriums-are-metastable": "g487aed6370_0_271",
		"miracles-survivorship-bias": "g487aed6370_0_311",
		"slippery-slope-discontinuity": "g487aed6370_0_331",
		"power-differentials-are-everywhere": "g4871092f30_0_1571",
		"emotional-vs-intellectual-intensity": "g487aed6370_0_171",
		"politics-is-emotion-at-scale": "g487aed6370_0_101",
		"moral-compass": "g487aed6370_0_91",
		"conditions-for-collaborative-debate": "g487aed6370_0_166",
		"us-vs-them": "g487aed6370_0_176",
		"us-vs-them-is-toxic": "g487aed6370_0_191",
		"us-vs-them-risk-factors": "g487aed6370_0_201",
		"team-culture-preventative-maintenance": "g487aed6370_0_207",
		"team-culture-preventative-maintenance-worth-it": "g487aed6370_0_212",
		"inadvertently-high-stakes": "g487aed6370_0_181",
		"privilege-as-power-differential": "g487aed6370_0_186",
		"strong-opinions-weakly-held": "g487aed6370_0_131",
		"squelching-dissent": "g487aed6370_0_136",
		"informal-authority-overextension": "g487aed6370_0_301",
		"lens-list": "g487aed6370_0_116",
		"cuj-lens": "g4a3ed6c576_0_34",
		"parallels-constraints": "g48a31f22cb_0_72",
		"historical-parallel-lens": "g48a31f22cb_0_66",
		"metaphor-lens": "g48a31f22cb_0_61",
		"time-scales-lens": "g4a3ed6c576_0_54",
		"game-theory-lens": "g4a3ed6c576_0_14",
		"systems-theory-lens": "g487aed6370_0_10",
		"simulation-lens": "g4a3ed6c576_0_19",
		"emergent-behavior": "g4a3ed6c576_0_29",
		"emergent-systems-cant-be-understood": "g4a3ed6c576_0_24",
		"compromise-cop-out": "g48845643ff_1_50",
		"ask-questions": "g48845643ff_0_509",
		"tell-of-compounding-loop": "g48845643ff_0_173",
		"enablers-vs-accelerants": "g48845643ff_0_191",
		"ecosystem-accelerants": "g4a41d8c468_1_0",
		"human-problems-are-complex": "g487aed6370_0_96",
		"nudges-look-like-luck": "g48845643ff_0_276",
		"one-on-one-magic": "g487aed6370_0_196",
		"agents-are-systems-with-motivation": "g48a31f22cb_0_45",
		"motivated-agents-search-adjacent-possible": "g48845643ff_0_443",
		"high-stakes-are-emotionally-intense": "g48a31f22cb_0_25",
		"gravitational-forces": "g48845643ff_0_255",
		"goodharts-law": "g48845643ff_0_250",
		"rate-of-surprise": "g4871092f30_0_1581",
		"ideas-look-bad-from-distance": "g48a31f22cb_0_15",
		"ignoring-hidden-forces-disaster": "g48845643ff_0_270",
		"cant-create-engine-in-lab": "g48845643ff_0_155",
		"friction-takes-energy-to-overcome": "g4871092f30_0_1541",
		"progress-takes-energy": "g48845643ff_0_260",
		"strategy-vs-tactics-perspective": "g487aed6370_0_246",
		"process-proportional-complicatedness": "g4871092f30_0_1536",
		"decision-making-not-magic": "g4871092f30_0_1551",
		"culture-as-ecosystem": "g487aed6370_0_276",
		"types-of-constraints": "g48845643ff_0_66",
		"compounding-effects-list": "g487aed6370_0_15",
		"systems-resist-obvious-forces": "g48845643ff_0_244",
		"runways-capital": "g48845643ff_0_239",
		"always-rules-better-than-sometimes-rules": "g48845643ff_0_90",
		"start-loose-structure-then-tighten": "g48845643ff_0_105",
		"focus-where-give-energy": "g48845643ff_0_138",
		"highest-and-best-use": "g48845643ff_0_138",
		"ecosystem-energy-incentives": "g48845643ff_0_144",
		"dont-create-intrinsic-energy": "g48845643ff_0_150",
		"instinctive-vs-aspirational-self": "g48845643ff_0_100",
		"self-sustaining-flame": "g48845643ff_0_111",
		"feedback-loops-compounding-effects": "g48845643ff_0_167",
		"continuous-processes-continuous": "g48845643ff_0_332",
		"leads-fuzzy-pattern-matching": "g48a31f22cb_0_30",
		"mentoring-win-win-win": "g48a31f22cb_0_35",
		"talking-distills-intuition-insight": "g48a31f22cb_0_40",
		"too-deep-fragmentation": "g4a3ed6c576_0_39",
		"developers-use-unanticipated": "g4a3ed6c576_0_44",
		"names-make-a-thing": "g48845643ff_0_337",
		"types-of-debt": "g48845643ff_0_388",
		"create-opportunities-dissent": "g48845643ff_0_423",
		"actions-matter-more": "g48845643ff_0_428",
		"getting-out-of-rut": "g48845643ff_0_438",
		"dissonance-is-stressful": "g48845643ff_0_433",
		"process-pave-cowpaths": "g4871092f30_0_1531",
		"credibility-informal-authority": "g48845643ff_0_311",
		"culture-bottoms-up-top-down": "g48a31f22cb_0_55",
		"resilient-systems-weather-discontinuities": "g4a3ed6c576_4_0",
		"bottoms-up-coordination-expensive": "g487aed6370_0_281",
		"support-nuance-from-top": "g48845643ff_0_301",
		"gravity-well": "g48845643ff_0_204",
		"analyze-engines-over-time": "g48845643ff_0_209",
		"heroism-unsustainable": "g48845643ff_0_215",
		"energy-bigger-adjacent-possible": "g48845643ff_0_281",
		"communicating-abstract-ideas-scale": "g48845643ff_0_265",
		"north-stars-dont-need-much-socialization": "g48845643ff_0_459",
		"beware-non-scalable": "g48845643ff_0_479",
		"rubrics-systematize-thinking": "g48845643ff_0_504",
		"polarities-in-balance": "g48845643ff_1_40",
		"mcnamara-fallacy": "g487aed6370_0_226",
		"complexity-manuevering-room": "g48845643ff_1_25",
		"open-source-vs-open": "g4a6111ef7e_0_15",
		"incentives-different-at-top": "g4a41d8c468_1_62",
		"gravity-wells-with-two-players": "g4a6111ef7e_0_10",
		"open-from-first-commit": "g4a6111ef7e_0_20",
		"public-discussion-accelerant": "g4a6111ef7e_0_25",
		"thriving-communities-safe-bets": "g4a6111ef7e_0_30",
		"ability-to-fork-openness": "g4a6111ef7e_0_40",
		"tackling-problem-too-early-expensive": "g4a6111ef7e_0_5",
		"agents-focus-on-short-term": "g4a41d8c468_1_47",
		"aligning-incentives-bonus-to-primary": "g4a7499c914_0_0",
		"complexity-no-big-bold-bets": "g4a7499c914_0_5",
		"informal-authority-behavior-can-create-more": "g4a7499c914_0_10",
		"success-begets-success": "g4a7499c914_0_15",
		"passion-blinds": "g4a7499c914_0_20",
		"passionate-teams-become-more-passionate": "g4a7499c914_0_26",
		"passion-crushing-setbacks": "g4a7499c914_0_31",
		"passionate-teams-isolate-themselves": "g4a7499c914_0_47",
		"incremental-work-minimizes-activation-cost": "g4a85094c68_0_40",
		"flow-state-drug": "g4a85094c68_0_45",
		"time-box-flow": "g4a85094c68_0_50",
		"removing-control-developers-hard": "g4a85094c68_0_55",
		"developer-control-makes-combining-hard": "g4a85094c68_0_60",
		"monetization-extractive-energy": "g4a85094c68_0_65",
		"butterfly-effect": "g4a41d8c468_1_92",
		"irreducible-complexity": "g4a9e93532f_0_10",
		"illusory-consensus-terminology": "g4a9e93532f_0_15"
	},
	"date": "2018-12-22T14:39:08.637Z"
}